{
  "Affordance": {
    "description": "Aspekte eines Objektes, die verdeutlichen, wie das Objekt benutzt werden kann.\nAnmerkung:\n1.\tAffordances und Selbstbeschreibungsfähigkeit sind Mittel, um interaktive Systeme intuitiv bedienbar zu machen..\nBeispiele für Affordances:\n1.\tEin Henkel einer Teetasse stellt eine offensichtliche Handlungsanweisung dar, sie zu halten. \n2.\tEin Button auf einer Webseite bietet die Handlungsanweisung, auf ihn zu klicken.\n3.\tEin Firmenemblem in der oberen linken Ecke einer Webseite bietet eingeschränkte Handlungsanweisung, darauf zu klicken.",
    "synonyms": []
  },
  "Anforderung": {
    "description": "Eine Bedingung oder Fähigkeit, die ein  interaktives System erfüllen oder besitzen muss, um einer Vereinbarung, einem Standard, einer Spezifikation oder anderen formal zugrunde gelegten Dokumenten zu genügen.\nAnmerkungen:\n1.\tEine Anforderung sollte eine festgelegte Bedingung haben, mit der sie validiert werden kann.\n2.\tDieses Glossar definiert die folgenden Arten von Anforderungen:\na.\tInteressenvertreteranforderung,\nb.\tMarktanforderung,\nc.\tOrganisatorische Anforderung,\nd.\tNutzungsanforderung.\n3.\tDieses Glossar unterscheidet außerdem zwischen \nQualitative Nutzungsanforderung, und Quantitative Nutzungsanforderung.",
    "synonyms": []
  },
  "Aufgabe": {
    "description": "Aktivität die erforderlich ist, um ein Ziel zu erreichen.\nAnmerkungen:\n1.\tViele Aufgaben können in Teilaufgaben unterteilt werden.\n2.\tViele Teilaufgaben führen zu Auswahlmöglichkeiten oder Eingaben des Benutzers während der Nutzung des interaktiven Systems. \n3.\tEinige Teilaufgaben können in kleinere Teilaufgaben aufgeteilt werden.\nBeispiele für Aufgaben: \n1.\t„Ein Auto mieten“ ist eine Aufgabe. \n2.\t„Eine Reservierung stornieren“ ist eine Aufgabe. \n3.\t„Sich auf der Webseite einer Autoverleihfirma registrieren“ ist eine Teilaufgabe. Registrierung ist vom Gesichtspunkt des Benutzers kein Ziel sondern ein Ärgernis.\n4.\t„Sich einloggen“ ist eine Teilaufgabe. Einloggen ist vom Gesichtspunkt des Benutzers kein Ziel sondern ein Ärgernis.\n5.\tDie Eingabe des Benutzernamens und das Drücken der Tabulatortaste ist eine von vielen Teilaufgaben die erforderlich sind, um die Teilaufgabe ”Log-in” abzuschließen.",
    "synonyms": []
  },
  "Aufgabenmodell": {
    "description": "Eine Beschreibung der Teilaufgaben die erledigt werden müssen, um die Ziele des Benutzers zu erreichen.\nAnmerkung:\n1.\tEin Aufgabenmodell beschreibt die Logik einer Aufgabe an sich, während ein Szenario die Erledigung einer oder mehrerer Aufgaben durch eine Persona beschreibt.",
    "synonyms": []
  },
  "Aufgaben­angemessenheit": {
    "description": "Die Eigenschaft eines interaktives Systems den Benutzer zu unterstützen, seine Aufgabe zu erledigen, d. h., die Funktionalität und Dialog an die charakteristischen Eigenschaften der Aufgabe anzupassen, anstatt an die zur Aufgabenerledigung eingesetzten Technologie.\nAnmerkung:\n1.\tEmpfehlungen zu Befolgung des Dialogprinzips:\na.\tDer Dialog sollte dem Benutzer solche Informationen anzeigen, die im Zusammenhang mit der erfolgreichen Erledigung der Aufgabe stehen.\nb.\tDer Dialog sollte dem Benutzer keine Informationen anzeigen, die nicht für die erfolgreiche Erledigung relevanter Aufgaben benötigt werden.\nc.\tDie Form der Eingabe und Ausgabe sollte der Aufgabe angepasst sein. Wenn für eine Aufgabe ganz bestimmte Eingabewerte typisch sind, sollten diese Werte dem Benutzer automatisch als voreingestellte Werte verfügbar sein.\nd.\tDie vom interaktiven System verlangten Dialogschritte sollten zum Arbeitsablauf passen, d. h. notwendige Dialogschritte sollten enthalten sein und unnötige Dialogschritte sollten vermieden werden.\n2.\tAufgaben­angemessenheit ist ein Dialogprinzip.",
    "synonyms": []
  },
  "Barrierefreiheit": {
    "description": "Die Attribute und Charakteristiken eines interaktiven Systems die Menschen mit eingeschränkter Sicht, eingeschränktem Hören, eingeschränkter Geschicklichkeit, eingeschränkter Kognition oder eingeschränkter physischer Mobilität ermöglichen sollen effektiv und effizient mit dem interaktiven System zu interagieren.\nAnmerkungen:\n1.\tStandards und Richtlinien für Barrierefreiheit sind verfügbar und in manchen Unternehmen oder Ländern gesetzlich zu erfüllen\n2.\tHilfsmittel zur Schaffung von Barrierefreiheit wie z.B. Screenreader können einem System hinzugefügt werden, um Menschen mit Behinderungen zu ermöglichen, das System zu nutzen",
    "synonyms": []
  },
  "Befund": {
    "description": "Siehe Usability-Befund",
    "synonyms": []
  },
  "Benutzer": {
    "description": "Person, die mit einem interaktiven System arbeitet oder Daten die vom System erzeugt werden benutzt.\nAnmerkungen:\n1.\t„Benutzer“ werden unterteilt in\na.\tDirekter Benutzer: Interagiert mit dem interaktiven System.\nb.\tIndirekter Benutzer: Benutzt Daten die vom interaktiven System erzeugt werden.\nc.\tPrimärer Benutzer: Interagiert mit dem interaktiven System um Ziele die vom interaktiven System unterstützt werden zu erreichen.\nd.\tSekundärer Benutzer: Interagiert mit dem interaktiven System um Unterstützung etc. zu geben.\n2.\tInteressenvertreter können Benutzer sein oder auch nicht. Sie werden nicht als Benutzer betrachtet wenn sie zwar durch das interaktive System beeinflusst werden, jedoch weder mit dem interaktiven System selbst interagieren noch das mit Hilfe des interaktiven Systems erzielte Arbeitsergebnis nutzen.\nBeispiele von Interessenvertretern die keine Benutzer sind:\n1.\tManager von Benutzern.\n2.\tPersonen die von Lärm der von der Person die das interaktive System benutzt erzeugt wird betroffen sind.\n3.\tMarketingfachleute die von der Auswirkung der Ergebnisse auf die Markenbezeichnung betroffen sind.",
    "synonyms": []
  },
  "Benutzererlebnis": {
    "description": "Wahrnehmungen und Reaktionen einer Person, die aus der tatsächlichen oder erwarteten Benutzung eines interaktiven Systems resultieren. \nAnmerkungen: \n1.\tBenutzererlebnis schliesst Usability ein. Usability Kriterien können eingesetzt werden um Aspekte des Benutzererlebnisses zu evaluieren.\n2.\tBenutzererlebnis umfasst die Gefühle, Meinungen, Bevorzugungen, Auffassungen und Leistungen der Benutzer die bevor, während und nach der Benutzung des interaktiven Systems auftreten.\n3.\tDas Benutzererlebnis hängt ab\tvon Markenimage, Darstellung, Funktionalität, Systemleistung, interaktivem Verhalten und unterstützenden Fähigkeiten des interaktiven Systems, sowie vom Nutzungskontext.\nBeispiele die den Unterschied zwischen Usability und User Experience veranschaulichen:\nWenn Blumen auf einer Website eines Blumengeschäftes zur Auslieferung bestellt werden:\n1.\tAufgetauchte Usability-Probleme während des Checkouts beeinflussen sowohl das Benutzererlebnis als auch die Usability.\n2.\tDie Qualität der physisch gelieferten Blumen beeinflusst ausschließlich die User Experience, nicht die Usability.\n3.\tDie gemachte Erfahrung beim Besuch des physikalischen Geschäfts, beeinflusst die User Experience zukünftiger Besuche der Website. Sie hat keinen Einfluss auf die Usability.\nAnmerkung zum Training:\n1.\tZertifizierungsanwärter müssen den Unterschied zwischen Usability und Benutzererlebnis kennen.",
    "synonyms": []
  },
  "Benutzergruppe": {
    "description": "Eine Gruppe von Benutzern mit denselben oder ähnlichen Personenmerkmalen und Nutzungskontext bezogen auf das interaktive System.",
    "synonyms": []
  },
  "Benutzer­befragung": {
    "description": "Eine Evaluierung bei der Benutzer subjektive Daten in einem Fragebogen angeben sollen, basierend auf ihren Erfahrungen bei der Benutzung eines interaktiven Systems. \nAnmerkung:\n1\tBenutzerbefragungen können verwendet werden, um die Zufriedenstellung mit einem interaktiven System zu evaluieren und um Informationen über den Nutzungskontext zu sammeln.\n2. \tBei korrekter Ausführung können Benutzerbefragungen einen höheren Grad an Sicherheit bei Evaluierungsergebnissen erzielen als jede andere qualitative Untersuchungsmethode.",
    "synonyms": []
  },
  "Benutzer­dokumentation": {
    "description": "Für Benutzer geschriebene oder andere Anleitungen zu dem interaktiven System, wie es funktioniert, und wie man es bedient.\nAnmerkung:\n1.\tBenutzer­dokumentation ist eine Form der Benutzerunterstützung.",
    "synonyms": []
  },
  "Benutzer­gruppen­profil": {
    "description": "Eine verallgemeinerte Beschreibung einer Benutzergruppe.",
    "synonyms": []
  },
  "Benutzer­unterstützung": {
    "description": "Informationen um einem Benutzer bei der Interaktion mit einem interaktiven System zu helfen.\nAnmerkungen:\n1.\tBenutzerunterstützung kann eine Beschreibung der Benutzeroberfläche selbst beinhalten, aber auch Informationen, wie der Benutzer am besten die Möglichkeiten des interaktiven Systems für die Erfüllung seiner Anforderungen einsetzen kann.\n2. \tBenutzerunterstützung schließt alle Formen von Hilfestellung, die für den Benutzer zur Verfügung stehen, ein, z.B.:\na.\tBenutzerdokumentation \nb.\tOnlinehilfe\nc.\tSysteminitiierte Benutzerführung",
    "synonyms": []
  },
  "Benutzer­zentrierte Gestaltung": {
    "description": "Siehe Menschzentrierte Gestaltung.",
    "synonyms": []
  },
  "Benutzer­zentrierte Usability-Evaluierung": {
    "description": "Usability-Evaluierung, die repräsentative Benutzer involviert, die bestimmte Aufgaben mit dem interaktiven System ausführen, um die Identifikation von Usability-Problemen oder die Messung von Effizienz, Effektivität und Zufriedenstellung zu ermöglichen.\nAnmerkung:\n1.\tSiehe Usability-Test.",
    "synonyms": []
  },
  "Benutzungs­schnittstelle": {
    "description": "Alle Bestandteile eines interaktiven Systems (Software oder Hardware), die Informationen und Steuerelemente zur Verfügung stellen, die für den Benutzer notwendig sind, um bestimmte Aufgaben mit dem interaktiven System zu erledigen.",
    "synonyms": []
  },
  "Beobachter": {
    "description": "Eine Person, die Benutzer beobachtet, die eine Aufgabe diskutieren oder eine Aufgabe mittels eines interaktiven Systems ausführen.\nAnmerkungen:\n1.\tBeobachter ist eine Rolle während einer Usability-Aktivität, wie z.B. Beobachtung, einer Usability-Testsitzung oder einer Fokusgruppe.\n2.\tBeobachter dürfen nicht aktiv in die Usability-Aktivität eingreifen. Sie können aber aktiv in die Analyse der Ergebnisse involviert sein.",
    "synonyms": []
  },
  "Beobachtung": {
    "description": "Eine Technik für das Sammeln von Kontextinformationen zu den Erfordernissen des Nutzungskontexts. Während einer Beobachtung sieht der Beobachter dem Benutzer bei der Ausführung von Aufgaben am interaktiven System zu. \nAnmerkungen:\n1.\tDer Beobachter greift nicht ein, außer  es besteht gelegentlich die Notwendigkeit zu einer klärenden Frage.\n2.\tWenn kein interaktives System benutzt wird, sollten die vorhandenen manuellen Abäufe beobachtet werden.\n3.\tDie Beobachtung sollte in einem möglichst natürlichen Kontext stattfinden, z. B. am Arbeitsplatz des Benutzers.",
    "synonyms": []
  },
  "Briefing": {
    "description": "Die erste Aktivität in einem Interview oder Usability-Test, in dem dem Teilnehmer erklärt wird, warum das Interview oder der Usability-Test durchgeführt wird und was seine Rolle und sein Beitrag ist",
    "synonyms": []
  },
  "Design Pattern": {
    "description": "Eine wiederverwendbare Lösung für ein Gestaltungsproblem innerhalb eines Kontexts. Ein Design Pattern beschreibt ein Gestaltungsproblem, eine Lösung und wo sich diese Lösung als funktionierend herausgestellt hat.\nAnmerkung:\n1.\tAuf Deutsch wird „design pattern“ manchmal als „Entwurfsmuster“ bezeichnet.\nAnmerkung zum Training:\n1.\tVerschiedene Webseiten bieten freien Zugang zu einer großen Auswahl an Design Patterns z.B. www.welie.com ",
    "synonyms": []
  },
  "Dialog": {
    "description": "Interaktion zwischen einem Benutzer und einem interaktiven System in Form einer Folge von Handlungen des Benutzers (Eingaben) und Antworten des interaktiven Systems (Ausgaben), um ein Ziel zu erreichen.",
    "synonyms": []
  },
  "Dialogprinzipien": {
    "description": "Allgemeine Ziele für das Dialogdesign.\nAnmerkungen\n1.\tDialogprinzipien sind unabhängig von einer spezifischen Technologie oder Technik\n2.\tAufgrund ihrer Allgemeingültigkeit kann es schwierig sein, Dialogprinzipien im konkreten Kontext umzusetzen.\n3.\tDie DIN EN ISO 9241-110 führt folgende sieben Dialogprinzipien auf:\na.\tAufgabenangemessenheit,\nb.\tSelbstbeschreibungsfähigkeit,\nc.\tErwartungskonformität,\nd.\tLernförderlichkeit,\ne.\tSteuerbarkeit,\nf.\tFehlertoleranz,\ng.\tIndividualisierbarkeit.\n4.\tVergleiche Dialogprinzip mit \na.\tHeuristik: Daumenregel, die der Umsetzung von Dialogprinzipien dient aber konkreter und einfacher anzuwenden ist.\nb.\tGestaltungsregel: Spezifischer Regel für das Design der Benutzungsschnittstelle.",
    "synonyms": []
  },
  "Direkter Benutzer": {
    "description": "Eine Person, die mit einem interaktiven System interagiert.\nAnmerkung\n1.\tEin direkter Benutzer ist ein primärer ode rein sekundärer Benutzer.\nBeispiele für direkte Benutzer\n1.\tEin Kundenbetreuer in einem Call-Center der ein Computersystem nutzt ist ein direkter Benutzer des Computersystems. Ein Kunde der das Call-Center anruft ist zwar ein direkter Nutzer des Services des Kundenbetreuers aber nur ein indirekter Benutzer des Computersystems. ",
    "synonyms": []
  },
  "Dringlichkeits­stufe": {
    "description": "Ein Maß für ein Usability-Problem aus einem Usability-Test, das die Auswirkung des Usability-Problems auf das Benutzererlebnis bewertet.\nAnmerkungen: \n1.\tDer Usability-Tester bewertet Usability-Probleme aus Sicht der Usability-Testteilnehmer. Manchmal erfolgen die Bewertungen in Kooperation des Usability-Testers mit einem Experten des Fachgebiets. \n2.\tTypische Dringlichkeits­stufen sind: niedrig, ernst, kritisch, lebensbedrohend.",
    "synonyms": []
  },
  "Effektivität": {
    "description": "Ausmaß der Vollständigkeit und Genauigkeit der Zielerreichung.\nAnmerkungen: \n1.\tDie Effektivität ist eines der drei messbaren Attribute für Usability. Die anderen beiden Attribute sind Effizienz und Zufriedenstellung.\n2.\tDie Effektivität ist ein Attribut von Usability, das auf die prinzipielle Fähigkeit zur Aufgabenerledigung verweist.",
    "synonyms": []
  },
  "Effizienz": {
    "description": "Eingesetzte Ressourcen, um bestimmte Ziele zu erreichen.\nAnmerkungen:\n1. Ressourcen beinhalten zeitliche, finanzielle und  materielle Aufwände sowie mentale Aufwände die aus menschlichem Wahrnehmen, Denken und Handeln resultieren  \n2.\tEffizienz ist eines der drei messbaren Attribute von Usability. Die anderen beiden Attribute sind Effektivität und Zufriedenstellung. \n3.\tEffizienz ist ein Attribut von Usability welches auf die Erledigung einer Aufgabe mit einem akzeptierbarem Aufwand verweist.   ",
    "synonyms": []
  },
  "Erfordernis": {
    "description": "Eine für einen Benutzer oder eine Benutzergruppe als notwendig identifizierte Voraussetzung, um ein Ziel innerhalb eines bestimmten Nutzungskontextes zu erreichen. \nAnmerkungen:\n1.\tEin Erfordernis ist unabhängig von jeglicher vorgeschlagenen Lösung für dieses Erfordernis. Mit anderen Worten: Ein Erfordernis darf nicht auf z.B. ”das System” oder ”die Website” hinweisen.\n2.\tErfordernisse werden aufgrund verschiedener Ansätze identifiziert, unter anderem  Interviews mit Benutzern, Beobachtungen, Benutzerbefragungen, Usability-Evaluierungen, Expertenanalyse usw.\n3.\tErfordernisse repräsentieren oftmals Lücken (oder Diskrepanzen) zwischen dem was ist und dem was sein soll.\n4.\tErfordernisse werden transformiert in Nutzungsanforderungen, die den Nutzungskontext, Benutzerprioritäten sowie das Wechselspiel mit anderen Anforderungen und -Einschränkungen mit berücksichtigen. \n4.\t„Erfordernis“ heisst auf Englisch „User need“.\nBeispiele für Erfordernisse:\n1.\tEin Vortragender (Benutzer) muss wissen, wie viel Zeit er noch hat (Voraussetzung), um den Vortrag während einer Präsentation mit einer festgelegten Zeitbeschränkung  (Nutzungskontext) abschliessen zu können (Ziel).\n2.\tEin Finanzbuchhalter (Benutzer) muss die Anzahl der erhaltenen Rechnungen und ihre Beträge kennen (Voraussetzung) um die tägliche Rechnungsstellung (Ziel) als Teil der Cashflow-Kontrolle (Nutzungskontext) fertigstellen zu können.",
    "synonyms": []
  },
  "Erwartungs­konformität": {
    "description": "Übereinstimmung mit den aus dem Nutzungskontext heraus vorhersehbaren Benutzerbelangen sowie allgemein anerkannten Konventionen.\nAnmerkungen:\n1.\tKonsistenz ist ein Aspekt der Erwartungskonformität.\n2.\tErwartungskonformität ist ein Dialogprinzip.\n",
    "synonyms": []
  },
  "Evaluierung": {
    "description": "Siehe Usability-Evaluierung",
    "synonyms": []
  },
  "Evaluierungs-bericht": {
    "description": "Ein Dokument, in dem die Ergebnisse eines Usability-Tests, einer Inspektion oder einer Benutzerbefragung dokumentiert werden.\nAnmerkung:\n1.\tDas Dokument für einen Usability-Test wird üblicherweise als Usability-Testbericht bezeichnet.",
    "synonyms": []
  },
  "Facilitator": {
    "description": "Siehe Moderator",
    "synonyms": []
  },
  "Fehlertoleranz": {
    "description": "Die Eigenschaft eines Dialogs das beabsichtigte Arbeitsergebnis trotz erkennbar fehlerhafter Eingaben entweder mit keinem oder mit minimalem Korrekturaufwand seitens des Benutzers zu erreichen.\nAnmerkung:\n1.\tFehlertoleranz ist ein Dialogprinzip.\nBeispiele für Fehlertoleranz:\n1.\tWenn ein Fehler auftritt, sollte das interaktive System eine genaue und verständliche Erklärung anbieten und konstruktiv eine Lösung vorschlagen, also was als nächstes zu tun ist.\n2.\tWenn aus einer Benutzeraktion schwerwiegende Folgen entstehen können, dann sollte das interaktive System eine Erklärung anbieten und eine Bestätigung vor der Durchführung der Aktion durch den Benutzer einholen.",
    "synonyms": []
  },
  "Fokusgruppe": {
    "description": "Eine gezielte Diskussion, bei der ein Moderator eine Gruppe von Teilnehmern durch eine Menge von Fragen zu einem bestimmten Thema führt. \nAnmerkungen: \n1.\tDie Durchführung von Fokusgruppen ist kein Ersatz für eine Usability-Evaluierung.\n2.\tFokusgruppen befassen sich mit Meinungen, Usability-Tests mit der Beobachtung des tatsächlichen Benutzerverhaltens.",
    "synonyms": []
  },
  "Formative Usability-Evaluierung": {
    "description": "Eine Art der Usability-Evaluierung die hilft, das Design für ein interaktives System zu verbessern, besonders während es noch gestaltet wird.\nAnmerkung:\n1.\tVergleiche mit Summative Usability-Evaluierung.",
    "synonyms": []
  },
  "Fragebogen": {
    "description": "Ein Satz von Fragen, der von Benutzern in einer Benutzerbefragung beantwortet wird, um  Daten zu sammeln.\nAnmerkungen: \n1.\tZwei wichtige Verwendungszwecke von Fragebögen im Bereich Usability sind:\na.\tUm den Nutzungskontext zu verstehen. Die gestellten Fragen beziehen sich auf die Erfahurngen die ein Benutzer mit dem momentanen, interaktiven System gemacht hat und die Erwartungen, die er an ein neues interaktives System stellt. \nb.\tUm das Benutzererlebnis vor, während und nach der Benutzung eines interaktiven Systems zu evaluieren.\n2.\tFragebögen müssen benutzbar sein. Sie müssen den Dialogprinzipien folgen, z.B.\na.\tJede Frage muss einen wesentlichen Beitrag zur Beantwortung der globalen Fragestellung liefern.\nb.\tFragen müssen leicht zu verstehen sein.\nc.\tDer Fragebogen muss die Benutzer hinsichtlich ihres Fortschritts in der Beantwortung der Fragen auf dem Laufenden halten.\nd.\tDer Fragebogen muss anhand eines Usability-Tests optimiert worden sein.\n3.\tDiese Definition bezieht sich sowohl auf Digitale- als auch auf Papierfragebögen.\nBeispielfragen um den Nutzungskontext zu verstehen:\n1. \t“Wann haben Sie das letzte Mal die Website für Autovermietung benutzt? Was wollten Sie auf der Seite tun?“\n2.\t“Was erwarten Sie von einer Website für Autovermietung?”\nBeispiele für Fragen zur Evaluierung der Zufriedenstellung:\n1.\t“Auf einer Skala von 1 bis 5, bei der 1 für “stimme gar nicht zu“, 3 „neutral“ und 5 für „stimme voll  zu“ steht, bewerten Sie bitte die folgenden Aussagen:\na.\tDie neue Website für Autovermietung sieht cool aus.\nb.\tDie neue Website für Autovermietung ist einfach zu benutzen.\nc.\tDie neue Website für Autovermietung ermöglicht schnelles Mieten von Autos.",
    "synonyms": []
  },
  "Gebrauchs­tauglichkeit": {
    "description": "Siehe Usability",
    "synonyms": []
  },
  "Geschlossene Frage": {
    "description": "Eine Interviewfrage die eine Antwort aus einem vordefinierten Satz von Alternativen fordert, oft einfach „ja“ oder „nein“.\nAnmerkungen: \n1.\tVermeide mehrere geschlossene Fragen hintereinander. Sie unterbrechen den Redefluss der Benutzer weil sie sich wie ein Polizeiverhör anhören. \n2.\tVergleiche mit offene Frage.\nBeispiel für geschlossene Frage:\n1.\t„Haben Sie jemals ein Auto gemietet?“ Entsprechende offene Frage: „Bitte erzählen Sie mir von dem letzten Mal wo Sie ein Auto gemietet haben.“",
    "synonyms": []
  },
  "Gestaltungsregel": {
    "description": "Konkrete, spezifische Instruktion oder Empfehlung, die wenig Interpretationsspielraum lässt, so dass verschiedene Designer sie ähnlich umsetzen.\nAnmerkungen:\n1. \tSammlungen von Gestaltungsregeln werden als Styleguides bezeichnet.\n2. \tDesign Patterns müssen relevante Gestaltungsregeln erfüllen.\n3. \tVergleiche Gestaltungsregel mit\na.\tDialogprinzip – ein generelles Ziel für das Dialogdesign. Evtl. schwierig anzuwenden auf Grund der Allgemeingültigkeit.\nb.\tHeuristik – Eine Daumenregel die bei der Erreichung von Dialogprinzipien hilft. Diese ist spezifischer und einfacher anzuwenden als ein Dialogprinzip.\nBeispiele für Gestaltungsregeln:\n1.\tFür alle Steuerelemente, wie z.B. Buttons, wähle den zuverlässigsten, sichersten Wert als Voreinstellung um den Datenverlust bzw. den risikablen Systemzugriff zu verhindern. Wenn Sicherheit und Schutz der Daten keine relevanten Faktoren sind, wähle den häufigsten oder bequemsten Wert.\n2. \tDas Firmenlogo muss in der oberen, linken Ecke jeder Seite erscheinen. Die Position muss exakt die gleiche sein wie die auf der Homepage. Klicken auf das Logo muss die Anzeige der Homepage zur Folge haben.\n3. \tDie Höhe eines Buttons muss 23 Pixel betragen",
    "synonyms": []
  },
  "Heuristik": {
    "description": "Eine allgemein anerkannte Daumenregel die hilft Usability zu erreichen.\nAnmerkungen:\nHeuristiken dienen hauptsächlich dazu, Usability zu gewährleisten (und nicht Nützlichkeit). \nVergleiche Heuristik mit\na.  Dialogprinzip – ein allgemeines Ziel für das Design von Dialogen. Ist möglicherweise schwieriger anzuwenden auf Grund seiner Allgemeingültigkeit. \nb.  Gestaltungsregel – einfache, aber  spezifische Regel für Gestaltung von Benutzungs­schnittstellen.\nBeispiele allgemein anerkannter Heuristiken (von Jakob Nielsen und Rolf Molich):\n1.\tBeachte Konventionen der realen Welt, z.B. sprich die Sprache der Benutzer\n2.\tBeachte Konventionen der verwendeten Plattform\n3.\tMinimiere die Notwendigkeit zur Erinnerung beim Benutzers in dem Objekte, Handlungen und Optionen sichtbar gemacht werden.\n4.\tBiete angemessenes Feedback innerhalb angemessener Zeit\n5.\tHilf Benutzern beim Erkennen, Verstehen und Beseitigen von Fehlern.\n",
    "synonyms": []
  },
  "Heuristische Evaluierung": {
    "description": "Eine Methode der Usability-Evaluierung bei der ein oder mehrere Begutachter – vorzugsweise Experten – ein interaktives System mit einer Liste von Heuristiken vergleichen und feststellen an welchen Stellen das interaktive System diesen Heuristiken nicht folgt.\nAnmerkungen:\n1.\tDie Liste der Heuristiken muss handhabbar sein. Üblicherweise werden etwa 10 Heuristiken benutzt.\n2.\tExperten können Usability-Experten oder Experten im Anwendungsbereich sein.",
    "synonyms": []
  },
  "High-fidelity-Prototyp": {
    "description": "Ein Software Prototyp der Benutzungsschnittstelle des zu designenden interaktiven Systems. Ein high-fidelity-Prototyp ähnelt dem fertigen interaktiven System und kann interaktiv oder nicht interaktiv sein.\nAnmerkungen:\n1.\tVergleiche mit low-fidelity-Prototyp.\n2.\tHigh-fidelity-Prototypen können entweder mit einem Programm zum Prototyping oder mit einem Büroprogramm (wie z.B. PowerPoint) entworfen werden. ",
    "synonyms": []
  },
  "ISO 9241": {
    "description": "Eine Reihe von Standards, die die menschzentrierte Gestaltung interaktiver Systeme betrifft.  \nAnmerkung:\n1.\tISO 9241 beinhaltet Standards zu den Themen\na.\tSoftware-Ergonomie\nb.\tProzess menschzentrierter Gestaltung\nc.\tDisplays und Display bezogene Hardware\nd.\tPhysikalisches Eingabegeräte\ne.\tErgonomie des Arbeitsplatzes\nf.\tErgonomie der Umgebung\ng.\tKontrollzentren\nh.\tTaktile und haptische Interaktionen",
    "synonyms": []
  },
  "Indirekter Benutzer": {
    "description": "Personen, die direkt die Ergebnisse eines interaktiven Systems nutzen, aber nicht direkt mit dem System interagieren. \nBeispiel für indirekter Benutzer:\n1.\tEin Bankkunde, der ein Dokument oder einen elektronischen Bericht erhält, oder eine Filiale besucht, ist ein indirekter Benutzer eines Arbeitsergebnisses, das mit Hilfe eines Systems erzeugt wurde, das die Mitarbeiter der Bank benutzen.",
    "synonyms": []
  },
  "Individualisier­barkeit": {
    "description": "Die Eigenschaft eines Dialogs die Benutzer ermöglicht die Interaktion mit dem System und die Darstellung von Informationen an ihre individuellen Fähigkeiten und Bedürfnisse anpassen zu können.\nAnmerkung:\n1.\tIndividualisierbarkeit ist ein Dialogprinzip.",
    "synonyms": []
  },
  "Informations­architekt": {
    "description": "Eine Person die die Struktur von Information in interaktiven Systemen für das effiziente Auffinden durch jede Benutzergruppe kreiert und organisiert.\nAnmerkung:\n1.\tInformationsarchitekt ist eine Rolle im Prozess der menschzentrierten Gestaltung.",
    "synonyms": []
  },
  "Informations­architektur": {
    "description": "Die Benennung und Strukturierung der Informationen die für den Benutzer erreichbar sein müssen einschließlich der Nutzungsobjekte, Systemobjekte (wie z.B. „Drucker“) und weiterer für den Benutzer erforderlichen Informationen. ",
    "synonyms": []
  },
  "Inspektion": {
    "description": "Siehe inspektionsbasierte Usability-Evaluierung",
    "synonyms": []
  },
  "Inspektions­basierte Usability-Evaluierung": {
    "description": "Usability-Evaluierung die auf der Beurteilung ein oder mehrerer Evaluatoren basiert, die ein interaktives System prüfen oder benutzen, um potentielle Usability-Probleme und Abweichungen von anerkannten Kriterien zu identifizieren.\nAnmerkungen:\n1.\tInspektionsbasierte Usability-Evaluierung wird oft von Usability-Experten oder Fachexperten durchgeführt, die ihre Urteile auf die frühere Erfahrung mit Usability-Problemen und ihr eigenes Wissen über Gestaltungsregeln und Styleguides gründen.\n2.\tHeuristische Evaluierung ist eine Vorgehensweise für Inspektionsbasierte Usability-Evaluierung.",
    "synonyms": []
  },
  "Interaktions­designer": {
    "description": "Eine Person die die Interaktion zwischen Mensch und System auf Basis der Nutzungs­anforderungen und Nutzungskontext definiert und konzipiert. \nAnmerkung:\n1.\tSzenarien und Personas sind auch wichtige Grundlagen für die Arbeit des Interaktionsdesigners.\n2.\tInteraktionsdesigner ist eine Rolle im Prozess der menschzentrierten Gestaltung.",
    "synonyms": []
  },
  "Interaktives System": {
    "description": "Kombination von Hardware-, Software- und Servicekomponenten, die Eingaben von einem Benutzer empfängt und Ausgaben zu einem Benutzer übermittelt.\nAnmerkung:\n1.\tDas schließt, wo relevant, Verpackung, Branding, Benutzerdokumentation, Onlinehilfe, Support und Training mit ein.  ",
    "synonyms": []
  },
  "Interessen­vertreter": {
    "description": "Individuum oder Organisation, die ein Anrecht, einen Anteil, einen Anspruch oder ein Interesse auf ein interaktives System oder an dessen Merkmalen hat, die ihren Erfordernissen und Erwartungen entsprechen. \nAnmerkungen: \n1.\tAlle Benutzer sind Interessenvertreter.\n2.\tSiehe auch unterschiedliche Typen von Anforderungen\n3.\tDie folgenden Beispiele für Interessenvertreter zeigen die breite Perspektive dieses Begriffs\n4.\tDer englische Ausdruck für Interessenvertreter ist Stakeholder\nBeispiele für Interessenvertreter: \n1.\tBenutzer, Support, Trainer, Autoren von Dokumentationen, Entwickler, Manager von Entwicklern und Personen im Marketing.",
    "synonyms": []
  },
  "Interessen­vertreter­anforderung": {
    "description": "Was das interaktive System aus Sicht des Interessenvertreters leisten muss.\nAnmerkung:\n1.\tDer englische Ausdruck für Interessenvertreteranforderung ist Stakeholder requirement.",
    "synonyms": []
  },
  "Interview": {
    "description": "Eine Methode der Datensammlung, die sorgfältig ausgewählte Individuen untersucht, um ein tiefes Verständnis der Arbeitstätigkeit der Benutzer zu erreichen. Durch die Befragung und Interpretation werden Gemeinsamkeiten und Unterschiede innerhalb der Benutzer  eines interaktiven Systems aufgedeckt.  \nAnmerkungen: \n1.\tIn einem Interview führt der Interviewer (der User Requirements Engineer) üblicherweise ein Briefing durch und stellt danach dem Benutzer Fragen über die üblichen Abläufe vor dem Hintergrund des geplanten interaktiven Systems. Der Interviewer nutzt eine Interviewcheckliste, um sicherzustellen, dass zu allen relevanten Aspekten befragt wurde.\n2.\tDas Meister-Schüler-Modell sollte beim Interview Anwendung finden.\n3.\tInterviewfragen sollten \na.\teher offen als geschlossen\nb.\teher neutral als suggestiv\nformuliert sein.\n4.\tVergleiche kontextuelles Interview, Pre-Session Interview und Post-Session Interview",
    "synonyms": []
  },
  "Interview–checkliste": {
    "description": "Eine schriftliche Liste passender Fragen und Hinweise, die während eines Interviews verwendet wird, um sicherzustellen, dass alle relevanten Themen berücksichtigt werden.",
    "synonyms": []
  },
  "Intuitiv": {
    "description": "Die Benutzung des interaktiven Systems ist unmittelbar zu verstehen – unabhängig von der Erfahrung, vom Wissen, von den Sprachkenntnissen oder vom momentanen Konzentrationsgrad des Benutzers.\nAnmerkung:\n1.\tAffordance und Selbstbeschreibungsfähigkeit sind Mittel, ein interaktives System intuitiv zu gestalten.",
    "synonyms": []
  },
  "Iterativ": {
    "description": "Wiederholend.\nEin iteratives Vorgehen wiederholt Schritte des Prozesses der menschzentrierten Gestaltung solange, bis eine Usability-Evaluierung der Benutzungsschnittstelle zeigt, dass die Nutzungsanforderungen ausreichend erfüllt sind.",
    "synonyms": []
  },
  "Konsistenz": {
    "description": "Die gleiche Information wird in gleicher Weise innerhalb des gesamten interaktiven Systems entsprechend der Benutzererwartung dargestellt.\nAnmerkungen:\n1.\tKonsistenz ist eine Komponente der Erwartungskonformität. \n2.\tKonsistenz ist auf verschiedenen Ebenen relevant wie zum Beispiel \na.\tinnerhalb einer Bildschirmanzeige,\nb.\tzwischen den Bildschirmanzeigen desselben interaktiven Systems, \nc.\tzwischen interaktiven Systemen desselben Herstellers,\nd.\tzwischen ähnlichen interaktiven Systemen unterschiedlicher Hersteller.",
    "synonyms": []
  },
  "Kontextuelles Interview": {
    "description": "Ein Interview das dort stattfindet wo die Interaktion des Benutzers mit dem interaktiven System üblicherweise stattfindet, z.B. am Arbeitsplatz des Benutzers.\nAnmerkungen: \n1.\t„Kontextuelles Interview“ wird auf Englisch oft als „Contextual inquiry“ bezeichnet.",
    "synonyms": []
  },
  "Lern­förderlichkeit": {
    "description": "Die Eigenschaft eines Dialogs die Benutzer beim Erlernen der Nutzung des interaktiven Systems zu unterstützen und anzuleiten.\nAnmerkungen:\n1.\tEmpfehlungen zur Befolgung des Dialogprinzips:\na.\tDer Dialog sollte ausreichende Rückmeldung über Zwischen- und Endergebnisse von Handlungen bereitstellen, damit die Benutzer von erfolgreich ausgeführten Handlungen lernen.\nb.\tFalls es zu den Aufgaben und den Lernzielen passt, sollte das interaktive System dem Benutzer erlauben, Dialogschritte ohne nachteilige Auswirkungen auszuprobieren.\n2.\tLernförderlichkeit ist ein Dialogprinzip.\nBeispiel für Lernförderlichkeit:\n1.\tWenn Benutzer mit Hilfe eines Hotelzimmerreservierungssystems ein Zimmer reservieren, erhalten die Benutzer Schritt für Schritt Rückmeldungen, um ihre Anfrage zu verfeinern und immer mehr Details über den Fortschritt der erfolgreichen Zimmerreservierung.",
    "synonyms": []
  },
  "Low-fidelity-Prototyp": {
    "description": "Eine einfache und preiswerte Veranschaulichung eines Designs oder eines Begriffs. Wird benutzt, um Benutzer-Feedback in frühen Phasen der Entwicklung einzuholen\nAnmerkungen: \n1.\tEin low-fidelity-Prototyp wird häufig mit Hilfe von Papier, Stiften, Haftzetteln usw. erstellt. \n2.\tEin low-fidelity-Prototyp wird üblicherweise von einem Menschen und nicht durch einen Computer betrieben.\n3.\tEin low-fidelity-Prototyp sollte so hinterlegt sein, dass er unmittelbar modifiziert werden kann.\n4.\tVergleiche mit high-fidelity-Prototyp.",
    "synonyms": []
  },
  "Markt­anforderung": {
    "description": "Eine Anforderung an ein interaktives System, die aus der Absatzpolitik des Anbieters abgeleitet ist und darauf abzielt, Geschäftschancen, Verkäufe und die Nutzung des interaktiven Systems zu maximieren.\nAnmerkungen:\n1.\tHäufig werden Marktanforderungen Kundenanforderungen genannt.\nBeispiel für Marktanforderung: \n1.\t„Die Webseite muss mindestens so benutzbar sein wie jene der zwei stärksten Wettbewerber.“",
    "synonyms": []
  },
  "Meister-Schüler-Modell": {
    "description": "Ein Verhaltensprinzip für ein erfolgreiches Interview:  Der Interviewer behandelt den Benutzer als den Meister während der Interviewer selbst der Schüler ist. Der Interviewer demonstriert nicht sein Wissen, sondern stellt seine Fragen mit dem Ziel etwas zu lernen.",
    "synonyms": []
  },
  "Mensch­zentrierte Gestaltung": {
    "description": "Herangehensweise bei der Gestaltung und Entwicklung von interaktiven Systemen, die darauf abzielt, diese gebrauchtauglicher zu machen indem sie sich auf die Verwendung des interaktiven Systems konzentriert und Kenntnisse und Techniken aus den Bereichen der Arbeitswissenschaft, Ergonomie und der Gebrauchstauglichkeit anwendet.\nAnmerkungen:\n1.\tDer Begriff “menschzentrierte Gestaltung” wird statt “benutzerzentrierter Gestaltung” verwendet, um auch die Erfordernisse weiterer Interessenvertreter einzuschliessen, die nicht unbedingt Benutzer sind.\n2.\tFeedback von Benutzern aus Usability Evaluierungen ist eine wichtige Informationsquelle in der menschzentrierten Gestaltung.",
    "synonyms": []
  },
  "Mentales Modell": {
    "description": "Die Vorstellung, die Menschen von sich, anderen, der Umgebung und den Dingen haben, mit denen sie interagieren. \nAnmerkungen: \n1.\tAlternative, populäre Definition: Der Denkprozess einer Person darüber, wie etwas in der realen Welt funktioniert.\n2.\tMenschen generieren mentale Modelle aufgrund von Erfahrung, Training und Instruktion. Das mentale Modell bezüglich eines interaktiven Systems wird größtenteils durch die Interpretation von wahrgenommenen Aktionen und sichtbaren Strukturen gebildet. Die Erwartung durch die Benutzung anderer oder ähnlicher Systeme spielt auch eine Rolle.\n3.\tWenn ein mentales Modell eines Benutzers von einem interaktiven System unvollständig oder widersprüchlich ist, dann kann der Benutzer das interaktive System nicht hindernisfrei benutzen.",
    "synonyms": []
  },
  "Moderation": {
    "description": "Die durch einen Moderator während eines Usability-Tests oder einer Fokusgruppe ausgeübte Tätigkeit.",
    "synonyms": []
  },
  "Moderator": {
    "description": "Eine neutrale Person die eine Usability-Testsitzung oder eine Fokusgruppe leitet.\nAnmerkungen: \n1.\tModerator ist eine Rolle in einer Usability-Testsitzung oder in einer Fokusgruppensitzung.\n2.\tDie typischen Aufgaben des Moderators während einer Usability-Testsitzung sind beim Begriff Usability-Testsitzung beschrieben.\n3.\tAuf Englisch wird Facilitator oft als Synonym für Moderator verwendet.",
    "synonyms": []
  },
  "Nach­besprechung": {
    "description": "Siehe Post-Session Interview.",
    "synonyms": []
  },
  "Navigations­struktur": {
    "description": "Die logische Organisation der angezeigten Informationseinheiten der Benutzungsschnittstelle.\nAnmerkungen:\n1.\tIn der Praxis sind die „angezeigten Informationseinheiten“ oft Bildschirminhalte, Seiten oder Fenster.\n2.\tDie Navigationsstruktur umfasst: \na.\tDie logische Struktur, zum Beispiel Hierarchie, Anordnung sowie Gruppierung von Bestandteilen des User Interfaces bzw. Navigationsitems.\nb.\tDie Navigationsmittel zum Navigieren in der Struktur, zum Beispiel Menü und Brotkrumen\n3.\tDie Navigationsstruktur ist ein Teil der Informationsarchitektur. Verantwortlich ist der Informationsarchitekt – er kann das aber nicht ohne den Interaktionsdesigner festlegen.",
    "synonyms": []
  },
  "Neutrale Frage": {
    "description": "Eine Frage in einem Interview, die keine impliziten Annahmen beinhaltet und auch keinen Ansatz bietet, einen Aspekt auszuschliessen oder die Antwort in eine bestimmte Richtung zu lenken. \nAnmerkung:\n1.\tVergleiche mit Suggestivfrage.\nBeispiele für neutrale (und offene) Interviewfragen\n1.\tWas ist passiert?\n2.\tWas meinen Sie damit?\n3.\tWelche Möglichkeiten haben Sie jetzt?\n4.\tWie sollte die Homepage der neuen Autovermietungswebsite aussehen?",
    "synonyms": []
  },
  "Nutzungsobjekt": {
    "description": "Die wichtigsten Informationseinheiten oder Daten mit denen Benutzer interagieren, um ihre Aufgaben durchzuführen.\nAnmerkung:\n1.\tDer englische Ausdruck für Nutzungsobjekt ist Task object.\nBeispiele für Nutzungsobjekte:\n1.\tFür ein Kundenmanagementsystem: \n\t- Ein Brief an einen Kunden, \n\t- Eine Liste unbezahlter Rechnungen des Kunden, \n\t- Eine Auftrag von dem Kunden.\n2.\tFür einen Automaten der Bahnkarten verkauft:\n\t- Eine Fahrkarte,\n\t- Eine Quittung für den Kauf einer Fahrkarte,\n\t- Einen Reiseplan.",
    "synonyms": []
  },
  "Nutzungs­anforderung": {
    "description": "Anforderung an die Nutzung, die die Basis für die Gestaltung und Evaluierung eines interaktiven Systems in Hinblick auf identifizierte Erfordernisse bildet. \nAnmerkungen:\n1.\tNutzungsanforderungen werden von Erfordernissen abgeleitet.\n2.\tEine Nutzungsanforderung kann eine qualitative Nutzungsanforderung oder eine quantitative Nutzungsanforderung sein.\n3.\t„Nutzungsanforderung“ heisst auf Englisch „User requirement“.",
    "synonyms": []
  },
  "Nutzungs­kontext": {
    "description": "Benutzer, Aufgaben, Ressourcen sowie die physische und soziale Umgebung in der das interaktive System genutzt wird.\nAnmerkungen:\n1.\tDie Ergebnisse aus den Beobachtungen und kontextuellen Interviews werden in der ”Nutzungskontextbeschreibung” dokumentiert. Diese ist die Basis für das Identifizieren von Erfordernissen bzw. deren Zurückführbarkeit auf den Nutzungskontext.   \n2. Eine Nutzungskontextbeschreibung beschreibt:\na.\tBenutzergruppen und Benutzergruppenprofile,\nb.\tAufgaben,\nc.\tUmgebungen,\nd.\tAusrüstung,\ne.\tSzenarien, die illustrieren, was im Nutzungskontext geschieht\nAnmerkung zum Training:\n1.\tHilfreiche Abkürzung: PACT = \nPeople (Benutzer), \nActivities (Aufgaben), \nContexts (Umgebung), \nTechnologies (Ressourcen, Ausrüstung der Benutzer)\nBeispiele:\n1.\tJugendliche verwenden Handys, um ihren Freunden Textmitteilungen zu senden während sie in einem Bus sitzen. \n2.\tSekretärinnen benutzen Microsoft Word, um Dokumente in einer Rechtskanzlei zu schreiben.",
    "synonyms": []
  },
  "Nutzungs­problem": {
    "description": "Siehe Usability-Problem",
    "synonyms": []
  },
  "Nutzungs–szenario": {
    "description": "Siehe Szenario",
    "synonyms": []
  },
  "Offene Frage": {
    "description": "Eine Frage in einem Interview, die keine Einschränkung der Antwortmöglichkeiten nach sich zieht\nAnmerkungen: \n1.\tOffene Fragen sind in Interviews zu bevorzugen, weil sie Benutzer zur freien Rede animieren und ausführliche  Antworten auf die Frage zulassen. \n2.\tVergleiche mit geschlossener Frage.\nBeispiele:\n1.\tFür Beispiele zu offenen (und neutralen) Interviewfragen siehe Neutrale Fragen.",
    "synonyms": []
  },
  "Onlinehilfe": {
    "description": "Unterstützung die durch ein Computerprogramm bereitgestellt wird. Onlinehilfe kann themenorientiert, verfahrensorientiert oder ein Hinweis sein.\nAnmerkungen:\n1.\tOnlinehilfe kann auch Informationen zu weitergehenden Themenbereichen bieten.\n2.\tOnlinehilfe ist eine Form der Benutzerunterstützung.",
    "synonyms": []
  },
  "Organisato­rische Anforderung": {
    "description": "Eine organisatorische Regel die Benutzer befolgen müssen während sie ihre Aufgaben lösen.\nAnmerkung:\n1.\tOrganisatorische Anforderungen sind Anforderungen an die Benutzer die zu Anforderungen an das interaktive System führen.\nBeispiele: \n1.\tEin Verkäufer muss Angebote über 100.000 Euro vom Geschäftsführer unterschreiben lassen.\n2.\tEine exakte Beschreibung der Art und Weise wie ein Benutzer eine Bestellung ausführen muss.",
    "synonyms": []
  },
  "Persona": {
    "description": "Eine Beschreibung eines Benutzers und was dieser bei der Benutzung eines interaktiven Systems beabsichtigt. \nAnmerkung:\n1.\tPersonas sind nicht Beschreibungen existierender Personen, sondern repräsentieren erfundene Beispiele eines realen Benutzers auf der Basis empirisch ermittelter Daten, zum Beispiel von Beobachtungen oder Interviews.\n2.\tPersonas verfügen typischerweise über einen Namen, Alter, einige Hintergrund­informationen, Ziele und Wünsche. Eine Persona-Beschreibung sollte Informationen über wesentliches Wissen im Themenfeld des interaktiven Systems und die entsprechenden Interessen der Persona im Themenfeld beinhalten. Persona-Beschreibungen enthalten oft, aber nicht immer ein Foto.",
    "synonyms": []
  },
  "Positiver Usability-Befund": {
    "description": "Siehe Usability-Befund",
    "synonyms": []
  },
  "Post-Session Interview": {
    "description": "Eine Aktivität in einem Usability-Test, bei der ein Usability-Testteilnehmer Fragen bezüglich seines allgemeinen Eindrucks hinsichtlich der Usability des interaktiven Systems beantwortet. \nAnmerkungen:\n1.\tDas Post-Session Interview findet statt, nachdem der Usability-Testteilnehmer soviele der vorgesehenen Usability-Testaufgaben wie möglich in der vorgegebenen Zeit erledigt hat. \n2.\tWird auch als Debriefing oder Nachbesprechung bezeichnet.",
    "synonyms": []
  },
  "Pre-Session Interview": {
    "description": "Eine Tätigkeit bei einem Usability-Test, bei der Usability-Testteilnehmer Fragen bezüglich ihres Hintergrundes und vorheriger Erfahrung mit dem interaktiven System oder ähnlichen interaktiven Systemen beantworten. \nAnmerkung:\n1.\tDas Pre-Session Interview findet nach dem Briefing statt, bevor der Usability-Testteilnehmer beginnt, die Usability-Testaufgaben abzuarbeiten.",
    "synonyms": []
  },
  "Primärer Benutzer": {
    "description": "Eine Person, die mit einem interaktiven System interagiert, um Ziele zu erreichen, die durch das System unterstützt werden.",
    "synonyms": []
  },
  "Protokollant": {
    "description": "Ein Usabilityspezialist, der Notizen über Usability-Befunde während einer Usability-Testsitzung, Fokusgruppe oder Interview notiert. \nAnmerkungen:\n1.\tProtokollant ist eine Rolle in einer Usability-Testsitzung, Fokusgruppe oder Interview\n2.\tDer Einsatz eines Protokollanten erlaubt dem Moderator, sich voll auf den Usability-Testteilnehmer zu konzentrieren.",
    "synonyms": []
  },
  "Prototyp": {
    "description": "Eine Repräsentation von Teilen oder des gesamten interaktiven Systems, die in einem bestimmten Maß für Analyse, Design und Evaluierung benutzt werden kann.\nAnmerkung:\n1.\tZertifizierungsanwärter müssen auch mit den Begriffen high-fidelity-Prototyp und low-fidelity-Prototyp vertraut sein.",
    "synonyms": []
  },
  "Qualitative Nutzungs­anforderung": {
    "description": "Eine Beschreibung, was Benutzer während der Durchführung einer Aufgabe mit dem interaktiven System finden, erkennen, verstehen, auswählen oder eingeben müssen.\nAnmerkungen:\n1.\tQualitative Nutzungsanforderungen sind die Basis für den effizienten Gebrauch von interaktiven Systemen.\n\tIm Gegensatz dazu können Quantitative Nutzungsanforderungen Messungen der Effizienz des interaktiven Systems ermöglichen  – d.h. ob ein Benutzer mit Hilfe des interaktiven Systems eine Aufgabe z.B. in einer angemessenen Zeit oder mit einem definierten Maximum an Bedienungsfehlern lösen kann.\n2.\tQualitative Nutzungsanforderungen sind keine Funktionen, sondern stellen die Basis für Funktionen dar.\n3.\tVergleiche mit Quantitativer Nutzungsanforderung \nBeispiele\n1.\tSinnvolle qualitative Nutzungsanforderungen:\na.\t„Der Benutzer muss die unterschiedlichen Fahrzeuge, die für einen bestimmten Preisbereich auf der Autovermietungs­webseite verfügbar sind, vergleichen können.“ \nb.\t„Der Benutzer muss ein Fahrzeug mit automatischer Übertragung auf der Autovermietungswebseite auswählen können.“\nc.\t„Der Benutzer muss die Öffnungszeiten einer bestimmten Autovermietungsstelle sehen können.“\n2.\tFalsch formulierte qualitative Nutzungsanforderungen:\na.\t„Die Benutzungsschnittstelle muss gebrauchstauglich sein und alle Benutzeraufgaben unterstützen.“ (zu allgemein)\nb.\t„Die Benutzungsschnittstelle muss einen großen roten Button „Auto mieten“ haben“ (zu detailliert)",
    "synonyms": []
  },
  "Qualität": {
    "description": "Grad der Erfüllung von Anforderungen durch ein interaktives System.\nAnmerkung: \n1.\tBeispiele für Qualitätsmerkmale neben Usability sind Korrektheit, Verlässlichkeit und Sicherheit.",
    "synonyms": []
  },
  "Quantitative Nutzungs­anforderung": {
    "description": "Benötigtes Maß an Usability um identifizierten Erfordernissen zu genügen im Sinne der Effektivität, Effizienz und Zufriedenstellung in einem festgelegten Nutzungskontext.\nAnmerkungen:\n1.\tQuantitative Nutzungsanforderungen sind Akzeptanzkriterien für die Effektivität, Effizienz und Zufriedenstellung eines interaktiven Systems, z.B. ob Benutzer eine bestimmte Aufgabe in einer angemessenen Zeit oder mit einem festgeschriebenen Maximum an Benutzungsfehlern mit dem System erledigen können.\n2.\tVergleiche mit Qualitativer Nutzungsanforderung. Vergleiche insbesondere die Beispiele.\nBeispiel: \n1.\t„80% der Benutzer, die die Autovermietungs­webseite zumindest zweimal benutzt haben, müssen in der Lage sein, innerhalb von 5 Minuten einen Kleinwagen ab Flughafen Frankfurt (Deutschland) für zwei Tage beginnend ab morgen 09:00 Uhr zu mieten“.\n2.\tVergleiche das obige Beispiel mit Beispielen  „qualitativer Nutzungsanforderung“.",
    "synonyms": []
  },
  "Rekrutierung": {
    "description": "Akquise von Benutzern, die die erforderlichen Qualifikationen haben, an einer menschzentrierten Aktivität wie z.B. einem Usability-Test, einem kontextuellen Interview oder einer Fokusgruppe teilzunehmen.\nAnmerkung: \n1.\tOft wird ein Rekrutierungsfragebogen eingesetzt, um festzustellen ob Kandidaten über die erforderlichen Qualifikationen zur Teilnahme an der menschzentrierten Aktivität verfügen.\n2.\tRelevante Qualifikationen beinhalten: Hintergrund, Wissen über das Sachgebiet, Einstellungen und Interessen.",
    "synonyms": []
  },
  "Rekrutierungs­fragebogen": {
    "description": "Eine Reihe von Fragen für potenzielle Teilnehmer hinsichtlich ihrer Qualifikationen zur Teilnahme an einer menschzentrierten Aktivität wie z.B. einem Usability-Test oder einer Fokusgruppe.\nAnmerkungen: \n1.\tEin Rekrutierungsfragebogen wird während der Rekrutierung von Teilnehmern benutzt, um festzustellen ob Kandidaten über die erforderlichen Qualifikationen zur Teilnahme an der menschzentrierten Aktivität verfügen.\n2.\tRelevante Qualifikationen beinhalten: Hintergrund, Wissen über das Sachgebiet, Einstellungen und Interessen.\n3.\tDer englische Ausdruck für Rekrutierungs­fragebogen ist Screener oder Recruitment Screener.",
    "synonyms": []
  },
  "Remote Usability-Test": {
    "description": "Ein Usability-Test bei dem sich der Usability-Testteilnehmer und der Moderator an unterschiedlichen Orten befinden \n(„Remote“ bedeutet hier „entfernt liegend“). \nAnmerkungen:\n1.\tDer Moderator beobachtet den Usability-Testteilnehmer über eine Internetverbindung. \n2.\tDer Moderator kommuniziert mit dem Usability-Testteilnehmer über Telefon oder Internet.\n3.\tVergleiche mit Usability-Test und unbeaufsichtigter Usability-Test.",
    "synonyms": []
  },
  "Ressourcen": {
    "description": "Alle Mittel die zur Nutzung eines interaktiven Systems notwendig sind. \nAnmerkung: \n1.\ttypische Beispiele von Ressourcen sind Zeit, finanzielle Kosten, physischer und mentaler Aufwand, Hardware, Software und Materialien",
    "synonyms": []
  },
  "Richtlinie": {
    "description": "Siehe Gestaltungsregel",
    "synonyms": []
  },
  "Rolle": {
    "description": "Eine Funktion die eine Person innerhalb der Struktur einer Organisation inne hat.\nAnmerkungen:\n1.\tEine Rolle beschreibt eine Menge von zusammengehörigen Verhaltensweisen, Rechten, Pflichten und Normen in einem beruflichen Kontext.\n2.\tRollen werden von Individuen besetzt.\n3.\tAbhängig von der Komplexität eines Projektes können mehrere Menschen eine Rolle teilen oder mehrere Rollen einer Person zugewiesen werden.\n4.\tArbeitsrollen sind „Hüte“, die Menschen aufhaben, wenn sie die entsprechenden Verantwortlichkeiten übernehmen und die damit verbundenen Tätigkeiten ausüben.\nBeispiel:\n1.\tIn einer Usability-Testsitzung kann eine Person gleichzeitig die Rolle des Moderators und die des Protokollanten übernehmen. \n\tIn einer anderen Usability-Testsitzung hingegen, könnte eine Person als Moderator fungieren und zwei andere Personen könnten beide als Protokollant auftreten.",
    "synonyms": []
  },
  "Sekundärer Benutzer": {
    "description": "Eine Person, die mit einem interaktiven System interagiert, um die Nutzung des Systems zu unterstützen oder das System zu warten.\nBeispiele für sekundäre Benutzer:\n1.\tSicherheitsmanager, Administrator, Trainer und Wartung.",
    "synonyms": []
  },
  "Selbst­beschreibungs­fähigkeit": {
    "description": "Die Eigenschaft eines Dialogs zu jeder Zeit dem Benutzer offensichtlich zu machen, in welchem Dialog, an welcher Stelle im Dialog er sich befindet, welche Handlungen unternommen werden können und wie diese ausgeführt werden können.\nAnmerkung:\n1.\tAffordance und Selbstbeschreibungsfähigkeit sind Mittel, um ein interaktives System intuitive zu gestalten.\n2.\tSelbstbeschreibungsfähigkeit ist ein Dialogprinzip. ",
    "synonyms": []
  },
  "Steuerbarkeit": {
    "description": "Der Benutzer ist in der Lage einen Dialogablauf zu starten sowie seine Richtung und Geschwindigkeit zu beeinflussen, bis das Ziel erreicht ist.\nAnmerkung:\n1.\tSteuerbarkeit ist ein Dialogprinzip.",
    "synonyms": []
  },
  "Storyboard": {
    "description": "Eine Folge visueller Bildschirminhalte, die das Zusammenspiel zwischen einem Benutzer und einem vorgestellten interaktiven System darstellt. \nAnmerkung:\n1.\tEin Storyboard ist oft eine Comic-­artige Darstellung eines Nutzungsszenarios.\n2.\tStoryboards sind nicht als Prototypen geeignet, da sie eine Geschichte erzählen und keine Interaktion ermöglichen ",
    "synonyms": []
  },
  "Styleguide": {
    "description": "Eine Sammlung von Gestaltungsregeln die verwendet wird, um die grundsätzliche Erscheinung der Benutzungsschnittstelle auf jeglicher Software einer Organisation festzulegen.\nAnmerkung:\n1.\tStyleguides werden manchmal auch als UX Guides bezeichnet.\nBeispiele für Styleguides:\n1.\tWindows User Experience Interaction Guidelines for Windows Desktop apps („UX Guide“)\n2.\tIOS Human Interface Guidelines",
    "synonyms": []
  },
  "Suggestiv­frage": {
    "description": "Eine Frage in einem Interview, die eine Präferenz für bestimmte Antwortmöglichkeiten vorgibt oder versucht, die Antwort in eine bestimmte Richtung zu lenken. \nAnmerkung:\n1.\tVergleiche mit neutraler Frage.\nBeispiel für Suggestivfrage:\n1.\t„Möchten Sie schöne Farben auf der Homepage der neuen Autovermietungswebsite?“\nEntsprechende neutrale Frage: „Wie sollte die Homepage der neuen Autovermietungswebsite aussehen?“ Beachten Sie, dass die neutrale Frage den Begriff „Farbe“ nicht einmal enthält.",
    "synonyms": []
  },
  "Summative Usability-Evaluierung": {
    "description": "Eine Usabilityevaluierung, die darauf ausgerichtet ist, Schlussfolgerungen zur Qualität eines interaktiven Systems aus Sicht der Usability zu ziehen, insbesondere wenn ein wesentlicher Teil der Entwicklung fertig ist.  \nAnmerkung: \n1.\tEine summative Evaluierung kann dazu genutzt werden, ein Design gegen Nutzungsanforderungen zu evaluieren, um festzustellen, ob das Design aus der Perspektive der Benutzer akzeptabel ist.\n2.\tVergleiche mit Formativer Usability-Evaluierung.",
    "synonyms": []
  },
  "Systeminitiierte Benutzerführung": {
    "description": "Explizite Information über ein Ereignis oder einen Zustand vom interaktiven System an den Benutzer. \nAnmerkungen: \nSysteminitiierte Benutzerführung umfasst:\nMeldungen (informativ, warnend, auf Fehler hinweisend)\nStatusinformation, z.B. ”7 neue Nachrichten”\nInstruktionen, z.B. ”E-Mail-Adressen können mit einem Leerzeichen, einem Komma, einem Semikolon oder einem Zeilenumbruch getrennt werden.”\n2.\tMeldungen, müssen konstruktiv, präzise, verständlich und sichtbar sein.\n3.\tSysteminitiierte Benutzerführung ist eine Form der Benutzerunterstützung.",
    "synonyms": []
  },
  "Szenario": {
    "description": "Eine narrative Textbeschreibung des Vorgehens, das ein bestimmter Benutzer anwendet, um eine oder mehrere Aufgaben zu erledigen. \nAnmerkungen: \n1.\tDer Benutzer im Szenario kann durch eine Persona repräsentiert werden.\n2.\tEs gibt zwei Typen von Szenarien: \na.\tSzenarien des Ist-Zustands, die beschreiben, wie Aufgaben bisher erledigt werden. Szenarien des Ist-Zustands beschreiben den gegenwärtigen Nutzungskontext und dienen dazu, Erfordernisse zu erkennen und Nutzungsanforderungen abzuleiten. Siehe Beispiel 1.\nb.\tNutzungsszenarien beschreiben, wie Aufgaben mit dem zukünftigen interaktiven System erledigt werden. Nutzungsszenarien dienen als Basis für das Entwickeln erster Low-Fidelity-Prototypen. Siehe Beispiel 2.\n3. \tSzenarien werden vom User Requirements Engineer auf Grundlage der Ergebnisse von Beobachtungen und Kontextinterviews erstellt\n4. \tPersonas und Szenarien werden zusammen entwickelt, da das Analysieren von Benutzern auch eine Analyse ihres Verhaltens involviert und die Analyse ihres Handelns beinhaltet, wer diese Handlungen durchführt.\n5. \tSzenarien werden von Benutzern überprüft, um Missverständnisse zu entdecken, die während der Contextual Inquiry aufgetreten sein könnten.\n6.\tEin Szenario soll nicht auf spezifische Umsetzungen von  Objekten der Benutzungsschnittstelle referenzieren (z.B. auf einen Button).\n7.\tSzenarien werden benutzt um Aufgabenmodelle und frühe Prototypen zu erstellen, die die Aufgabe im Szenario unterstützen.\nBeispiele für Szenarien:\n„John Miller ist Geschäftsreisender der im Laufe einer Woche mehrere Flüge tätigt. Er fährt bevorzugt mit seinem Auto zum Flughafen. Gelegentlich verpasst er ein Flugzeug und bereut dann nicht mit einem Taxi oder mit der Bahn zum Flughafen gefahren zu sein. Er unterschätzt einfach die Fahrzeugschlangen vor an der Einfahrt des Parkhauses und die Laufzeit bis zum Flugsteig.“ Dieses Beispiel bezieht sich auf Anmerkung 2a, den Ist-Zustand.\n„Bevor John Miller zum Flughafen fährt, sichtet er mit seiner neuen App immer die Parksituation am Flughafen. Wenn ausreichend Parkplätze vorhanden sind, reserviert er mit seiner neuen App einen Parkplatz und fährt dann entspannt mit seinem Wagen zum Flughafen. Er weiss, dass mit der Veröffentlichung der neuen App am Flughafen ein separater Zugang für Parkhausgäste mit reserviertem Parkplatz geschaffen wurde.“ Dieses Beispiel bezieht sich auf Anmerkung 2b, den zukünftigen Soll-Zustand.\n3.\tDer folgende Text, der das Beispiel 2 ergänzt, ist zu spezifisch und verstösst gegen Anmerkung 6: \n„John Miller schaut sich den Bildschirm „Überblick über verfügbare Parkplätze“ an und wählt einen Parkplätz mit der Schaltfläche „Auswählen“ aus. Anschliessend klickt er auf die Schaltfläche „Reservieren“ und reserviert diesen Parkplatz.“",
    "synonyms": []
  },
  "Szenario des Ist-Zustands": {
    "description": "Siehe Szenario",
    "synonyms": []
  },
  "Testaufgabe": {
    "description": "Siehe Usability-Testaufgabe.",
    "synonyms": []
  },
  "Testbericht": {
    "description": "Siehe Usability-Testbericht.",
    "synonyms": []
  },
  "Testskript": {
    "description": "Siehe Usability-Testskript.",
    "synonyms": []
  },
  "Testteilnehmer": {
    "description": "Siehe Usability-Testteilnehmer",
    "synonyms": []
  },
  "Umgebung": {
    "description": "Die Gesamtheit der gegebenen Umstände oder Bedingungen, in denen ein Benutzer arbeitet. Diese umfassen die physische, soziale und technische Umgebung.\nAnmerkung: \n1.\tDie soziale Umgebung schließt die organisatorische Umgebung mit ein.",
    "synonyms": []
  },
  "Un­beaufsichtigter Usability-Test": {
    "description": "Ein Usability-Test bei dem Usability-Testteilnehmer Usability-Testaufgaben lösen ohne dabei beobachtet zu werden. \nAnmerkung: \n1.\tHandlungen werden auf Video zur späteren Analyse aufgezeichnet.\n2.\tUnbeaufsichtigte Usability-Tests werden oft beim Testteilnehmer zuhause, auf dessen Computer durchgeführt. Videoaufnahmen werden mithilfe einer Aufzeichnungssoftware gespeichert die von einem Anbieter für unbeaufsichtigte Usability-Tests auf dem Computer installiert wird.\n3.\tVergleiche mit Usability-Test und Remote Usability-Test",
    "synonyms": []
  },
  "Usability": {
    "description": "Ausmaß, in dem ein interaktives System durch bestimmte Benutzer in einem bestimmten Nutzungskontext genutzt werden kann, um festgelegte Ziele effektiv, effizient und zufriedenstellend zu erreichen.\nAnmerkung:\n1.\tDie Ausdrücke „bestimmte Benutzer“, „festgelegte Ziele“ und „bestimmter Nutzungskontext“ sind in dieser Definition besonders wichtig.",
    "synonyms": []
  },
  "Usability Engineer": {
    "description": "Eine Person die in einer Querschnittsfunktion verantwortlich einen menschzentrierten Gestaltungsprozess betreut. \nAnmerkungen:\n1.\tDer Usability Engineer (UE) ist kompetent und erfahren in den Prozessschritten, verfügbaren Methoden der menschzentrierten Gestaltung und Gestaltungsregeln für Benutzererlebnis, sodass er die Entwicklungsprojekte unter dem Aspekt menschzentrierter Gestaltung planen und die Qualität der Ausführung von menschzentrierten Gestaltungsbezogenen Aktivitäten sicherstellen kann. Dies beinhaltet \na.\tMenschzentrierte Gestaltungsaktivitäten,\nb.\tDie Integration der menschzentrierten Gestaltung in den Produktentwicklungs­prozess des Unternehmens, \nc.\tDie Definition von Erfolgskriterien für solche Projekte,\nd.\tDas Training von beteiligten Projektteams. \n2.\tDer UE legt angemessene Vorgehensweisen, Werkzeuge und Styleguides für das menschzentrierte Design im Allgemeinen als auch für spezifische Projekte fest. Der UE unterstützt das Management bei der Entscheidung, welche Arbeitspakete von qualifizierten Mitarbeitern im Unternehmen und welche durch kompetente Subunternehmer ausgeführt werden sollten.\n3.\tUsability Engineer ist eine Rolle im Prozess der menschzentrierten Gestaltung.\n",
    "synonyms": []
  },
  "Usability Professional": {
    "description": "Eine Person die eine oder mehrere der folgenden Rollen hat: \n1.\tUsability Engineer, \n2.\tUser Requirements Engineer, \n3.\tUsability-Tester,\n4.\tInformationsarchitect,\n5.\tInteraktionsdesigner,\n6.\tUser Interface Designer.",
    "synonyms": []
  },
  "Usability-Befund": {
    "description": "Ergebnis aus einer Usability-Evaluierung. \nAnmerkung:\n1.\tMögliche Usability-Befunde sind\na.\tEin Usability-Problem \nb.\tEtwas, das die Benutzer mochten, also ein positiver Usability-Befund.",
    "synonyms": []
  },
  "Usability-Evaluierung": {
    "description": "Ein Prozess der Informationen über die Usability eines interaktiven Systems sammelt um das interaktive System zu verbessern (formative Usability-Evaluierung) oder um das interaktive System zu bewerten (summative Usability-Evaluierung). \nAnmerkungen:\n1.\tUsability-Evaluierung ist ein gemeinsamer Ausdruck für \na.\tInspektionsbasierte Usability-Evaluierung \nb.\tBenutzerzentrierte Usability-Evaluierung.\n2.\tDas Synonym „Evaluation“ wird auch oft verwendet.",
    "synonyms": []
  },
  "Usability-Labor": {
    "description": "Zwei oder mehrere Räume, die speziell für die Durchführung von Usabiltytests oder Fokusgruppen ausgestattet sind. \nAnmerkung:\n1.\tEin Usability-Labor besteht oft aus \na.\teinem Testraum, wo der Usability-Testteilnehmer sitzt,\nb.\teinem Beobachtungsraum, wo Interessenvertreter die Usability-Testteilnehmer beobachten können, während die Usability-Testteilnehmer Aufgaben lösen. \n\tOft sind diese zwei Räume durch eine Spiegelwand getrennt, was den Beobachtern erlaubt, den Usability-Testteilnehmern zuzuschauen, nicht aber umgekehrt.",
    "synonyms": []
  },
  "Usability-Problem": {
    "description": "Ein Problem in der Benutzung der Benutzungsschnittstelle, das sich auf die Zufriedenstellung des Benutzers sowie die Effektivität und Effizienz des interaktiven Systems auswirkt. \nAnmerkung:\n1.\tUsability-Probleme können zu Irritationen, Fehlern oder Verzögerungen führen oder sogar die Fertigstellung einer Aufgabe des Benutzers verhindern.",
    "synonyms": []
  },
  "Usability-Test": {
    "description": "Eine Usability-Evaluierung bei der repräsentative Benutzer bestimmte Aufgaben mit dem interaktiven System ausführen, um Usability-Probleme oder die Messwerte für Effektivität, Effizienz und Zufriedenstellung zu erfassen. \nAnmerkungen:\n1.\tEin Usability-Test wird von einem Usability-Tester geleitet.\n2.\tEin Usability-Test besteht üblicherweise aus 3 Phasen:\na.\tPlanung, dazu gehören: Schreiben des Usabiliy-Testplans, schreiben des Usability-Testskripts, und Rekrutierung von passenden Usability-Testteilnehmern.\nb.\tDurchführung der Usability-Testsitzungen wie in Anmerkung 3 beschrieben.\nc.\tUsability-Testergebnisse kommunizieren, einschließlich Schreiben eines Usability-Testberichts \n3.\tEin Usability-Test umfasst eine Reihe von Usability-Testsitzungen. In jeder Sitzung versucht ein Usability-Testteilnehmer unter Benutzung des interaktiven Systems oder eines Prototypen eines interaktiven Systems repräsentative Usability-Testaufgaben zu lösen. Üblicherweise werden Usability-Testsitzungen von einem Moderator moderiert und von einer Anzahl von Beobachtern, die oft Interessenvertreter sind, beobachtet. Ein Protokollant zeichnet wichtige Usability-Befunde auf.\n4.\tDer Begriff ”Usability-Test” bezieht sich üblicherweise auf einen Test, bei dem sich der Usability-Testteilnehmer und der Moderator am gleichen physischen Ort befinden. Andere Arten von Usability-Tests sind: Remote Usability-Test und Unbeaufsichtigter Usability-Test.\n5.\tDas Testen kann qualitative oder quantitative Daten ergeben. \n6.\tDas Testen kann zu jedem Zeitpunkt während der menschzentrierten Gestaltung geschehen – von der frühen Analysephase bis hin zur Lieferung des interaktiven Systems und darüberhinaus. Die Tests können sowohl an Papierentwürfen oder anderen low-fidelity-Prototypen als auch an in Entwicklung befindlichen oder bereits fertiggestellten interaktiven Systemen durchgeführt werden.\n7.\tRollen bei einem Usability-Test sind:\na.\tModerator\nb.\tProtokollant\nc.\tBeobachter\nd.\tUsability-Testteilnehmer ",
    "synonyms": []
  },
  "Usability-Testaufgabe": {
    "description": "Eine Beschreibung einer typischen Aufgabe, die ein Moderator einem Usability-Testteilnehmer während eines Usability-Tests stellt. ",
    "synonyms": []
  },
  "Usability-Testbericht": {
    "description": "Ein Dokument, das die Ergebnisse eines Usability-Tests beschreibt. \nAnmerkungen:\n1.\tEin Usability-Testbericht beinhaltet üblicherweise \na.\tEine Kurzdarstellung, \nb.\t5-50 Usability-Befunde (auch positive),\nc.\tDas Usability-Testskript für den Usability-Test. \nd.\tOft umfasst der Usability-Testbericht auch Screenshots oder Bilder die die Beschreibungen von wichtigen Usability-Befunden ergänzen.\n2.\tWird auch nur als Testbericht bezeichnet.",
    "synonyms": []
  },
  "Usability-Tester": {
    "description": "Eine Person die Benutzungsschnittstellen in verschiedenen Stadien der Realisierung evaluiert. \nAnmerkungen:\n1.\tIn Kooperation mit anderen Interessensvertretern, muss der Usability-Tester\na.\tdie Usability-Evaluierungen planen\nb.\tdie Usability-Evaluierungen leiten\nc.\tdie Usability-Testergebnisse an die Interessenvertreter kommunizieren.\n2.\tWährend einer Usability-Testsitzung übernimmt der Usability-Tester die Rolle des Moderators oder des Protokollanten.\n3.\tUsability-Tester ist eine Rolle im Prozess der menschzentrierten Gestaltung.",
    "synonyms": []
  },
  "Usability-Testplan": {
    "description": "Eine kurze Beschreibung des Zwecks und Umfangs eines Usability-Tests. \nAnmerkungen:\n1.\tDer Usability-Testplan ist für das Management vorgesehen, um entscheiden zu können, ob der Usability-Test durchgeführt werden sollte oder nicht. Der Plan ist absichtlich kurz gehalten und fokussiert auf die für den Usability-Test benötigten Ressourcen.\n2.\tDer Usability-Testplan beinhaltet \na.\tDie Anzahl geplanter Usability-Testteilnehmer, \nb.\tDie ungefähre Länge jeder Usability-Testsitzung, \nc.\tDen Namen des Moderators, \nd.\tEinen Zeitplan, \ne.\tEine Kostenschätzung für den Usability-Test einschließlich Personenstunden.\n3.\tWeitere Details über den Usability-Test wie z.B. Usability-Testaufgaben, Testmethode und erforderliche Soft- und Hardware werden im Usability-Testskript bereitgestellt.",
    "synonyms": []
  },
  "Usability-Testsitzung": {
    "description": "Der Teil eines Usability-Tests, bei dem ein bestimmter Usability-Testteilnehmer repräsentative Usability-Testaufgaben unter Benutzung des interaktiven Systems oder des Prototypen eines interaktiven Systems löst.\nAnmerkungen:\n1.\tTypische Aufgaben des Moderators während einer Usability-Testsitzung sind:\na.\tBegrüßung des Usability-Testteilnehmers;\nb.\tDurchführung des Briefings und des Pre-Session Interviews;\nc.\tÜbergabe von Usability-Testaufgaben an den Usability-Testteilnehmer.\nd.\tBeobachtung des jeweiligen Usability-Testteilnehmers während der Erledigung der Aufgaben;\ne.\tDurchführung des Post-Session Interviews.\n2.\tVergleiche mit Usability-Test.",
    "synonyms": []
  },
  "Usability-Testskript": {
    "description": "Eine von einem Moderator in einem Usability-Test verwendete Checkliste, um den Überblick über die Fragen des Briefings und des Pre-Session Interviews, die Usability-Testaufgaben und die Fragen des Post-Session Interviews zu behalten.",
    "synonyms": []
  },
  "Usability-Testteilnehmer": {
    "description": "Repräsentativer Benutzer, der typische Aufgaben in einem Usability-Test löst.",
    "synonyms": []
  },
  "Usability-Test­ergebnis": {
    "description": "Siehe Usability-Befund.",
    "synonyms": []
  },
  "User Interface Designer": {
    "description": "Eine Person die den Dialog und das Benutzererlebnis basierend auf dem Design des  Interaktions­designers und den Nutzungsszenarios des User Requirements Engineers implementiert. Der User Interface Designer erzeugt ausserdem interaktive Prototypen.\nAnmerkung:\n1.\tUser Interface Designer ist eine Rolle im Prozess der menschzentrierten Gestaltung.",
    "synonyms": []
  },
  "User Requirements Engineer": {
    "description": "Eine Person die den tatsächlichen oder geplanten Nutzungskontext von Benutzern identifiziert und beschreibt. Daraus leitet der User Requirements Engineer die Nutzungsanforderungen und damit verbundene organisatorische Anforderungen ab, die für ein bestimmtes Projekt umgesetzt werden müssen. \nAnmerkungen:\n1.\tDer User Requirements Engineer identifiziert den Nutzungskontext durch Methoden wie Benutzerinterviews, Beobachtungen, Benutzerbefragungen, Usability-Evaluierungen, Expertenanalysen usw.\n2.\tDer User Requirements Engineer erzeugt Nutzungs­szenarien, die die Effektivität, Effizienz und Zufriedenstellung bei der Aufgabenerledigung mit dem interaktiven System sicherstellen sollen.\n3.\tUser Requirements Engineer ist eine Rolle im Prozess der menschzentrierten Gestaltung.",
    "synonyms": []
  },
  "Wireframe": {
    "description": "Eine Form des Low-fidelity-Prototyps bestehend aus schematischen Diagrammen, typischerweise dargestellt mit Linien, rechteckigen Kästen und Text der das Interaktionsdesign und den Navigationsfluss repräsentiert.\nAnmerkungen:\n1.\tWireframes adressieren üblicherweise nicht das visuelle Design und das genaue Layout.\n2.\tEin Wireframe ist ein Mockup (Modell, Attrappe) eines Bildschirms. Eine adäquate Sammlung von Wireframes formt einen Low-fidelity-Prototyp.\n3.\tAuf Deutsch auch „Drahtgeflecht“ genannt.",
    "synonyms": []
  },
  "Ziel": {
    "description": "Angestrebtes Arbeitsergebnis.",
    "synonyms": []
  },
  "Zufrieden­stellung": {
    "description": "Freiheit von Beeinträchtigung und positive Grundeinstellung zur Nutzung des Produkts\nAnmerkungen:\n1.\tDer neue Vorschlag der ISO Definition könnte etwas einfacher zu verstehen sein: Einstellungen bezogen auf die Verwendung des interakiven Systems und die emotionalen und physischen Folgen der tatsächlichen Verwendung.\n2.\tZufriedenstellung ist eines der drei Meßbaren Attribute von Usability. Die anderen beiden sind Effektivität und Effizienz.\n3. \tZufriedenstellung kann mit Fragebögen gemessen werden.",
    "synonyms": []
  }
}