{
  "Anforderung": {
    "description": "Bedingung oder Fähigkeit, die ein interaktives System, eine Komponente  eines interaktiven Systems oder eine Dienstleistung erfüllen oder besitzen  muss, um einer Vereinbarung, einem Standard, einer Spezifikation oder anderen  formal zugrunde gelegten Dokumenten zu genügen.  ",
    "categories": [
      "Planung",
      "Gestaltung",
      "Anforderungen"
    ],
    "synonyms": [
      ""
    ]
  },
  "Arbeitsmittel": {
    "description": "Hardware, Software und Materialien.",
    "categories": [
      "Anforderungen",
      "Planung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Aufgabe": {
    "description": "Aktivitäten die erforderlich sind, um ein Ziel zu erreichen.    ",
    "categories": [
      "Anforderungen",
      "Prinzipien",
      "Gestaltung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Aufgabenangemessenheit": {
    "description": "Ein Dialogprinzip.    Ein interaktives System ist aufgabenangemessen, wenn es den Benutzer  unterstützt, seine Aufgabe zu erledigen, d. h., wenn Funktionalität und Dialog  auf den charakteristischen Eigenschaften der Aufgabe basieren, anstatt auf der  zur Aufgabenerledigung eingesetzten Technologie.    Empfehlungen zu Befolgung des Dialogprinzips:  - Der Dialog sollte dem Benutzer solche Informationen anzeigen, die im  Zusammenhang mit der erfolgreichen Erledigung der Aufgabe stehen..  - Der Dialog sollte dem Benutzer keine Informationen anzeigen, die nicht für die  erfolgreiche Erledigung relevanter Aufgaben benötigt werden..  - Die Form der Eingabe und Ausgabe sollte der Aufgabe angepasst sein. Wenn  für eine Aufgabe ganz bestimmte Eingabewerte typisch sind, sollten diese  Werte dem Benutzer automatisch als voreingestellte Werte verfügbar sein.  - Die vom interaktiven System verlangten Dialogschritte sollten zum  Arbeitsablauf passen, d. h., notwendige Dialogschritte sollten enthalten sein und  unnötige Dialogschritte sollten vermieden werden.",
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Aufgabenmodell": {
    "description": "Eine Beschreibung der Aktivitäten innerhalb einer Aufgabe die erledigt werden  müssen, um die vom Benutzer beabsichtigen Ziele zu erreichen.  ",
    "categories": [
      "Implementierung"
    ],
    "synonyms": [
      "Task model"
    ]
  },
  "Barrierefreiheit": {
    "description": "Die Attribute und Charakteristiken eines interaktiven Systems die Menschen  mit eingeschränkter Sicht, eingeschränktem Hören, eingeschränkter  Geschicklichkeit, eingeschränkter Kognition oder eingeschränkter physikalischer  Mobilität erlauben effektiv und effizient mit dem interaktiven System zu  interagieren.",
    "categories": [
      "Prinzipien"
    ],
    "synonyms": [
      "Accessibility"
    ]
  },
  "Befund": {
    "description": "Ergebnis aus einem Usabilitytest. Ein Befund kann ein Nutzungsproblem oder  etwas sein, das die Benutzer mochten, also ein positiver Befund.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "Testergebnis",
      "Usability finding",
      "Usability-Befund"
    ]
  },
  "Benutzer": {
    "description": "Person, die mit einem interaktiven System arbeitet.",
    "categories": [
      "Rollen",
      "Anforderungen"
    ],
    "synonyms": [
      "User"
    ]
  },
  "Benutzerdokumentation": {
    "description": "Eine Form der Benutzerunterstützung.    Für Benutzer geschriebene Anleitungen darüber, wie das interaktive System  durch Benutzer eingesetzt werden kann.",
    "categories": [
      "Planung",
      "Gestaltung",
      "System"
    ],
    "synonyms": [
      "User documentation"
    ]
  },
  "Benutzererlebnis": {
    "description": "Wahrnehmungen und Reaktionen einer Person, die aus der tatsächlichen  und/oder erwarteten Benutzung eines interaktiven Systems oder Dienstes  resultieren.  ",
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "synonyms": [
      "User experience"
    ]
  },
  "Benutzerfragebogen": {
    "description": "Ein Satz von Fragen, der eine strukturierte Art und Weise der Befragung einer  großen Gruppe von Menschen ermöglicht, um diese Menschen, ihre Interessen  und ihre Präferenzen zu beschreiben.  Benutzerfragebögen können im Rahmen einer Benutzerbefragung benutzt  werden, um die Zufriedenstellung von Benutzern eines interaktiven Systems  und Informationen zum Nutzungskontext zu ermitteln.",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Benutzergruppe": {
    "description": "Eine Gruppe von Benutzern mit demselben oder ähnlichen Nutzungskontext  bezogen auf das interaktive System.",
    "categories": [
      "Rollen",
      "Planung",
      "Gestaltung",
      "Evaluierung"
    ],
    "synonyms": [
      "User group"
    ]
  },
  "Benutzergruppenprofil": {
    "description": "Eine verallgemeinerte Beschreibung einer Benutzergruppe.",
    "categories": [
      "Rollen",
      "Evaluierung"
    ],
    "synonyms": [
      "User group profile"
    ]
  },
  "Benutzerunterstützung": {
    "description": "Ein gemeinsamer Ausdruck für Benutzerdokumentation, Onlinehilfe und  Fehlermanagement.",
    "categories": [
      "Planung",
      "Gestaltung",
      "System"
    ],
    "synonyms": [
      "User assistance"
    ]
  },
  "Benutzerzentrierte Evaluierung": {
    "description": "Evaluierung, die repräsentative Benutzer involviert, die bestimmte Aufgaben mit  dem interaktiven System ausführen, um die Identifikation von  Nutzungsproblemen und/oder die Messung von Effizienz, Effektivität  und/oder Zufriedenstellung zu ermöglichen.  Siehe Usabilitytest.",
    "categories": [
      "Planung",
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "Menschzentrierte Evaluierung",
      "User-centred"
    ]
  },
  "Benutzerzentrierte Gestaltung": {
    "description": "Siehe Menschzentrierte Gestaltung.",
    "categories": [
      "Gestaltung"
    ],
    "synonyms": [
      "User-centred design",
      "Menschzentrierte Gestaltung"
    ]
  },
  "Benutzungsschnittstelle": {
    "description": "Alle Bestandteile eines interaktiven Systems, die Informationen und  Steuerelemente zur Verfügung stellen, die für den Benutzer notwendig sind, um  eine bestimmte Aufgabe mit dem interaktiven System zu erledigen.",
    "categories": [
      "System",
      "Gestaltung",
      "Implementierung"
    ],
    "synonyms": [
      "User interface"
    ]
  },
  "Benutzungsschnittstellenstandard": {
    "description": "Eine Sammlung von Richtlinien für die Gestaltung von  Benutzungsschnittstellen.",
    "categories": [
      "System",
      "Implementierung",
      "Prinzipien"
    ],
    "synonyms": [
      ""
    ]
  },
  "Beobachter": {
    "description": "Eine Rolle in einem Usabilitytest. Beobachter sind Interessenvertreter, die  schauen, was während eines Usabilitytests geschieht. Durch das Beobachten  einer Usabilitytestsitzung erlangen die Beobachter Eindrücke von den  Nutzungsproblemen und Erfolgen der Testteilnehmer aus erster Hand.",
    "categories": [
      "Rollen",
      "System"
    ],
    "synonyms": [
      "Observer"
    ]
  },
  "Beobachtung": {
    "description": "Eine Technik für das Sammeln von Kontextinformationen bezüglich  Erfordernissen. Während einer Beobachtung sieht der User Requirements  Engineer dem Benutzer bei der Ausführung von Aufgaben am interaktiven  System zu. Der User Requirements Engineer greift nicht ein, außer es  besteht gelegentlich die Notwendigkeit zu einer klärenden Frage.",
    "categories": [
      "Prinzipien",
      "Anforderungen"
    ],
    "synonyms": [
      "Observation"
    ]
  },
  "Designmuster": {
    "description": "Eine wiederverwendbare Lösung für ein Designproblem innerhalb eines  Kontexts. Ein Designmuster beschreibt ein Designproblem, eine Lösung und wo  sich diese Lösung als funktionierend herausgestellt hat.",
    "categories": [
      "Gestaltung",
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "Design pattern",
      "Entwurfsmuster"
    ]
  },
  "Dialog": {
    "description": "Interaktion zwischen einem Benutzer und einem interaktiven System in Form  einer Folge von Handlungen des Benutzers (Eingaben) und Antworten des  interaktiven Systems (Ausgaben), um ein Ziel zu erreichen.",
    "categories": [
      "Gestaltung",
      "System",
      "Prinzipien"
    ],
    "synonyms": [
      "Dialogue"
    ]
  },
  "Dialogprinzip": {
    "description": "Allgemeines Ziel für die Gestaltung von Dialogen.  Dialogprinzipien sind aus der Erfahrung abgeleitete, abstrakte Richtlinien für das  Dialogdesign auf oberster Ebene. Aufgrund ihrer Allgemeingültigkeit kann es  schwierig sein, sie im konkreten Kontext umzusetzen.  Die DIN EN ISO 9241-110 führt folgende sieben Dialogprinzipien auf:  - Aufgabenangemessenheit;  - Selbstbeschreibungsfähigkeit;  - Erwartungskonformität;  - Lernförderlichkeit;  - Steuerbarkeit;  - Fehlertoleranz;  - Individualisierbarkeit.  ",
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "synonyms": [
      "Dialogue principles"
    ]
  },
  "Dringlichkeitsstufen (von Befunden)": {
    "description": "Ein Maß für ein Nutzungsproblem aus einem Usabilitytest das die  Auswirkung des Nutzungsproblems auf das Benutzererlebnis bewertet.    Der Usabilitytester bewertet die Nutzungsprobleme aus Sicht der  Testteilnehmer. Typische Dringlichkeitsstufen sind: niedrig, ernst, kritisch,  lebensbedrohend.",
    "categories": [
      "Test"
    ],
    "synonyms": [
      "Severity rating"
    ]
  },
  "Effektivität": {
    "description": "Genauigkeit und Vollständigkeit mit der Benutzer ein bestimmtes Ziel erreichen.  ",
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "synonyms": [
      "Effectiveness"
    ]
  },
  "Effizienz": {
    "description": "Im Verhältnis zur Genauigkeit und Vollständigkeit eingesetzte Ressourcen, mit  dem Benutzer ein bestimmtes Ziel erreichen.  ",
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "synonyms": [
      "Efficiency"
    ]
  },
  "Erfordernis": {
    "description": "Eine für einen Benutzer oder eine Benutzergruppe als notwendig identifizierte  Voraussetzung, um ein Ziel innerhalb eines bestimmten Nutzungskontextes zu  erreichen.  Beispiele:  - Ein Vortragender (Benutzer) muss wissen, wieviel Zeit er noch hat  (Voraussetzung), um den Vortrag während einer Präsentation mit einer  festgelegten Zeitbeschränkung (Nutzungskontext) abschliessen zu können  (Ziel).  - Ein Finanzbuchhalter (Benutzer) muss die Anzahl der erhaltenen Rechnungen  und ihre Beträge kennen (Voraussetzung) um die tägliche Rechnungsstellung  (Ziel) als Teil der Cashflow-Kontrolle (Nutzungskontext) fertigstellen zu  können.  ",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "User need"
    ]
  },
  "Erwartungskonformität": {
    "description": "Ein Dialogprinzip.    Ein Dialog ist erwartungskonform, d.h. im Einklang mit den  Benutzererwartungen, wenn er den aus dem Nutzungskontext heraus  vorhersehbaren Benutzerbelangen sowie allgemein anerkannten Konventionen  entspricht.  Konsistenz ist ein Aspekt der Erwartungskonformität.  ",
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "synonyms": [
      "Konsistenz",
      "Conformity with user expectations"
    ]
  },
  "Evaluierung": {
    "description": "Ein Prozess der Informationen über die Gebrauchstauglichkeit eines  interaktiven Systems sammelt um das interaktive System zu verbessern  (formative Evaluierung) oder um eine fertiggestellte Benutzungsschnittstelle zu  bewerten (summative Evaluierung).  Evaluierung ist ein gemeinsamer Ausdruck für inspektionsbasierte und  benutzerzentrierte Evaluierung.",
    "categories": [
      "Test",
      "Evaluierung",
      "Prinzipien"
    ],
    "synonyms": [
      "Inspektion",
      "Usability Evaluierung",
      "Evaluation",
      "User-Evaluation"
    ]
  },
  "Expertenreview": {
    "description": "Eine Inspektion die von Usabilityexperten oft in Kombination mit Fachexperten  durchgeführt wird.  ",
    "categories": [
      "Test",
      "Evaluierung",
      "Prinzipien"
    ],
    "synonyms": [
      "Usability proffesionals review"
    ]
  },
  "Face-to-face Usabilitytest": {
    "description": "Siehe Usabilitytest ­ Face-to-face",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Fehlermanagement": {
    "description": "Ein Teil der Benutzerunterstützung.    Merkmale der Benutzungsschnittstelle die Benutzern helfen, Fehler zu  erkennen und den Einfluß von Fehlern zu minimieren.  ",
    "categories": [
      "Gestaltung",
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Fehlertoleranz": {
    "description": "Ein Dialogprinzip.  Ein Dialog ist fehlertolerant, wenn das beabsichtigte Arbeitsergebnis trotz  erkennbar fehlerhafter Eingaben entweder mit keinem oder mit minimalem  Korrekturaufwand seitens des Benutzers erreicht werden kann.  - Wenn ein Fehler auftritt, sollte das interaktive System eine konstruktive,  genaue und verständliche Erklärung anbieten.  - Wenn aus einer Benutzeraktion schwerwiegende Folgen entstehen können,  dann sollte das interaktive System eine Erklärung anbieten und eine  Bestätigung vor der Durchführung der Aktion geben.",
    "categories": [
      "Anforderungen",
      "Evaluierung"
    ],
    "synonyms": [
      "Error tolerance"
    ]
  },
  "Fokusgruppe": {
    "description": "Eine gezielte Diskussion, bei der ein Moderator eine Gruppe von Teilnehmern  durch eine Menge von Fragen zu einem bestimmten Thema führt.  ",
    "categories": [
      "Anforderungen",
      "Gestaltung",
      "Rollen"
    ],
    "synonyms": [
      "Focus group"
    ]
  },
  "Formative Evaluierung": {
    "description": "Eine Art der Usabilityevaluierung die hilft, das Design für ein interaktives  System oder eine Dienstleistung zu formen. Formative Evaluierungen beziehen  die Evaluierung eines interaktiven Systems oder einer Dienstleistung oft  iterativ während der Entwicklung mit dem Ziel mit ein, Nutzungsprobleme  frühzeitig zu erkennen und zu eliminieren.  ",
    "categories": [
      "Evaluierung",
      "Test",
      "Prinzipien"
    ],
    "synonyms": [
      "Usability Evaluierung",
      "formative usability evaluation"
    ]
  },
  "Fragebogen": {
    "description": "Ein Satz von Testfragen zum Benutzererlebnis. Ein Fragebogen ist das  tragende Instrument zur Messung der Zufriedenstellung eines Benutzers mit  einem interaktiven System bei allen Arten der Evaluierung einer  Benutzungsschnittstelle.  ",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "Questionnaire"
    ]
  },
  "Gebrauchstauglichkeit": {
    "description": "Siehe Usability",
    "categories": [
      "Test",
      "Anforderungen",
      "Prinzipien"
    ],
    "synonyms": [
      "Usability"
    ]
  },
  "Geschlossene Frage": {
    "description": "Eine Interviewfrage die eine Antwort aus einem vordefinierten Satz von  Alternativen fordert, oft einfach ,,ja\" oder ,,nein\".  ",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "Closed question"
    ]
  },
  "Geschäftsanforderung": {
    "description": "Siehe Organisatorische Anforderung.",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "Organizational requirement"
    ]
  },
  "Gestaltungsregel": {
    "description": "Konkrete, spezifische Instruktionen, denen ein Designer mit minimalem  Interpretationsaufwand folgen kann.  Gestaltungsregel ist ein allgemeiner Ausdruck für die Inhalte folgender  Dokumententypen:  - Gestaltungsrichtlinie / Benutzungsschnittstellenrichtlinie  - Styleguide  - Standard / Benutzungsschnittstellenstandard  - Designmuster  ",
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "synonyms": [
      "Richtlinie",
      "User interface guideline",
      "Styleguide"
    ]
  },
  "Handlungsleitung": {
    "description": "Aspekte eines Objektes, die klar machen, wie das Objekt benutzt werden kann.    Beispiele:  - Ein Henkel einer Teetasse stellt eine offensichtliche Handlungsleitung dar, sie  zu halten.  - Ein Button auf einer Webseite bietet die Handlungsleitung, auf ihn zu klicken.  - Ein Firmenemblem in der oberen linken Ecke einer Webseite bietet  eingeschränkte Handlungsleitung, darauf zu klicken.",
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "synonyms": [
      "Affordance",
      "Selbsbeschreibungsfähigkeit",
      "Self-discriptiveness"
    ]
  },
  "Heuristik": {
    "description": "Ein allgemein anerkanntes Dialogprinzip zur Evaluierung einer  Benutzungsschnittstelle, das benutzt werden kann, um Designprobleme zu  erkennen oder zu verhindern.  ",
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "synonyms": [
      "Heuristic",
      "Inprektion"
    ]
  },
  "Heuristische Evaluierung": {
    "description": "Eine Methode der Usabilityevaluierung bei der ein oder mehrere Reviewer ­  vorzugsweise Experten ­ ein interaktives System mit einer Liste von  Dialogprinzipien (auch als Heuristiken bezeichnet) vergleichen und feststellen  wo das interaktive System diesen Dialogprinzipien nicht folgt.  ",
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "synonyms": [
      "Heuristic evaluation",
      "Heuristische Inspektion"
    ]
  },
  "Heuristische Inspektion": {
    "description": "Siehe Heuristische Evaluierung.",
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "synonyms": [
      "Heurischtische Evaluierung",
      "heuristic evaluation"
    ]
  },
  "High-fidelity Prototyp": {
    "description": "Ein Prototyp, der mit Softwarepaketen wie z.B. Visual Basic oder PowerPoint  erstellt wurde,. Ein high-fidelity Prototyp ähnelt dem fertigen interaktiven  System.  ",
    "categories": [
      "Test",
      "System"
    ],
    "synonyms": [
      "Prototyp"
    ]
  },
  "ISO9241": {
    "description": "Eine Familie von Standards bestehend aus zwei Hauptgruppen. Gruppe 1  besteht aus Standards unter dem allgemeinen Titel \"Ergonomische  Anforderungen für die Büroarbeit mit Monitoren.\" Gruppe 2 besteht aus  Standards unter dem allgemeinen Titel \"Ergonomie der Mensch-Maschine  Interaktion\".",
    "categories": [
      "Anforderungen",
      "Prinzipien"
    ],
    "synonyms": [
      ""
    ]
  },
  "Indiviualisierbarkeit": {
    "description": "Ein Dialogprinzip.    Ein Dialog ist individualisierbar wenn Benutzer die Mensch-System-Interaktion  und Darstellung von Informationen an ihre individuellen Fähigkeiten und  Bedürfnisse anpassen können.  ",
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "synonyms": [
      "Suitability for individualization"
    ]
  },
  "Informationsarchitekt": {
    "description": "Eine Rolle im Prozess des menschzentrierten Designs.    Der Informationsarchitekt kreiert und organisiert die Struktur für das effiziente  Auffinden von Information in interaktiven Systemen durch den Nutzer. Er  definiert hierbei die nutzergruppengerechte Aufbereitung von Inhalten und  Navigationsstrukturen. Er ist für die konsistente und erwartungskonforme  Bezeichnung von Wegweisern (z.B. in Menüs) sowie erforderlicher  Nutzungsobjekte und Werkzeuge für den Nutzer zuständig.  ",
    "categories": [
      "Rollen",
      "Gestaltung"
    ],
    "synonyms": [
      "Usability Professional",
      "Information architect"
    ]
  },
  "Informationsarchitektur": {
    "description": "Die Klassifikation und Organisation von Information in einem interaktiven  System.  ",
    "categories": [
      "Gestaltung",
      "Anforderungen"
    ],
    "synonyms": [
      "Information architecture"
    ]
  },
  "Inspektion": {
    "description": "Siehe inspektionsbasierte Evaluierung",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "Evaluierung",
      "evaluation",
      "Inspektionsbasierte Usability Evaluierung",
      "Inspection based Usability evaluation"
    ]
  },
  "Inspektionsbasierte Evaluierung": {
    "description": "Evaluierung die auf der Beurteilung ein oder mehrerer Evaluatoren basiert, die  ein interaktives System prüfen oder benutzen, um potentielle  Nutzungsprobleme und/oder Abweichungen von anerkannten Kriterien zu  identifizieren.  Inspektionsbasierte Evaluierung wird von Usability Experten oder Fachexperten  durchgeführt, die ihre Urteile auf die frühere Erfahrung mit Nutzungsproblemen  und ihr eigenes Wissen über Richtlinien und Standards zu Usability gründen.  Inspektionsbasierte Evaluierung ist ein Überbegriff für Expertenreview und  heuristische Evaluierung.",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "Evaluierung",
      "evaluation",
      "Inspection based Usability evaluation"
    ]
  },
  "Interaktionsdesigner": {
    "description": "Eine Rolle im Prozess des menschzentrierten Designs.   Der Interaktionsdesigner konzipiert und definiert die Interaktion zwischen  Mensch und System auf Basis der Nutzungsanforderungen und Aufgaben der  Nutzer, mit dem Ziel der effizienten Aufgabenerledigung am System. Er  generiert hierzu Nutzungsszenarien, die die Effektivität, Effizienz und  Zufriedenstellung bei der Aufgabenerledigung sicherstellen. Er berücksichtigt  hierbei die Nutzungsanforderungen, identifiziert und klärt offene Fragen, die  sich aus der spezifizierten Interaktion ergeben.  ",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      "Usability Proffesional",
      "Interaction designer"
    ]
  },
  "Interaktives System": {
    "description": "Kombination von Hardware- und Softwarekomponenten, die Eingaben von  einem Benutzer empfangen und Ausgaben zu einem Benutzer übermitteln, um  ihn bei der Ausführung einer Aufgabe zu unterstützen.",
    "categories": [
      "System",
      "Anforderungen"
    ],
    "synonyms": [
      "interactive system"
    ]
  },
  "Interessenvertreter": {
    "description": "Einzelperson oder Organisation, die ein Anrecht, einen Anteil, einen Anspruch  oder ein Interesse auf ein interaktives System oder an dessen Merkmalen hat,  die ihren Erfordernissen und Erwartungen entsprechen.    ",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      "Stakeholder"
    ]
  },
  "Interessenvertreteranforderung": {
    "description": "Was das interaktive System aus Sicht des Interessenvertreters leisten muss.",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "Stakeholder requirement"
    ]
  },
  "Interview": {
    "description": "Siehe Kontextuelles Interview.",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      "Briefing",
      "Pre-Session Interview",
      "Debriefing",
      "Post-Session Interview",
      "Contextual inquiry"
    ]
  },
  "Interviewcheckliste": {
    "description": "Eine schriftliche Liste passender Fragen und Hinweise, die während eines  Interviews verwendet wird, um sicherzustellen, dass alle relevanten Themen  berücksichtigt werden.",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Intuitiv": {
    "description": "Die Benutzung des interaktiven Systems ist unmittelbar zu verstehen ­  unabhängig von der Erfahrung, des Wissens, der Sprachkenntnisse oder des  momentanen Konzentrationsgrades des Benutzers.",
    "categories": [
      "Anforderungen",
      "Planung"
    ],
    "synonyms": [
      "Selbstbeschreibungsfähig",
      "intuitive"
    ]
  },
  "Iterativ": {
    "description": "Ein interativer Prozess wiederholt die Schritte des Prozesses des  menschzentrierten Designs solange, bis eine Evaluierung der  Benutzungsschnittstelle zeigt, dass die Nutzungsanforderungen erfüllt sind.",
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "synonyms": [
      "Wiederholend",
      "iterative"
    ]
  },
  "Konsistenz": {
    "description": "Die gleiche Information wird in gleicher Weise innerhalb des gesamten  interaktiven Systems entsprechend der Benutzererwartung dargestellt.  Konsistenz ist eine Komponente der Erwartungskonformität.  ",
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "synonyms": [
      "Erwartungskonformität"
    ]
  },
  "Kontextuelles Interview": {
    "description": "Eine Technik zur Sammlung von Informationen über den Nutzungskontext und  Erfordernisse. Der Interviewer (der User Requirements Engineer) stellt dem  Benutzer Fragen über gegenwärtige Abläufe im Lichte des geplanten  interaktiven Systems. Das Interview findet dort statt wo die Interaktion des  Benutzers mit dem interaktiven System üblicherweise stattfindet, z.B. am  Arbeitsplatz des Benutzers.  Das kontextuelle Interview wird auf Englisch oft als \"Contextual inquiry\"  bezeichnet.  ",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      "Briefing",
      "Pre-Session",
      "Debriefing",
      "Post-Session",
      "Contextual inquiry"
    ]
  },
  "Lernförderlichkeit": {
    "description": "Ein Dialogprinzip.  Ein Dialog ist lernförderlich, wenn er den Benutzer beim Erlernen der Nutzung  des interaktiven Systems unterstützt und anleitet.    Empfehlungen zu Befolgung des Dialogprinzips:  - Der Dialog sollte ausreichende Rückmeldung über Zwischen- und  Endergebnisse von Handlungen bereitstellen, damit die Benutzer von  erfolgreich ausgeführten Handlungen lernen.  - Falls es zu den Aufgaben und den Lernzielen passt, sollte das interaktive  System dem Benutzer erlauben, Dialogschritte ohne nachteilige Auswirkungen  auszuprobieren.  Beispiel: Wenn Benutzer mit Hilfe eines Hotelzimmerreservierungssystems ein  Zimmer reservieren, erhalten die Benutzer Schritt für Schritt Rückmeldungen,  um ihre Anfrage zu verfeinern und immer mehr Details über den Fortschritt der  erfolgreichen Zimmerreservierung.",
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "synonyms": [
      "Suitablity for learning"
    ]
  },
  "Lowfidelity Prototyp": {
    "description": "Ein Prototyp, der sich auf die allgemeine Vorstellung und Struktur eines  interaktiven Systems konzentriert. Er besteht oft aus Papierentwürfen und  Bildschirmattrappen der Benutzungsschnittstelle eines zu entwickelnden  interaktiven Systems. Ein solcher low-fidelity Prototyp wird üblicherweise von  einem Menschen und nicht durch einen Computer betätigt. Er sollte so hinterlegt  sein, dass er unmittelbar modifiziert werden kann.  ",
    "categories": [
      "Test",
      "System"
    ],
    "synonyms": [
      "Prototyp"
    ]
  },
  "Marktanforderung": {
    "description": "Eine Anforderung an ein interaktives System, die die Kaufentscheidung  innerhalb einer anvisierten Benutzergruppe positiv beeinflusst. Soweit das  interaktive System kostenlos ist, fördert die Marktanforderung die  Entscheidung, das interaktive System zu benutzen.  Beispiel: \"Die Webseite muss mindestens so benutzbar sein wie jene der zwei  stärksten Wettbewerber.\"",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "Kundenanforderungen"
    ]
  },
  "Meister-Schüler-Modell": {
    "description": "Ein Verhaltensprinzip für ein erfolgreiches Interview: Der Interviewer behandelt  den Benutzer als den Meister während der Interviewer selbst der Schüler ist.  Der Interviewer demonstriert nicht sein Wissen, sondern stellt seine Fragen mit  dem Ziel etwas zu lernen.",
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "synonyms": [
      "Master-apprentice model"
    ]
  },
  "Menschzentrierte Gestaltung": {
    "description": "Herangehensweise bei der Gestaltung und Entwicklung von interaktiven  Systemen, die darauf abzielt, diese gebrauchtauglicher zu machen indem sie  sich auf die Verwendung des interaktiven Systems konzentriert und  Kenntnisse und Techniken aus den Bereichen der  Arbeitswissenschaft/Ergonomie und der Gebrauchstauglichkeit anwendet.",
    "categories": [
      "Planung",
      "Gestaltung"
    ],
    "synonyms": [
      "Benutzerzentrierte Gestaltung",
      "User-centred design"
    ]
  },
  "Mentales Modell": {
    "description": "Das Modell, das Menschen von sich, anderen, der Umgebung und den Dingen  haben, mit denen sie interagieren. Menschen generieren mentale Modelle  aufgrund von Erfahrung, Schulung und Anweisung. Das mentale Modell  bezüglich eines interaktiven Systems wird größtenteils durch die Interpretation  von wahrgenommenen Aktionen und sichtbaren Strukturen gebildet.  ",
    "categories": [
      "Planung"
    ],
    "synonyms": [
      "Mental model"
    ]
  },
  "Modell": {
    "description": "Im allgemeinsten Sinn ist ein Modell etwas, das irgendwie benutzt wird, um  irgendetwas anderes zu repräsentieren. Zum Beispiel ist eine Zeichnung eines  Zapfhahns ein Modell eines Zapfhahns. Eine Persona ist ein Modell eines  Benutzers.  ",
    "categories": [
      "System",
      "Gestaltung",
      "Implementierung"
    ],
    "synonyms": [
      "model"
    ]
  },
  "Moderation": {
    "description": "Die durch einen Moderator während eines Usabilitytests ausgeübte Tätigkeit.",
    "categories": [
      "Rollen",
      "Planung",
      "Test"
    ],
    "synonyms": [
      ""
    ]
  },
  "Moderator": {
    "description": "Eine Rolle in einem Usabilitytest oder in einer Fokusgruppe. Der Moderator  leitet die Usabilitytestsitzung oder die Fokusgruppe.  In einem Usabilitytest begrüßt der Moderator die Testteillehmer, führt die  Vorabinterviews durch, beobachtet die Testteilnehmer während der  Erledigung der Aufgaben und macht das Interview nach dem Test.",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      ""
    ]
  },
  "Nachbesprechung": {
    "description": "Siehe Post-Test-Interview.",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      "Debrifing",
      "Post-Session Interview"
    ]
  },
  "Navigationsstruktur": {
    "description": "Die logische Organisation der angezeigten Informationseinheiten der  Benutzungsschnittstelle.  ",
    "categories": [
      "System",
      "Planung"
    ],
    "synonyms": [
      "Navigation structure"
    ]
  },
  "Neutrale Frage": {
    "description": "Eine Frage in einem Interview, die keine impliziten Annahmen beinhaltet und  auch keinen Ansatz bietet, einen Aspekt auszuschliessen oder die Antwort in  eine bestimmte Richtung zu lenken. Vergleiche mit Suggestionsfrage.",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "offene Interviewfrage",
      "Neutral question"
    ]
  },
  "Nutzungsanforderung": {
    "description": "Was ein interaktives System aus Sicht des Benutzers ermöglichen soll.    Nutzungsanforderungen können qualitativ oder quantitativ sein.    ",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "User requirements"
    ]
  },
  "Nutzungsanforderung - Qualitativ": {
    "description": "Eine Beschreibung, was Benutzer während der Durchführung einer Aufgabe  mit dem interaktiven System erkennen, auswählen oder eingeben müssen.    ",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "Qualitative user requirement"
    ]
  },
  "Nutzungsanforderung ­ Quantitativ": {
    "description": "Geforderte Leistung, die die Basis für Design und die Evaluierung eines  interaktiven Systems darstellt, mit dem Ziel, identifizierte Erfordernisse zu  befriedigen.  ",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "Quantitative user requirement"
    ]
  },
  "Nutzungskontext": {
    "description": "Benutzer, Aufgaben, Arbeitsmittel (Hardware, Software und Materialien)  sowie die physikalische und soziale Umgebung in der das interaktive System  genutzt wird.  ",
    "categories": [
      "System",
      "Planung"
    ],
    "synonyms": [
      "Context of use"
    ]
  },
  "Nutzungsobjekt": {
    "description": "Die wichtigsten Informationseinheiten auf oberster Ebene oder Daten mit denen  Benutzer interagieren, um ihre Aufgaben durchzuführen.  Beispiele: Ein Brief, eine Liste unbezahlter Rechnungen, eine Bestellung von  einem Kunden.",
    "categories": [
      "System",
      "Planung"
    ],
    "synonyms": [
      "Task object"
    ]
  },
  "Nutzungsproblem": {
    "description": "Ein Problem in der Benutzung der Benutzungsschnittstelle, das sich auf die  Zufriedenstellung des Benutzers sowie die Effektivität und Effizienz des  interaktiven Systems auswirkt. Nutzungsprobleme können zu Irritationen,  Fehlern oder Verzögerungen führen oder sogar die Fertigstellung einer Aufgabe  des Benutzers verhindern und machen die Benutzungsschnittstelle und damit  das interaktive System weniger benutzbar für ihre Zielbenutzer.",
    "categories": [
      "Gestaltung",
      "Evaluierung"
    ],
    "synonyms": [
      "Usability-Problem",
      "Problem"
    ]
  },
  "Nutzungsszenario": {
    "description": "Eine narrative Beschreibung einer oder mehrerer Aufgaben und wie ihre  Erledigung durch das interaktive System unterstützt wird. Das  Nutzungsszenario beschreibt Schritt für Schritt das Vorgehen eines Benutzers,  um die Aufgaben mit Hilfe des voraussichtlichen, sich noch in Entwicklung  befindlichen interaktiven Systems zu erledigen.  ",
    "categories": [
      "Test",
      "Planung"
    ],
    "synonyms": [
      "User scenario",
      "Szenario"
    ]
  },
  "Offene Frage": {
    "description": "Eine Frage in einem Interview, die keine besondere Erwartungen bezüglich  Form oder Inhalt der Antwort beinhaltet.  ",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "Neutrale Interviewfrage",
      "offene Interviewfrage",
      "Neutrale Frage",
      "neutral question",
      "open question"
    ]
  },
  "Onlinehilfe": {
    "description": "Eine Form der Benutzerunterstützung.  Onlinehilfe ist durch eine Computersoftware bereitgestellte themenorientierte  oder prozedurale Information oder ein Verweis auf solche Information. Meist ist  die Onlinehilfe dazu ausgelegt, Unterstützung für die Benutzung eines  interaktiven Systems zu geben; sie kann aber auch Informationen zu  weitergehenden Themenbereichen bieten. Wenn die Onlinehilfe unmittelbar auf  die gegenwärtige Tätigkeit des Benutzers bezogen ist, dann spricht man von  kontextsensitiver Hilfe.",
    "categories": [
      "System",
      "Gestaltung"
    ],
    "synonyms": [
      "Online help"
    ]
  },
  "Organisatiorische Anforderung": {
    "description": "Anforderung an den Benutzer aus der Perspektive der Organisation.    Beispiel: Ein Verkäufer muss Angebote über 100.000 Euro vom Geschäftsführer  unterschreiben lassen.",
    "categories": [
      "Anforderungen",
      "Gestaltung",
      "Planung"
    ],
    "synonyms": [
      "Organizational requirement"
    ]
  },
  "Persona": {
    "description": "Eine beispielhafte Beschreibung eines Benutzers und was dieser bei der  Benutzung eines interaktiven Systems tun möchte. Personas sind nicht  Beschreibungen existierender Personen, sondern repräsentieren erfundene  Beispiele eines realen Benutzers auf der Basis empirisch ermittelter Daten.  Personas verfügen typischerweise über einen Namen, Alter, einige  Hintergrundinformationen, Ziele und Wünsche.  Beispiel: Vier Personas für eine Webseite, die Autos in New York vermietet, sind  - George - datengetriebener, zeitbewußter Amerikaner aus Washington, DC.  - Susan - agile Dänin, die persönlichen Kontakt mit der zuständigen Person für  Reservierungen vermeiden möchte.  - Jules - unerfahrener französischer Benutzer, der ein gutes Geschäft für das  Wochenende sucht.  - Jürgen - ein kostenbewußter Deutscher, der die Ferien plant.",
    "categories": [
      "Rollen",
      "Planung"
    ],
    "synonyms": [
      "Benutzer repräsentation"
    ]
  },
  "Positiver Befund": {
    "description": "Siehe Befund.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "positives Usability-Testergebnis"
    ]
  },
  "Post-Test-Interview": {
    "description": "Eine Aktivität in einem Usabilitytest, bei der Testteilnehmer Fragen bezüglich  ihres allgemeinen Eindrucks hinsichtlich der Gebrauchstauglichkeit des  interaktiven Systems beantworten. Das Post-Test-Interview findet statt,  nachdem der Testteilnehmer soviele der vorgehsehenen Aufgaben wie möglich  in der vorgegeben Zeit erledigt hat. Manchmal als ,,Debriefing\" bezeichnet.",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      "Debriefing",
      "Post-Session Interview",
      "Nachbesprechung"
    ]
  },
  "Pre-Test-Interview": {
    "description": "Eine Tätigkeit bei einem Usabilitytest, bei der Testteilnehmer Fragen  bezüglich ihres Hintergrundes und vorheriger Erfahrung mit dem interaktiven  System oder ähnlichen interaktiven Systemen beantworten. Das Pre-Test-  Interview findet statt, bevor der Testteilnehmer beginnt, die Testaufgaben  abzuarbeiten.",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      "Pre-Session Interview",
      "Briefing"
    ]
  },
  "PrimäreBenutzer": {
    "description": "Siehe Benutzer",
    "categories": [
      "Rollen",
      "Planung"
    ],
    "synonyms": [
      "Primary user"
    ]
  },
  "Protokollant": {
    "description": "Eine Rolle in einem Usabilitytest. Der Protokollant ist ein Usabilityspezialist, der  wichtigte Befunde während eines Usabilitytests notiert. Der Einsatz eines  Protokollants erlaubt dem Moderator, sich voll auf den Testteilnehmer zu  konzentrieren.",
    "categories": [
      "Rollen",
      "Test"
    ],
    "synonyms": [
      "Note-taker"
    ]
  },
  "Prototyp": {
    "description": "Eine Repräsentation von Teilen oder des gesamten interaktiven Systems, die  in einem bestimmten Maß für Analyse, Design und Evaluierung benutzt werden  kann.  ",
    "categories": [
      "Test",
      "System"
    ],
    "synonyms": [
      ""
    ]
  },
  "Qualitative Nutzungsanforderung": {
    "description": "Siehe Nutzungsanforderung ­ qualitativ",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "Qualitative user requirement"
    ]
  },
  "Qualität": {
    "description": "Grad der Erfüllung von Anforderungen durch ein interaktives System.  ",
    "categories": [
      "Planung",
      "Anforderungen",
      "Evaluierung"
    ],
    "synonyms": [
      "Quality"
    ]
  },
  "QuantitativeNutzungsanforderung": {
    "description": "Siehe Nutzungsanforderung ­ quantitativ",
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "synonyms": [
      "Quantitative user requirement"
    ]
  },
  "Rekrutierung(eines Teilnehmers für einen Usabilitytest)": {
    "description": "Anwerben von Benutzern, die die erforderliche Qualifikation haben, an einem  Usabilitytest teilzunehmen. Oft wird ein Rekrutierungsfragebogen (Screener)  eingesetzt, mit dem geprüft werden kann, ob Kandidaten über die erforderlichen  Qualifikationen zur Teilnahme an einem Usbilitytest verfügen.",
    "categories": [
      "Planung",
      "Test"
    ],
    "synonyms": [
      "Recruiting"
    ]
  },
  "Rekrutierungsfragebogen": {
    "description": "Eine Reihe von Fragen für potenzielle Testteilnehmer hinsichtlich ihres  Hintergrundes und Wissens. Ein Rekrutierungsfragebogen wird während der  Rekrutierung von Testteilnehmern benutzt, um festzustellen ob Kandidaten  über die erforderlichen Qualifikationen zur Teilnahme an dem Usabilitytest  verfügen.  Ein Rekrutierungsfragebogen kann auch benutzt werden, um passende  Teilnehmer für Nutzungskontextanalysen auszuwählen ­ z.B. für kontextuelle  Interviews.",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "Recruitment screener"
    ]
  },
  "Remote Usabilitytest": {
    "description": "Siehe Usabilitytest ­ Remote.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Ressourcen": {
    "description": "Alle nötigen Mittel zur Verwendung eines interaktiven Systems oder Dienstes.  Typische Beispiele sind Zeit sowie motorische und mentale Anstrengung.",
    "categories": [
      "System"
    ],
    "synonyms": [
      "Ressources"
    ]
  },
  "Review": {
    "description": "Eine von Laien, d.h. von Menschen mit begrenzter Usabilityerfahrung,  durchgeführte Inspektion.  ",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Richtlinie für Benutzungsschnittstellen": {
    "description": "Siehe Gestaltungsregel.",
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "synonyms": [
      "Gestaltungsregel",
      "User interface guideline"
    ]
  },
  "Rolle": {
    "description": "Ein Menge zusammenhängender Aspekte wie Verhalten, Rechte,   Verpflichtungen und Normen in einer Arbeitssituation.   Abhängig von der Komplexität eines Projektes können mehrere Menschen eine  Rolle teilen oder mehrere Rollen einer Person zugewiesen werden.  ",
    "categories": [
      "Anforderungen",
      "Rollen"
    ],
    "synonyms": [
      "Role"
    ]
  },
  "Sekundäre Benutzer": {
    "description": "Menschen, die keine Benutzer sind, aber auf gewisse Weise vom interaktiven  System betroffen oder beinflusst sind.  Beispiele: Sekundäre Benutzer sind u.a. Führungskräfte von Benutzern,  Vertriebspersonal und Vertreter, Projektmanager, Anwendungsentwickler,  Trainer und das Kundenbetreuungsteam. Ist das interaktive System für die  Benutzung zuhause gedacht, können sekundäre Benutzer auch Freunde oder  Verwandte und Besucher des Benutzers sein.  ",
    "categories": [
      "Rollen",
      "Planung"
    ],
    "synonyms": [
      "secondary user"
    ]
  },
  "Selbstbeschreibungsfähigkeit": {
    "description": "Ein Dialogprinzip.    Ein Dialog ist selbstbeschreibungsfähig in dem Ausmaß, in dem es zu jeder Zeit    dem Benutzer offensichtlich ist, in welchem Dialog er sich gerade wo befindet  und welche Aktionen wie durchgeführt werden können.",
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "synonyms": [
      "Usability",
      "Affordance",
      "Self-discriptiveness"
    ]
  },
  "Standard": {
    "description": "Siehe Benutzungsschnittstellenstandard.",
    "categories": [
      "Prinzipien",
      "Implementierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Steuerbarkeit": {
    "description": "Ein Dialogprinzip.  Ein Dialog ist steuerbar, wenn der Benutzer in der Lage ist, den Dialogablauf zu  starten sowie seine Richtung und Geschwindigkeit zu beeinflussen, bis das Ziel  erreicht ist.",
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "synonyms": [
      "Controllability"
    ]
  },
  "Storyboard": {
    "description": "Eine Folge visueller Bildschirminhalte, die das Zusammenspiel zwischen einem  Benutzer und einem vorgestellten interaktiven System darstellt. Ein  Storyboard ähnelt oft einem Zeichtrickfilm.",
    "categories": [
      "Planung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Styleguide": {
    "description": "Eine Sammlung von Dialogprinzipien und Gestaltungsregeln die verwendet  wird, um die grundsätzliche Erscheinung der Benutzungsschnittstelle auf  jeglicher Software einer Organisation festzulegen.",
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "synonyms": [
      "Gstaltungsregel",
      "UX Guides",
      "Richtlinie"
    ]
  },
  "Suche": {
    "description": "Eine Komponente der Benutzungsschnittstelle, die zum (Wieder)Auffinden von  Nutzungsobjekten auf Basis fragmentaler Informationen zu diesem Objekt  herangezogen wird.",
    "categories": [
      "Prinzipien",
      "System"
    ],
    "synonyms": [
      "Quest",
      "Search"
    ]
  },
  "Suggestivfrage": {
    "description": "Eine Frage in einem Interview, die Annahmen oder einen Rahmen voraussetzt,  der eine Präferenz für bestimmte Antwortmöglichkeiten vorgibt oder versucht,  die Antwort in eine bestimmte Richtung zu lenken. Vergleiche mit neutraler  Frage.",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      "Leading question"
    ]
  },
  "Summative Evaluierung": {
    "description": "Eine Usabilityevaluierung zur Feststellung, ob ein interaktives System die  Nutzungsanforderungen erfüllt. Summative Evaluierungen werden auch  benutzt um den Grad der erreichten Gebrauchstauglichkeit eines interaktiven  Systems zu bestimmten. Summative Evaluierungen finden in der Regel dann  statt, wenn ein interaktives System oder wesentliche Teile davon fertig  entwickelt sind.  ",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      "Summative usability evaluation"
    ]
  },
  "Szenario": {
    "description": "Siehe Nutzungsszenario oder Testaufgabe.",
    "categories": [
      "Planung",
      "Test"
    ],
    "synonyms": [
      "Nutzungs-Szenario",
      "Use scenario",
      "Scenario"
    ]
  },
  "Testaufgabe": {
    "description": "Eine Beschreibung einer typischen Aufgabe, die ein Moderator einem  Testteilnehmer während eines Usabilitytests stellt. Manchmal als  Testszenario bezeichnet.",
    "categories": [
      "Planung",
      "Test"
    ],
    "synonyms": [
      "Usability-Testaufgabe",
      "Usability test task"
    ]
  },
  "Testbericht": {
    "description": "Siehe Usabilitytestbericht.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "Usability Testbericht",
      "Evaluierungsbericht",
      "Test report"
    ]
  },
  "Testskript": {
    "description": "Eine von einem Moderator in einem Usabilitytest verwendete Checkliste, um  den Überblick über die Fragen des Pre-Test-Interviews, die Testaufgaben und  die Fragen des Post-Test-Interviews zu behalten.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "Usability Checkliste",
      "Test script",
      "Usability"
    ]
  },
  "Testszenario": {
    "description": "Siehe Testaufgabe.",
    "categories": [
      "Test",
      "Planung"
    ],
    "synonyms": [
      "Szenario",
      "Testaufgabe"
    ]
  },
  "Testteilnehmer": {
    "description": "Repräsentativer Benutzer, der typische Aufgaben in einem Usabilitytest löst.",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      "Benutzer",
      "Test participant"
    ]
  },
  "Umgebung": {
    "description": "Die Gesamtheit der gegebenen Umstände oder Bedingungen, in denen ein  Benutzer arbeitet. Diese umfassen die physische und die soziale Umgebung.  ",
    "categories": [
      "Planung",
      "System"
    ],
    "synonyms": [
      "Context",
      "Environment",
      "Nutzungskontext"
    ]
  },
  "Unbeaufsichtigter Usabilitytest": {
    "description": "Siehe Usabilitytest ­ Unbeaufsichtigt.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usability": {
    "description": "Ausmaß, in dem ein interaktives System oder ein Dienst durch bestimmte  Benutzer in einem bestimmten Nutzungskontext genutzt werden kann, um  festgelegte Ziele effektiv, effizient und zufriedenstellend zu erreichen.  ",
    "categories": [
      "Test",
      "Anforderungen",
      "Prinzipien"
    ],
    "synonyms": [
      "Gebrauchstauglichkeit"
    ]
  },
  "Usability Engineer": {
    "description": "Eine Rolle im Prozess der menschzentrierten Gestaltung.    Der Usability Engineer betreut in einer Querschnittsfunktion verantwortlich den  menschzentrierten Gestaltungsprozess. Er ist kompetent und erfahren in den  Prozessschritten, verfügbaren Methoden der menschzentrierten Gestaltung  und Gestaltungsregel für Benutzererlebnis, sodass er die  Entwicklungsprojekte unter dem Aspekt menschzentrierter Gestaltung planen  und die Qualität der Ausführung von menschzentrierter  Gestaltungsbezogenen Aktivitäten sicherstellen kann.  Dies beinhaltet die Integration der menschzentrierten Gestaltung in den  Produktentwicklungsprozess des Unternehmens, die Definition von  Erfolgskriterien für solche Projekte sowie das Training von beteiligten  Projektteams. Er ist in der Lage, die für das jeweilige Projekt relevanten  Arbeitsergebnisse, hierfür geeignete Vorgehensweisen sowie Arbeitshilfen und  Festlegungen (z.B. Dialogprinzipien und Gestaltungsregel) für den  menschzentrierten Gestaltungsprozess zu identifizieren und für ein Projekt  festzulegen.",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usability Professional": {
    "description": "Eine Person, die qualifiziert und methodisch die Anforderungen an die Usability  (Gebrauchstauglichkeit) interaktiver Systeme (Hardware und Software)  herleitet, umsetzt oder deren Umsetzung überprüft.  Der Usability Professional ist typischerweise in einem oder mehrerer der  folgenden Arbeitsschwerpunkte spezialisiert:  Analyse - Erheben von Nutzungskontexten, Herleiten von  Nutzungsanforderungen  Gestaltung - Konzipieren der Interaktion zwischen Mensch und interaktives  System, strukturieren und darstellen handlungsleitender Informationen.  Evaluierung - Durchführen von inspektionbasierten Evaluierungen (ohne  Nutzer) und Usabilitytests (mit Nutzern)  Prozessgestaltung und Methodeneinsatz - Festlegen, Einführen und Betreiben  eines menschzentrierten Gestaltungsprozesses.  Die Grundlage der Tätigkeiten eines Usability Professionals sind die  internationalen Normen zur Usability interaktiver Systeme und deren  Gestaltungsprozess (ISO 9241) sowie aktuelles, publiziertes Fachwissen.  Usability Professionals arbeiten in Projekten zu Herstellung von interaktiven  Systemen und mit ihnen verbundener Dienstleistungen und Prozesse für den  Einsatz in zahlreichen Projektkontexten (z.B. interaktive Systeme für den  gewerblichen Einsatz, Haushaltsgeräte, interaktive Spiele, mobile Endgeräte).",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usability Tester": {
    "description": "Eine Rolle im Prozess der menschzentrierten Gestaltung.  Der Usability Tester evaluiert Benutzungsschnittstellen in verschiedenen  Stadien der Realisierung. Er definiert in Abstimmung der Prozessbeteiligten den  Aufbau der Evaluierungen und verantwortet die valide Ausführung der  Evaluierungen.  Der Usability Tester erstellt entwicklungsbegleitende Usabilitytestberichte mit  dem Ziel der Produktverbesserung sowie den Usabilitytestbericht über die  abschließende summative Evaluierung. Er kommuniziert diese Ergebnisse an  die Interessenvertreter (Projektbeteiligten) oder betreut deren Kommunikation  verantwortlich. Dies kann bspw. im Rahmen eines Abnahmetests in  Zusammenarbeit mit dem User Requirements Engineer erfolgen.",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      "Benutzer"
    ]
  },
  "Usabilityevaluierung": {
    "description": "Ein üblicher Ausdruck für Evaluierung ­ inspektionsbasiert und Evaluierung  ­ benutzerbasiert.",
    "categories": [
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilitylabor": {
    "description": "Zwei oder mehrere Räume, die speziell für die Durchführung von Usabiltytests  oder Fokusgruppen ausgestattet sind. Ein Usabilitylabor besteht of aus einem  Testraum, wo die Testteilnehmer sitzen, und einem Beobachtungsraum, wo  Interessenvertreter die Testteilnehmer beobachten können, während die  Testteilnehmer Aufgaben lösen. Oft sind diese zwei Zimmer durch eine  Spiegelwand getrennt, was den Beobachtern erlaubt, den Testteilnehmern  zuzuschauen, nicht aber umgekehrt.",
    "categories": [
      "System",
      "Planung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilityproblem": {
    "description": "Siehe Nutzungsproblem",
    "categories": [
      "Gestaltung",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilitytest": {
    "description": "Der Validierungsprozess zur Feststellung dass ein interaktives System alle  vorher festgelegten Nutzungsanforderungen erfüllt. Ein Usabilitytest kann die  Umsetzung der vorliegenden quantitativen und qualitativen  Nutzungsanforderungen einschließlich Aufgabenvervollständigung,  Aufgabendauer, Fehlerraten und Benutzerzufriedenstellung validieren.  Ein Usabilitytest umfasst eine Reihe von Usabilitytestsitzungen. In jeder  Sitzung versucht ein Testteilnehmer unter Benutzung des interaktiven  Systems oder eines Prototypen eines interaktiven Systems repräsentative  Aufgaben zu lösen. Üblicherweise werden Testsitzungen von einem Moderator  moderiert und von einer Anzahl von Interessenvertretern beobachtet. Ein  Protokollant zeichnet wichtige Befunde auf.  Testen kann formal oder informal sein. Das Testen kann face-to-face (mit einem  physisch anwesenden Moderator am gleichen Platz wie die Testteilnehmer)  oder remote stattfinden und qualitative oder quantitative Daten ergeben. Das  Testen kann zu jedem Zeitpunkt während der Entwicklungsphase geschehen ­  von der frühen Analysephase bis hin zur Lieferung des interaktiven Systems  und darüberhinaus. Die Tests können sowohl an Papierentwürfen oder primitive  Attrappen als auch an in Entwicklung befindlichen oder bereits fertiggestellten  interaktiven Systemen durchgeführt werden.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilitytest ­ Face-to-face": {
    "description": "Ein Usabilitytest, bei dem sich die Testteilnehmer und der Moderator am selben  physischen Ort befinden.  ",
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilitytest ­ Remote": {
    "description": "Ein Usabilitytest bei dem sich die Testteilnehmer und der Moderator an  unterschiedlichen Orten befinden. Der Moderator beobachtet die  Testteilnehmer über eine Internetverbindung. Der Moderator kommuniziert mit \t den Testteilnehmern über Telefon oder Internetverbindung.  ",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilitytest ­ Unbeaufsichtigt": {
    "description": "Ein Usabilitytest bei dem Testteilnehmer Testaufgaben lösen ohne dabei  beobachtet zu werden. Handlungen werden auf Video zur späteren Analyse  aufgezeichnet.  ",
    "categories": [
      "Test"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilitytestbericht": {
    "description": "Ein Dokument, das die Ergebnisse eines Usabilitytests beschreibt. Ein  Usabilitytestbericht beinhaltet eine Kurzdarstellung, 5-50 Befunde und das  Testskript für den Usabilitytest. Oft umfasst der Usabilitytestbericht auch  relevante Screenshots oder Bilder des getesteten interaktiven Systems.  Manchmal auch als Testbericht bezeichnet.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "Testbericht",
      "Evaluierungsbericht",
      "Test report"
    ]
  },
  "Usabilitytestergebnis": {
    "description": "Siehe Befund.",
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "synonyms": [
      "Usability-Befund",
      "Usability finding",
      "Usability-Befund"
    ]
  },
  "Usabilitytestplan": {
    "description": "Eine kurze Beschreibung des Zwecks und Umfangs eines Usabilitytests. Der  Plan beinhaltet die Anzahl geplanter Testteilnehmer, die ungefähre Länge jeder  Testsitzung, den Namen des Moderators, einen Zeitplan und eine  Kostenschätzung für den Usabilitytest einschließlich Personenstunden.",
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "synonyms": [
      ""
    ]
  },
  "Usabilitytestsitzung": {
    "description": "Der Teil eines Usabilitytests, bei dem ein bestimmter Testteilnehmer  repräsentative Aufgaben unter Benutzung des interaktiven Systems oder des  Prototypen eines interaktiven Systems löst.  ",
    "categories": [
      "Gestaltung",
      "Test"
    ],
    "synonyms": [
      ""
    ]
  },
  "User Interface Designer": {
    "description": "Eine Rolle im Prozess des menschzentrierten Designs.   Ein User Interface Designer implementiert das Benutzererlebnis basierend auf  dem Design und den Nutzungsszenarios, des Interaktionsdesigners.  Der User Interface Designer erzeugt interaktive Prototypen.  ",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      "Usability Professional"
    ]
  },
  "User Requirements Engineer": {
    "description": "Eine Rolle im Prozess des menschzentrierten Designs.    Der User Requirements Engineer identifiziert und beschreibt den tatsächlichen  Nutzungskontext von Benutzern. Daraus leitet der User Requirements  Engineer die Nutzungsanforderungen und damit verbundene  Organisatorische Anforderungen ab, die für ein bestimmtes Projekt umgesetzt  werden müssen. Der User Requirements Engineer priorisiert die Anforderungen  um sicherzustellen, dass die grundsätzlichen Erfordernisse des Benutzers  erfüllt werden.",
    "categories": [
      "Rollen"
    ],
    "synonyms": [
      ""
    ]
  },
  "Wireframe": {
    "description": "Grobe Skizze von Navigations- und Inhaltselementen, die eine  Benutzungsschnittstelle ausmachen. Typischerweise werden dabei das  visuelle Design und das exakte Layout ignoriert. Auf Deutsch auch  ,,Drahtgeflecht\" genannt.",
    "categories": [
      "Planung"
    ],
    "synonyms": [
      "Mockup",
      "Modell Attrappe"
    ]
  },
  "Ziel": {
    "description": "Angestrebtes Arbeitsergebnis.",
    "categories": [
      "Anforderungen",
      "Prinzipien"
    ],
    "synonyms": [
      "Goal"
    ]
  },
  "Zufriedenstellung": {
    "description": "Freiheit von Beeinträchtigungen und positive Einstellungen gegenüber der  Nutzung des interaktiven Systems.  ",
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "synonyms": [
      "Satisfaction"
    ]
  },
  "﻿Affordance": {
    "description": "Siehe Handlungsleitung",
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "synonyms": [
      "Handlungsleitung",
      "Selbstbeschreibungsfähigkeit"
    ]
  }
}