[
  {
    "categories": [
      "Prinzipien"
    ],
    "description-english": "An aspect of an object that makes it obvious how the object could be used.\n",
    "description-german": "Aspekte eines Objektes, die verdeutlichen, wie das Objekt benutzt werden kann.\n",
    "term-english": "Affordance",
    "term-german": "Affordance"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung",
      "Anforderungen"
    ],
    "description-english": "A condition or capability that must be met or possessed by an interactive system to satisfy an agreement, standard, specification or other formally imposed documents\n",
    "description-german": "Eine Bedingung oder Fähigkeit, die ein  interaktives System erfüllen oder besitzen muss, um einer Vereinbarung, einem Standard, einer Spezifikation oder anderen formal zugrunde gelegten Dokumenten zu genügen.\n",
    "term-english": "Requirement",
    "term-german": "Anforderung"
  },
  {
    "categories": [
      "Anforderungen",
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "Activities required to achieve a goal \n",
    "description-german": "Aktivität die erforderlich ist, um ein Ziel zu erreichen.\n",
    "term-english": "Task",
    "term-german": "Aufgabe"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "The property of an interactive system to support the user in the completion of the task, i.e. to base the functionality and the dialogue on the task characteristics (rather than the technology chosen to perform the task).\n",
    "description-german": "Die Eigenschaft eines interaktives Systems den Benutzer zu unterstützen, seine Aufgabe zu erledigen, d. h., die Funktionalität und Dialog an die charakteristischen Eigenschaften der Aufgabe anzupassen, anstatt an die zur Aufgabenerledigung eingesetzten Technologie.\n",
    "term-english": "Suitability for the task",
    "term-german": "Aufgabenangemessenheit"
  },
  {
    "categories": [
      "Implementierung"
    ],
    "description-english": "A description of the subtasks that have to be carried out in order to reach the user’s goals.\n",
    "description-german": "Eine Beschreibung der Teilaufgaben die erledigt werden müssen, um die Ziele des Benutzers zu erreichen.\n",
    "term-english": "Task model",
    "term-german": "Aufgabenmodell"
  },
  {
    "categories": [
      "Prinzipien"
    ],
    "description-english": "The attributes and characteristics of an interactive system that allow people with limited vision, hearing, dexterity, cognition or physical mobility to interact effectively and efficiently with the interactive system.\n",
    "description-german": "Die Attribute und Charakteristiken eines interaktiven Systems die Menschen mit eingeschränkter Sicht, eingeschränktem Hören, eingeschränkter Geschicklichkeit, eingeschränkter Kognition oder eingeschränkter physischer Mobilität ermöglichen sollen effektiv und effizient mit dem interaktiven System zu interagieren.\n",
    "term-english": "Accessibility",
    "term-german": "Barrierefreiheit"
  },
  {
    "categories": [
      "Rollen",
      "Anforderungen"
    ],
    "description-english": "Person who interacts with an interactive system, or who uses the output of the system.\n",
    "description-german": "Person, die mit einem interaktiven System arbeitet oder Daten die vom System erzeugt werden benutzt.\n",
    "term-english": "User",
    "term-german": "Benutzer"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "An evaluation where users are asked to report subjective data into a questionnaire based on their experience in using an interactive system.\n",
    "description-german": "Eine Evaluierung bei der Benutzer subjektive Daten in einem Fragebogen angeben sollen, basierend auf ihren Erfahrungen bei der Benutzung eines interaktiven Systems. \n",
    "term-english": "User survey",
    "term-german": "Benutzerbefragung"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung",
      "System"
    ],
    "description-english": "Written or other information for users about an interactive system, how it works, and how to use it.\n",
    "description-german": "Für Benutzer geschriebene oder andere Anleitungen zu dem interaktiven System, wie es funktioniert, und wie man es bedient.\n",
    "term-english": "User documentation",
    "term-german": "Benutzerdokumentation"
  },
  {
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "description-english": "A person's perceptions and responses resulting from the use or anticipated use of an interactive system.\n",
    "description-german": "Wahrnehmungen und Reaktionen einer Person, die aus der tatsächlichen oder erwarteten Benutzung eines interaktiven Systems resultieren. \n",
    "term-english": "User experience",
    "term-german": "Benutzererlebnis"
  },
  {
    "categories": [
      "Rollen",
      "Planung",
      "Gestaltung",
      "Evaluierung"
    ],
    "description-english": "A collection of users with the same or similar personal characteristics and context of use related to the interactive system.",
    "description-german": "Eine Gruppe von Benutzern mit denselben oder ähnlichen Personenmerkmalen und Nutzungskontext bezogen auf das interaktive System.",
    "term-english": "User group",
    "term-german": "Benutzergruppe"
  },
  {
    "categories": [
      "Rollen",
      "Evaluierung"
    ],
    "description-english": "A generalized description of a user group.",
    "description-german": "Eine verallgemeinerte Beschreibung einer Benutzergruppe.",
    "term-english": "User group profile",
    "term-german": "Benutzergruppenprofil"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung",
      "System"
    ],
    "description-english": "Information to help a user to interact with an interactive system. \n",
    "description-german": "Informationen um einem Benutzer bei der Interaktion mit einem interaktiven System zu helfen.\n",
    "term-english": "User assistance",
    "term-german": "Benutzerunterstützung"
  },
  {
    "categories": [
      "Planung",
      "Test",
      "Evaluierung"
    ],
    "description-english": "Usability evaluation that involves representative users performing specific tasks with the interactive system to enable identification of usability problems, or measurements of efficiency, effectiveness, user satisfaction, or other measures of user experience.\n",
    "description-german": "Usability-Evaluierung, die repräsentative Benutzer involviert, die bestimmte Aufgaben mit dem interaktiven System ausführen, um die Identifikation von Usability-Problemen oder die Messung von Effizienz, Effektivität und Zufriedenstellung zu ermöglichen.\n",
    "term-english": "Usability evaluation –  User based",
    "term-german": "Benutzerzentrierte Usability-Evaluierung"
  },
  {
    "categories": [
      "System",
      "Gestaltung",
      "Implementierung"
    ],
    "description-english": "All components of an interactive system (software or hardware) that provide information and controls for the user to accomplish specific tasks with the interactive system.",
    "description-german": "Alle Bestandteile eines interaktiven Systems (Software oder Hardware), die Informationen und Steuerelemente zur Verfügung stellen, die für den Benutzer notwendig sind, um bestimmte Aufgaben mit dem interaktiven System zu erledigen.",
    "term-english": "User interface",
    "term-german": "Benutzungsschnittstelle"
  },
  {
    "categories": [
      "Rollen",
      "System"
    ],
    "description-english": "A person who watches users who discuss or carry out tasks that are related to the interactive system.\n",
    "description-german": "Eine Person, die Benutzer beobachtet, die eine Aufgabe diskutieren oder eine Aufgabe mittels eines interaktiven Systems ausführen.\n",
    "term-english": "Observer",
    "term-german": "Beobachter"
  },
  {
    "categories": [
      "Prinzipien",
      "Anforderungen"
    ],
    "description-english": "A technique for gathering contextual information relating to user needs in which an observer watches users who carry out tasks that are related to the interactive system. \n",
    "description-german": "Eine Technik für das Sammeln von Kontextinformationen zu den Erfordernissen des Nutzungskontexts. Während einer xxx sieht der Beobachter dem Benutzer bei der Ausführung von Aufgaben am interaktiven System zu. \n",
    "term-english": "Observation",
    "term-german": "Beobachtung"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "The first activity in an Interview or a Usability test session where the participant is informed about the purpose of the Interview or Usability test and what their role and contribution are.",
    "description-german": "Die erste Aktivität in einem Interview oder Usability-Test, in dem dem Teilnehmer erklärt wird, warum das Interview oder der Usability-Test durchgeführt wird und was seine Rolle und sein Beitrag ist",
    "term-english": "Briefing",
    "term-german": "Briefing"
  },
  {
    "categories": [
      "Gestaltung",
      "Test",
      "Evaluierung"
    ],
    "description-english": "A general reusable solution to a commonly occurring problem within a given context in software design that describes a design problem, a solution, and where this solution has been found to work.\nCourse note:\n1.\tSeveral websites offer free access to a large selection of xxxs, for example www.welie.com",
    "description-german": "Eine wiederverwendbare Lösung für ein Gestaltungsproblem innerhalb eines Kontexts. Ein xxx beschreibt ein Gestaltungsproblem, eine Lösung und wo sich diese Lösung als funktionierend herausgestellt hat.\n",
    "term-english": "Design pattern",
    "term-german": "Design Pattern"
  },
  {
    "categories": [
      "Gestaltung",
      "System",
      "Prinzipien",
      "Implementierung"
    ],
    "description-english": "Interaction between a user and an interactive system that consists of user actions (input) and responses from the interactive system (output) in order to achieve a goal.",
    "description-german": "Interaktion zwischen einem Benutzer und einem interaktiven System in Form einer Folge von Handlungen des Benutzers (Eingaben) und Antworten des interaktiven Systems (Ausgaben), um ein Ziel zu erreichen.",
    "term-english": "Dialogue",
    "term-german": "Dialog"
  },
  {
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "General goals for the design of useful and usable dialogues.\n",
    "description-german": "Allgemeine Ziele für das Dialogdesign.\n",
    "term-english": "Dialogue principles",
    "term-german": "Dialogprinzipien"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "Person who interacts with an interactive system.\n",
    "description-german": "Eine Person, die mit einem interaktiven System interagiert.\n",
    "term-english": "Direct user",
    "term-german": "Direkter Benutzer"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "A measure given to a usability problem from a usability test to indicate the impact and criticality on the user experience and the consequences.\n",
    "description-german": "Ein Maß für ein Usability-Problem aus einem Usability-Test, das die Auswirkung des Usability-Problems auf das Benutzererlebnis bewertet.\n",
    "term-english": "Severity rating",
    "term-german": "Dringlichkeitsstufe"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "Extent to which correct and complete goals are achieved.\n",
    "description-german": "Ausmaß der Vollständigkeit und Genauigkeit der Zielerreichung.\n",
    "term-english": "Effectiveness",
    "term-german": "Effektivität"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "Resources expended to achieve specified goals. \n",
    "description-german": "Eingesetzte Ressourcen, um bestimmte Ziele zu erreichen.\n",
    "term-english": "Efficiency",
    "term-german": "Effizienz"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "A prerequisite identified as necessary for a user, or a user group, to achieve a goal, implied or stated within a specific context of use.\n",
    "description-german": "Eine für einen Benutzer oder eine Benutzergruppe als notwendig identifizierte Voraussetzung, um ein Ziel innerhalb eines bestimmten Nutzungskontextes zu erreichen. \n",
    "term-english": "User need",
    "term-german": "Erfordernis"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "Correspondence to predictable contextual needs of the user and to commonly accepted conventions.\n",
    "description-german": "Übereinstimmung mit den aus dem Nutzungskontext heraus vorhersehbaren Benutzerbelangen sowie allgemein anerkannten Konventionen.\n",
    "term-english": "Conformity with user expectations",
    "term-german": "Erwartungskonformität"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A document reporting the results of a usability test, an inspection or a user survey.\n",
    "description-german": "Ein Dokument, in dem die Ergebnisse eines Usability-Tests, einer Inspektion oder einer Benutzerbefragung dokumentiert werden.\n",
    "term-english": "Evaluation report",
    "term-german": "Evaluierungsbericht"
  },
  {
    "categories": [
      "Anforderungen",
      "Evaluierung"
    ],
    "description-english": "The property of a dialogue to achieve the intended result with either no, or minimal, corrective action by the user despite evident errors in input. \n",
    "description-german": "Die Eigenschaft eines Dialogs das beabsichtigte Arbeitsergebnis trotz erkennbar fehlerhafter Eingaben entweder mit keinem oder mit minimalem Korrekturaufwand seitens des Benutzers zu erreichen.\n",
    "term-english": "Error tolerance",
    "term-german": "Fehlertoleranz"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung",
      "Rollen"
    ],
    "description-english": "A focused discussion where a moderator leads a group of participants through a set of questions on a particular topic.\n",
    "description-german": "Eine gezielte Diskussion, bei der ein Moderator eine Gruppe von Teilnehmern durch eine Menge von Fragen zu einem bestimmten Thema führt. \n",
    "term-english": "Focus group",
    "term-german": "Fokusgruppe"
  },
  {
    "categories": [
      "Evaluierung",
      "Test",
      "Prinzipien"
    ],
    "description-english": "A type of usability evaluation designed and used to improve an interactive system, especially when it is still being designed.\n",
    "description-german": "Eine Art der Usability-Evaluierung die hilft, das Design für ein interaktives System zu verbessern, besonders während es noch gestaltet wird.\n",
    "term-english": "Formative usability evaluation",
    "term-german": "Formative Usability-Evaluierung"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A set of questions that is used collect data from users, often in a user survey.\n",
    "description-german": "Ein Satz von Fragen, der von Benutzern in einer Benutzerbefragung beantwortet wird, um  Daten zu sammeln.\n",
    "term-english": "Questionnaire",
    "term-german": "Fragebogen"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "An interview question that requires an answer from a predetermined set of alternatives, for example yes and no.\n",
    "description-german": "Eine Interviewfrage die eine Antwort aus einem vordefinierten Satz von Alternativen fordert, oft einfach „ja“ oder „nein“.\n",
    "term-english": "Closed question",
    "term-german": "Geschlossene Frage"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "A generally recognized rule of thumb that helps to achieve usability.\n",
    "description-german": "Eine allgemein anerkannte Daumenregel die hilft Usability zu erreichen.\n",
    "term-english": "Heuristic",
    "term-german": "Heuristik"
  },
  {
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "A usability evaluation method in which one or more evaluators, preferably experts, compare an interactive system to a list of heuristics and identify where the interactive system does not follow those heuristics.\n",
    "description-german": "Eine Methode der Usability-Evaluierung bei der ein oder mehrere Begutachter – vorzugsweise Experten – ein interaktives System mit einer Liste von Heuristiken vergleichen und feststellen an welchen Stellen das interaktive System diesen Heuristiken nicht folgt.\n",
    "term-english": "Heuristic evaluation",
    "term-german": "Heuristische Evaluierung"
  },
  {
    "categories": [
      "Test",
      "System"
    ],
    "description-english": "A software prototype of the user interface to the interactive system that is being designed. A xxx resembles the finished interactive system and may or may not be interactive.\n",
    "description-german": "Ein Software Prototyp der Benutzungsschnittstelle des zu designenden interaktiven Systems. Ein xxx ähnelt dem fertigen interaktiven System und kann interaktiv oder nicht interaktiv sein.\n",
    "term-english": "High-fidelity prototype",
    "term-german": "High-fidelity-Prototyp"
  },
  {
    "categories": [
      "Anforderungen",
      "Prinzipien"
    ],
    "description-english": "A family of standards covering human-centred design.\n",
    "description-german": "Eine Reihe von Standards, die die menschzentrierte Gestaltung interaktiver Systeme betrifft.  \n",
    "term-english": "ISO 9241",
    "term-german": "ISO 9241"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "Person who directly uses the output of the interactive system, but does not interact directly with the system.\nExample of an xxx: \n1.\tA bank customer who receives a paper or electronic statement, or visits a branch is an xxx of the output produced by the bank computer system.",
    "description-german": "Personen, die direkt die Ergebnisse eines interaktiven Systems nutzen, aber nicht direkt mit dem System interagieren. \nBeispiel für xxx:\n1.\tEin Bankkunde, der ein Dokument oder einen elektronischen Bericht erhält, oder eine Filiale besucht, ist ein xxx eines Arbeitsergebnisses, das mit Hilfe eines Systems erzeugt wurde, das die Mitarbeiter der Bank benutzen.",
    "term-english": "Indirect user",
    "term-german": "Indirekter Benutzer"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "The property of a dialogue that allows users to modify interaction and presentation of information to suit their individual capabilities and needs.\n",
    "description-german": "Die Eigenschaft eines Dialogs die Benutzer ermöglicht die Interaktion mit dem System und die Darstellung von Informationen an ihre individuellen Fähigkeiten und Bedürfnisse anpassen zu können.\n",
    "term-english": "Suitability for individualization",
    "term-german": "Individualisierbarkeit"
  },
  {
    "categories": [
      "Rollen",
      "Gestaltung"
    ],
    "description-english": "A person who creates and organizes the structure of information to enable each user group to efficiently locate required information when using interactive systems. \n",
    "description-german": "Eine Person die die Struktur von Information in interaktiven Systemen für das effiziente Auffinden durch jede Benutzergruppe kreiert und organisiert.\n",
    "term-english": "Information architect",
    "term-german": "Informationsarchitekt"
  },
  {
    "categories": [
      "Gestaltung",
      "Anforderungen"
    ],
    "description-english": "The naming and structuring of the information that must be accessible to the user, including task objects, system objects (such as printers) and additional information that users need.",
    "description-german": "Die Benennung und Strukturierung der Informationen die für den Benutzer erreichbar sein müssen einschließlich der Nutzungsobjekte, Systemobjekte (wie z.B. „Drucker“) und weiterer für den Benutzer erforderlichen Informationen. ",
    "term-english": "Information architecture",
    "term-german": "Informationsarchitektur"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "Usability evaluation based on the judgment of one or more evaluators who examine or use an interactive system to identify potential usability problems and deviations from established criteria.\n",
    "description-german": "Usability-Evaluierung die auf der Beurteilung ein oder mehrerer Evaluatoren basiert, die ein interaktives System prüfen oder benutzen, um potentielle Usability-Probleme und Abweichungen von anerkannten Kriterien zu identifizieren.\n",
    "term-english": "Usability evaluation – Inspection based",
    "term-german": "Inspektionsbasierte Usability-Evaluierung"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who defines and designs the interaction between humans and system based on user requirements and the context of use.\n",
    "description-german": "Eine Person die die Interaktion zwischen Mensch und System auf Basis der Nutzungs­anforderungen und Nutzungskontext definiert und konzipiert. \n",
    "term-english": "Interaction designer",
    "term-german": "Interaktionsdesigner"
  },
  {
    "categories": [
      "System",
      "Anforderungen"
    ],
    "description-english": "A combination of hardware, software and/or services that receives input from, and communicates output to, users.\n",
    "description-german": "Kombination von Hardware-, Software- und Servicekomponenten, die Eingaben von einem Benutzer empfängt und Ausgaben zu einem Benutzer übermittelt.\n",
    "term-english": "Interactive system",
    "term-german": "Interaktives System"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "Individual or organization having a right, share, claim or interest in an interactive system or in its possession of characteristics that meet their needs and expectations.\n",
    "description-german": "Individuum oder Organisation, die ein Anrecht, einen Anteil, einen Anspruch oder ein Interesse auf ein interaktives System oder an dessen Merkmalen hat, die ihren Erfordernissen und Erwartungen entsprechen. \n",
    "term-english": "Stakeholder",
    "term-german": "Interessenvertreter"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "What the interactive system should be capable of from the point of view of the stakeholders.",
    "description-german": "Was das interaktive System aus Sicht des Interessenvertreters leisten muss.\n",
    "term-english": "Stakeholder requirement",
    "term-german": "Interessenvertreteranforderung"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A data-gathering technique that studies a few carefully selected individuals in depth to arrive at a fuller understanding of the work practice across all users. Through inquiry and interpretation, it reveals commonalities across an interactive system's user base.\n",
    "description-german": "Eine Methode der Datensammlung, die sorgfältig ausgewählte Individuen untersucht, um ein tiefes Verständnis der Arbeitstätigkeit der Benutzer zu erreichen. Durch die Befragung und Interpretation werden Gemeinsamkeiten und Unterschiede innerhalb der Benutzer  eines interaktiven Systems aufgedeckt.  \n",
    "term-english": "Interview",
    "term-german": "Interview"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "A written list of suitable questions and cues used by an interviewer during an interview to make sure that all relevant topics are addressed.",
    "description-german": "Eine schriftliche Liste passender Fragen und Hinweise, die während eines Interviews verwendet wird, um sicherzustellen, dass alle relevanten Themen berücksichtigt werden.",
    "term-english": "Interview checklist",
    "term-german": "Interviewcheckliste"
  },
  {
    "categories": [
      "Anforderungen",
      "Planung"
    ],
    "description-english": "Use of the interactive system is easy to understand, regardless of the user's experience, knowledge, language skills, or current concentration level. \n",
    "description-german": "Die Benutzung des interaktiven Systems ist unmittelbar zu verstehen – unabhängig von der Erfahrung, vom Wissen, von den Sprachkenntnissen oder vom momentanen Konzentrationsgrad des Benutzers.\n",
    "term-english": "Intuitive",
    "term-german": "Intuitiv"
  },
  {
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "description-english": "Repetitive.\nAn xxx process repeats steps in the human-centred design process until a usability evaluation of the user interface shows that the user requirements have been adequately met.",
    "description-german": "Wiederholend.\nEin xxxes Vorgehen wiederholt Schritte des Prozesses der menschzentrierten Gestaltung solange, bis eine Usability-Evaluierung der Benutzungsschnittstelle zeigt, dass die Nutzungsanforderungen ausreichend erfüllt sind.",
    "term-english": "Iterative",
    "term-german": "Iterativ"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "The same information is presented in the same way throughout the interactive system, in accordance with the user’s expectation.\n",
    "description-german": "Die gleiche Information wird in gleicher Weise innerhalb des gesamten interaktiven Systems entsprechend der Benutzererwartung dargestellt.\n",
    "term-english": "Consistency",
    "term-german": "Konsistenz"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "An interview that takes place at the location where the user's interaction with the interactive system usually takes place, for example the user's workplace.\n",
    "description-german": "Ein Interview das dort stattfindet wo die Interaktion des Benutzers mit dem interaktiven System üblicherweise stattfindet, z.B. am Arbeitsplatz des Benutzers.\n",
    "term-english": "Contextual interview",
    "term-german": "Kontextuelles Interview"
  },
  {
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "A dialogue is suitable for learning when it supports and guides the user in learning to use the interactive system.\n",
    "description-german": "Die Eigenschaft eines Dialogs die Benutzer beim Erlernen der Nutzung des interaktiven Systems zu unterstützen und anzuleiten.\n",
    "term-english": "Suitability for learning",
    "term-german": "Lernförderlichkeit"
  },
  {
    "categories": [
      "Test",
      "System"
    ],
    "description-english": "A low-cost, simple illustration of a design or concept used to gather user feedback at the very early stages of design\n",
    "description-german": "Eine einfache und preiswerte Veranschaulichung eines Designs oder eines Begriffs. Wird benutzt, um Benutzer-Feedback in frühen Phasen der Entwicklung einzuholen\n",
    "term-english": "Low-fidelity prototype",
    "term-german": "Low-fidelity-Prototyp"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "A requirement for an interactive system based on marketing policy aimed at maximizing business opportunities, purchase and use.\n",
    "description-german": "Eine Anforderung an ein interaktives System, die aus der Absatzpolitik des Anbieters abgeleitet ist und darauf abzielt, Geschäftschancen, Verkäufe und die Nutzung des interaktiven Systems zu maximieren.\n",
    "term-english": "Market requirement",
    "term-german": "Marktanforderung"
  },
  {
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "A principle for a successful interview: The interviewer treats the user as the Master while the interviewer is the Apprentice. The interviewer asks because they sincerely want to learn – not to demonstrate their knowledge",
    "description-german": "Ein Verhaltensprinzip für ein erfolgreiches Interview:  Der Interviewer behandelt den Benutzer als den Meister während der Interviewer selbst der Schüler ist. Der Interviewer demonstriert nicht sein Wissen, sondern stellt seine Fragen mit dem Ziel etwas zu lernen.",
    "term-english": "Master-apprentice model",
    "term-german": "Meister-Schüler-Modell"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung"
    ],
    "description-english": "An approach to design that aims to make interactive systems more usable by focusing on the use of the interactive system and applying human factors, ergonomics and usability knowledge and techniques.\n",
    "description-german": "Herangehensweise bei der Gestaltung und Entwicklung von interaktiven Systemen, die darauf abzielt, diese gebrauchtauglicher zu machen indem sie sich auf die Verwendung des interaktiven Systems konzentriert und Kenntnisse und Techniken aus den Bereichen der Arbeitswissenschaft, Ergonomie und der Gebrauchstauglichkeit anwendet.\n",
    "term-english": "Human-centred design",
    "term-german": "Menschzentrierte Gestaltung"
  },
  {
    "categories": [
      "Planung"
    ],
    "description-english": "The perception people have of themselves, others, the environment, and the things with which they interact. \n",
    "description-german": "Die Vorstellung, die Menschen von sich, anderen, der Umgebung und den Dingen haben, mit denen sie interagieren. \n",
    "term-english": "Mental model",
    "term-german": "Mentales Modell"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "The activity carried out by a moderator in a usability test or focus group.",
    "description-german": "Die durch einen Moderator während eines Usability-Tests oder einer Fokusgruppe ausgeübte Tätigkeit.",
    "term-english": "Moderation",
    "term-german": "Moderation"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A neutral person who conducts a usability test session or a focus group session.\n",
    "description-german": "Eine neutrale Person die eine Usability-Testsitzung oder eine Fokusgruppe leitet.\n",
    "term-english": "Moderator",
    "term-german": "Moderator"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "The logical organization of the units of displayed information that comprise the user interface.\n",
    "description-german": "Die logische Organisation der angezeigten Informationseinheiten der Benutzungsschnittstelle.\n",
    "term-english": "Navigation structure",
    "term-german": "Navigationsstruktur"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A question in an interview that has no built-in assumptions, and no frame that excludes anything or directs the reply in a certain direction. \n",
    "description-german": "Eine Frage in einem Interview, die keine impliziten Annahmen beinhaltet und auch keinen Ansatz bietet, einen Aspekt auszuschliessen oder die Antwort in eine bestimmte Richtung zu lenken. \n",
    "term-english": "Neutral question",
    "term-german": "Neutrale Frage"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "Requirement for use that provides the basis for design and evaluation of an interactive system to meet identified user needs.\n",
    "description-german": "Anforderung an die Nutzung, die die Basis für die Gestaltung und Evaluierung eines interaktiven Systems in Hinblick auf identifizierte Erfordernisse bildet. \n",
    "term-english": "User requirement",
    "term-german": "Nutzungsanforderung"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "Users, tasks, resources, and the physical and social environments in which an interactive system is used \n",
    "description-german": "Benutzer, Aufgaben, Ressourcen sowie die physische und soziale Umgebung in der das interaktive System genutzt wird.\n",
    "term-english": "Context of use",
    "term-german": "Nutzungskontext"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "The key units of information, or data, with which users interact in order to carry out their tasks. \n",
    "description-german": "Die wichtigsten Informationseinheiten oder Daten mit denen Benutzer interagieren, um ihre Aufgaben durchzuführen.\n",
    "term-english": "Task object",
    "term-german": "Nutzungsobjekt"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A question in an interview that does not give any indication of the expected format or content of the answer.\n",
    "description-german": "Eine Frage in einem Interview, die keine Einschränkung der Antwortmöglichkeiten nach sich zieht\n",
    "term-english": "Open question",
    "term-german": "Offene Frage"
  },
  {
    "categories": [
      "System",
      "Gestaltung"
    ],
    "description-english": "Assistance delivered through computer software that can be topic-oriented, procedural or reference information. \n",
    "description-german": "Unterstützung die durch ein Computerprogramm bereitgestellt wird. xxx kann themenorientiert, verfahrensorientiert oder ein Hinweis sein.\n",
    "term-english": "Online help",
    "term-german": "Onlinehilfe"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung",
      "Planung"
    ],
    "description-english": "An organizational rule that users have to follow when conducting their tasks.\n",
    "description-german": "Eine organisatorische Regel die Benutzer befolgen müssen während sie ihre Aufgaben lösen.\n",
    "term-english": "Organizational requirement",
    "term-german": "Organisatorische Anforderung"
  },
  {
    "categories": [
      "Rollen",
      "Planung"
    ],
    "description-english": "A description of a user and what he or she intends to do when using an interactive system. \n",
    "description-german": "Eine Beschreibung eines Benutzers und was dieser bei der Benutzung eines interaktiven Systems beabsichtigt. \n",
    "term-english": "Persona",
    "term-german": "Persona"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "An activity in a usability test session where the usability test participant answers questions about his/her experience and general impression of the usability of the interactive system. \n",
    "description-german": "Eine Aktivität in einem Usability-Test, bei der ein Usability-Testteilnehmer Fragen bezüglich seines allgemeinen Eindrucks hinsichtlich der Usability des interaktiven Systems beantwortet. \n",
    "term-english": "Post-session interview",
    "term-german": "Post-Session Interview"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "An activity in a usability test session where the usability test participant answers questions about his/her background and previous experience with the interactive system or related interactive systems. \n",
    "description-german": "Eine Tätigkeit bei einem Usability-Test, bei der Usability-Testteilnehmer Fragen bezüglich ihres Hintergrundes und vorheriger Erfahrung mit dem interaktiven System oder ähnlichen interaktiven Systemen beantworten. \n",
    "term-english": "Pre-session interview",
    "term-german": "Pre-Session Interview"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who interacts with an interactive system to achieve goals supported by the system.",
    "description-german": "Eine Person, die mit einem interaktiven System interagiert, um Ziele zu erreichen, die durch das System unterstützt werden.",
    "term-english": "Primary user",
    "term-german": "Primärer Benutzer"
  },
  {
    "categories": [
      "Rollen",
      "Test"
    ],
    "description-english": "A usability specialist who makes notes of usability findings during a usability test session, focus group or interview. \n",
    "description-german": "Ein Usabilityspezialist, der Notizen über Usability-Befunde während einer Usability-Testsitzung, Fokusgruppe oder Interview notiert. \n",
    "term-english": "Note-taker",
    "term-german": "Protokollant"
  },
  {
    "categories": [
      "Test",
      "System"
    ],
    "description-english": "A representation of all or part of an interactive system that, although limited in some way, can be used for analysis, design and evaluation.\n",
    "description-german": "Eine Repräsentation von Teilen oder des gesamten interaktiven Systems, die in einem bestimmten Maß für Analyse, Design und Evaluierung benutzt werden kann.\n",
    "term-english": "Prototype",
    "term-german": "Prototyp"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "A statement of what users must be able to locate, recognize, understand, select or input as part of conducting a task with the interactive system. \n",
    "description-german": "Eine Beschreibung, was Benutzer während der Durchführung einer Aufgabe mit dem interaktiven System finden, erkennen, verstehen, auswählen oder eingeben müssen.\n",
    "term-english": "Qualitative user requirement",
    "term-german": "Qualitative Nutzungsanforderung"
  },
  {
    "categories": [
      "Planung",
      "Anforderungen",
      "Evaluierung"
    ],
    "description-english": "The degree to which the interactive system fulfils requirements.\n",
    "description-german": "Grad der Erfüllung von Anforderungen durch ein interaktives System.\n",
    "term-english": "Quality",
    "term-german": "Qualität"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "Required level of usability to meet identified user needs expressed in terms of measures of effectiveness, efficiency and satisfaction in a specified context of use.\n",
    "description-german": "Benötigtes Maß an Usability um identifizierten Erfordernissen zu genügen im Sinne der Effektivität, Effizienz und Zufriedenstellung in einem festgelegten Nutzungskontext.\n",
    "term-english": "Quantitative user requirement",
    "term-german": "Quantitative Nutzungsanforderung"
  },
  {
    "categories": [
      "Planung",
      "Test"
    ],
    "description-english": "A process for selecting candidates that have the required qualifications to participate in a human-centred activity such as a focus group, contextual interview, or usability test.\n",
    "description-german": "Akquise von Benutzern, die die erforderlichen Qualifikationen haben, an einer menschzentrierten Aktivität wie z.B. einem Usability-Test, einem kontextuellen Interview oder einer Fokusgruppe teilzunehmen.\n",
    "term-english": "Recruiting",
    "term-german": "Rekrutierung"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A series of questions for prospective participants to identify whether they represent the intended users and therefore qualify to participate in a human-centred activity, for example a usability test or a focus group.\n",
    "description-german": "Eine Reihe von Fragen für potenzielle Teilnehmer hinsichtlich ihrer Qualifikationen zur Teilnahme an einer menschzentrierten Aktivität wie z.B. einem Usability-Test oder einer Fokusgruppe.\n",
    "term-english": "Recruitment screener",
    "term-german": "Rekrutierungsfragebogen"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A usability test where the usability test participant and the moderator are in different physical locations. \n",
    "description-german": "Ein Usability-Test bei dem sich der Usability-Testteilnehmer und der Moderator an unterschiedlichen Orten befinden \n(„Remote“ bedeutet hier „entfernt liegend“). \n",
    "term-english": "Remote usability test",
    "term-german": "Remote Usability-Test"
  },
  {
    "categories": [
      "System"
    ],
    "description-english": "All means required to use an interactive system.\n",
    "description-german": "Alle Mittel die zur Nutzung eines interaktiven Systems notwendig sind. \n",
    "term-english": "Resources",
    "term-german": "Ressourcen"
  },
  {
    "categories": [
      "Anforderungen",
      "Rollen"
    ],
    "description-english": "A duty or function that a person carries out within an organization.\n",
    "description-german": "Eine Funktion die eine Person innerhalb der Struktur einer Organisation inne hat.\n",
    "term-english": "Role",
    "term-german": "Rolle"
  },
  {
    "categories": [
      "Rollen",
      "Planung"
    ],
    "description-english": "A person who interacts with an interactive system to support the use of the system or maintain the system.\n",
    "description-german": "Eine Person, die mit einem interaktiven System interagiert, um die Nutzung des Systems zu unterstützen oder das System zu warten.\n",
    "term-english": "Secondary user",
    "term-german": "Sekundärer Benutzer"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "The property of a dialogue to, at any time, make it obvious to the users which dialogue they are in, where they are within the dialogue, which actions can be taken, and how they can be performed.\n",
    "description-german": "Die Eigenschaft eines Dialogs zu jeder Zeit dem Benutzer offensichtlich zu machen, in welchem Dialog, an welcher Stelle im Dialog er sich befindet, welche Handlungen unternommen werden können und wie diese ausgeführt werden können.\n",
    "term-english": "Self-descriptiveness",
    "term-german": "Selbstbeschreibungsfähigkeit"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "The ability of a user to initiate and control the direction and pace of the interaction until the point at which the goal has been met.\n",
    "description-german": "Der Benutzer ist in der Lage einen Dialogablauf zu starten sowie seine Richtung und Geschwindigkeit zu beeinflussen, bis das Ziel erreicht ist.\n",
    "term-english": "Controllability",
    "term-german": "Steuerbarkeit"
  },
  {
    "categories": [
      "Planung"
    ],
    "description-english": "A sequence of visual frames illustrating the interplay between a user and an envisioned interactive system. \n",
    "description-german": "Eine Folge visueller Bildschirminhalte, die das Zusammenspiel zwischen einem Benutzer und einem vorgestellten interaktiven System darstellt. \n",
    "term-english": "Storyboard",
    "term-german": "Storyboard"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "A collection of user interface guidelines used to ensure consistency in the appearance and behaviour of the user interface of the interactive systems produced by an organization \n",
    "description-german": "Eine Sammlung von Gestaltungsregeln die verwendet wird, um die grundsätzliche Erscheinung der Benutzungsschnittstelle auf jeglicher Software einer Organisation festzulegen.\n",
    "term-english": "Styleguide",
    "term-german": "Styleguide"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A question in an interview that signals a preference for certain possibilities, or attempts to direct the reply in a certain direction. \n",
    "description-german": "Eine Frage in einem Interview, die eine Präferenz für bestimmte Antwortmöglichkeiten vorgibt oder versucht, die Antwort in eine bestimmte Richtung zu lenken. \n",
    "term-english": "Leading question",
    "term-german": "Suggestionsfrage"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "A type of usability evaluation designed and used to gather conclusions about the merit or worth of an interactive system, especially when a substantial part of it has completed design.\n",
    "description-german": "Eine Usabilityevaluierung, die darauf ausgerichtet ist, Schlussfolgerungen zur Qualität eines interaktiven Systems aus Sicht der Usability zu ziehen, insbesondere wenn ein wesentlicher Teil der Entwicklung fertig ist.  \n",
    "term-english": "Summative usability evaluation",
    "term-german": "Summative Usability-Evaluierung"
  },
  {
    "categories": [
      "Prinzipien",
      "Implementierung"
    ],
    "description-english": "Explicit information about an event or a condition from an interactive system to a user.\n",
    "description-german": "Explizite Information über ein Ereignis oder einen Zustand vom interaktiven System an den Benutzer. \n",
    "term-english": "System-initiated guidance",
    "term-german": "Systeminitiierte Benutzerführung"
  },
  {
    "categories": [
      "Planung",
      "System"
    ],
    "description-english": "The physical, social and technical conditions in which a user interacts with an interactive system.\n",
    "description-german": "Die Gesamtheit der gegebenen Umstände oder Bedingungen, in denen ein Benutzer arbeitet. Diese umfassen die physische, soziale und technische xxx.\n",
    "term-english": "Environment",
    "term-german": "Umgebung"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "A usability test where usability test participants solve usability test tasks without being observed. \n",
    "description-german": "Ein Usability-Test bei dem Usability-Testteilnehmer Usability-Testaufgaben lösen ohne dabei beobachtet zu werden. \n",
    "term-english": "Unattended usability test",
    "term-german": "Unbeaufsichtigter Usability-Test"
  },
  {
    "categories": [
      "Test",
      "Anforderungen",
      "Prinzipien"
    ],
    "description-english": "Extent to which an interactive system can be used by specified users to achieve specified goals with effectiveness, efficiency and satisfaction in a specified context of use.\n",
    "description-german": "Ausmaß, in dem ein interaktives System durch bestimmte Benutzer in einem bestimmten Nutzungskontext genutzt werden kann, um festgelegte Ziele effektiv, effizient und zufriedenstellend zu erreichen.\n",
    "term-english": "Usability",
    "term-german": "Usability"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who manages a human-centred design process.\n",
    "description-german": "Eine Person die in einer Querschnittsfunktion verantwortlich einen menschzentrierten Gestaltungsprozess betreut. \n",
    "term-english": "Usability engineer",
    "term-german": "Usability Engineer"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A professional who has one or more of the following process roles: \n1.\tUsability engineer, \n2.\tUser requirements engineer, \n3.\tUsability tester,\n4.\tInformation architect,\n5.\tInteraction designer,\n6.\tUser interface designer.",
    "description-german": "Eine Person die eine oder mehrere der folgenden Rollen hat: \n1.\tUsability Engineer, \n2.\tUser Requirements Engineer, \n3.\tUsability-Tester,\n4.\tInformationsarchitect,\n5.\tInteraktionsdesigner,\n6.\tUser Interface Designer.",
    "term-english": "Usability professional",
    "term-german": "Usability Professional"
  },
  {
    "categories": [
      "Test",
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "A process through which information about the usability of an interactive system is gathered in order to improve the interactive system (known as formative xxx) or to assess the merit or worth of an interactive system (known as summative xxx). \n",
    "description-german": "Ein Prozess der Informationen über die Usability eines interaktiven Systems sammelt um das interaktive System zu verbessern (formative xxx) oder um das interaktive System zu bewerten (summative xxx). \n",
    "term-english": "Usability evaluation",
    "term-german": "Usability-Evaluierung"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "Two or more rooms that are specially equipped for usability testing or focus groups. \n",
    "description-german": "Zwei oder mehrere Räume, die speziell für die Durchführung von Usabiltytests oder Fokusgruppen ausgestattet sind. \n",
    "term-english": "Usability lab",
    "term-german": "Usability-Labor"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "A difficulty in using the user interface design that affects the ability of the user to achieve their goals effectively, or efficiently, or with satisfaction. \n",
    "description-german": "Ein Problem in der Benutzung der Benutzungsschnittstelle, das sich auf die Zufriedenstellung des Benutzers sowie die Effektivität und Effizienz des interaktiven Systems auswirkt. \n",
    "term-english": "Usability problem",
    "term-german": "Usability-Problem"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A usability evaluation that involves representative users performing specific tasks with the interactive system to enable identification of usability problems or the measurement of effectiveness, efficiency, and user satisfaction.\n",
    "description-german": "Eine Usability-Evaluierung bei der repräsentative Benutzer bestimmte Aufgaben mit dem interaktiven System ausführen, um Usability-Probleme oder die Messwerte für Effektivität, Effizienz und Zufriedenstellung zu erfassen. \n",
    "term-english": "Usability test",
    "term-german": "Usability-Test"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "A description of a task that a moderator asks a usability test participant to carry out during a usability test. ",
    "description-german": "Eine Beschreibung einer typischen Aufgabe, die ein Moderator einem Usability-Testteilnehmer während eines Usability-Tests stellt. ",
    "term-english": "Usability test task",
    "term-german": "Usability-Testaufgabe"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A document that describes the results of a usability test. \n",
    "description-german": "Ein Dokument, das die Ergebnisse eines Usability-Tests beschreibt. \n",
    "term-english": "Usability test report",
    "term-german": "Usability-Testbericht"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who evaluates user interfaces in various stages of realization. \n",
    "description-german": "Eine Person die Benutzungsschnittstellen in verschiedenen Stadien der Realisierung evaluiert. \n",
    "term-english": "Usability tester",
    "term-german": "Usability-Tester"
  },
  {
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "description-english": "A brief description of the purpose and extent of a usability test. \n",
    "description-german": "Eine kurze Beschreibung des Zwecks und Umfangs eines Usability-Tests. \n",
    "term-english": "Usability test plan",
    "term-german": "Usability-Testplan"
  },
  {
    "categories": [
      "Gestaltung",
      "Test"
    ],
    "description-english": "A part of a usability test where one usability test participant carries out representative usability test tasks using the interactive system or a prototype of the interactive system.\n",
    "description-german": "Der Teil eines Usability-Tests, bei dem ein bestimmter Usability-Testteilnehmer repräsentative Usability-Testaufgaben unter Benutzung des interaktiven Systems oder des Prototypen eines interaktiven Systems löst.\n",
    "term-english": "Usability test session",
    "term-german": "Usability-Testsitzung"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A checklist used by a moderator in a usability test to keep track of briefing and pre-session interview questions, usability test tasks, and post-session interview questions.",
    "description-german": "Eine von einem Moderator in einem Usability-Test verwendete Checkliste, um den Überblick über die Fragen des Briefings und des Pre-Session Interviews, die Usability-Testaufgaben und die Fragen des Post-Session Interviews zu behalten.",
    "term-english": "Usability test script",
    "term-german": "Usability-Testskript"
  },
  {
    "categories": [
      "Rollen",
      "Test"
    ],
    "description-english": "A representative user who solves typical tasks in a usability test.",
    "description-german": "Repräsentativer Benutzer, der typische Aufgaben in einem Usability-Test löst.",
    "term-english": "Usability test participant",
    "term-german": "Usability-Testteilnehmer"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who creates interactive prototypes and implements the dialogue and user experience based on the design created by the interaction designer and the scenarios created by the user requirements engineer. The xxx also creates interactive prototypes.\n",
    "description-german": "Eine Person die den Dialog und das Benutzererlebnis basierend auf dem Design des  Interaktions­designers und den Nutzungsszenarios des User Requirements Engineers implementiert. Der xxx erzeugt ausserdem interaktive Prototypen.\n",
    "term-english": "User interface designer",
    "term-german": "User Interface Designer"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who identifies and describes the actual or intended context of use of users, and derives the user requirements and related organizational requirements, which need to be realized for a specific project. \n",
    "description-german": "Eine Person die den tatsächlichen oder geplanten Nutzungskontext von Benutzern identifiziert und beschreibt. Daraus leitet der xxx die Nutzungsanforderungen und damit verbundene organisatorische Anforderungen ab, die für ein bestimmtes Projekt umgesetzt werden müssen. \n",
    "term-english": "User requirements engineer",
    "term-german": "User Requirements Engineer"
  },
  {
    "categories": [
      "Planung"
    ],
    "description-english": "A form of low-fidelity prototype consisting of schematic diagrams typically comprised of lines, rectangular boxes and text that represent the intended interaction design and navigational flow.\n",
    "description-german": "Eine Form des Low-fidelity-Prototyps bestehend aus schematischen Diagrammen, typischerweise dargestellt mit Linien, rechteckigen Kästen und Text der das Interaktionsdesign und den Navigationsfluss repräsentiert.\n",
    "term-english": "Wireframe",
    "term-german": "Wireframe"
  },
  {
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "Freedom from discomfort, and positive attitudes towards the use of the product\n",
    "description-german": "Freiheit von Beeinträchtigung und positive Grundeinstellung zur Nutzung des Produkts\n",
    "term-english": "Satisfaction",
    "term-german": "Zufriedenstellung"
  }
]