[
  {
    "categories": [
      "Prinzipien"
    ],
    "description-english": "An aspect of an object that makes it obvious how the object could be used.<br />Note: <br />1.\tAffordances and <a href='#/glossary?term=Self-descriptiveness'>self-descriptiveness</a> are means to make an <a href='#/glossary?term=Interactive system'>interactive system</a> <a href='#/glossary?term=Intuitive'>intuitive</a>.<br />Examples of affordances:<br />1.\tA handle on a tea pot or tea cup provides an obvious affordance for holding. <br />2.\tA button on a web page provides an affordance for clicking.<br />3.\tA company logo in the upper left corner of a web page provides limited affordance for clicking.",
    "description-german": "Aspekte eines Objektes, die verdeutlichen, wie das Objekt benutzt werden kann.<br />Anmerkung:<br />1.\tAffordances und <a href='#/glossary?term=Selbstbeschreibungsfähigkeit'>Selbstbeschreibungsfähigkeit</a> sind Mittel, um interaktive Systeme <a href='#/glossary?term=Intuitiv'>intuitiv</a> bedienbar zu machen..<br />Beispiele für Affordances:<br />1.\tEin Henkel einer Teetasse stellt eine offensichtliche Handlungsanweisung dar, sie zu halten. <br />2.\tEin Button auf einer Webseite bietet die Handlungsanweisung, auf ihn zu klicken.<br />3.\tEin Firmenemblem in der oberen linken Ecke einer Webseite bietet eingeschränkte Handlungsanweisung, darauf zu klicken.",
    "term-english": "Affordance",
    "term-german": "Affordance"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung",
      "Anforderungen"
    ],
    "description-english": "A condition or capability that must be met or possessed by an <a href='#/glossary?term=Interactive system'>interactive system</a> to satisfy an agreement, standard, specification or other formally imposed documents<br />Notes: <br />1.\tA requirement should have a determinable condition that makes it possible to validate it.<br />2.\tThis glossary defines the following types of requirements:<br />a.\t<a href='#/glossary?term=Stakeholder'>Stakeholder</a> requirement;<br />b.\t<a href='#/glossary?term=Market requirement'>Market requirement</a>;<br />c.\t<a href='#/glossary?term=Organizational requirement'>Organizational requirement</a>;<br />d.\t<a href='#/glossary?term=User'>User</a> requirement.<br />3.\tThis glossary further distinguishes between<br />Qualitative <a href='#/glossary?term=User requirement'>user requirement</a>, and <br /><a href='#/glossary?term=Quantitative user requirement'>Quantitative user requirement</a>.",
    "description-german": "Eine Bedingung oder Fähigkeit, die ein  <a href='#/glossary?term=Interaktives System'>interaktives System</a> erfüllen oder besitzen muss, um einer Vereinbarung, einem Standard, einer Spezifikation oder anderen formal zugrunde gelegten Dokumenten zu genügen.<br />Anmerkungen:<br />1.\tEine Anforderung sollte eine festgelegte Bedingung haben, mit der sie validiert werden kann.<br />2.\tDieses Glossar definiert die folgenden Arten von Anforderungen:<br />a.\t<a href='#/glossary?term=Interessenvertreteranforderung'>Interessenvertreteranforderung</a>,<br />b.\t<a href='#/glossary?term=Marktanforderung'>Marktanforderung</a>,<br />c.\t<a href='#/glossary?term=Organisatorische Anforderung'>Organisatorische Anforderung</a>,<br />d.\t<a href='#/glossary?term=Nutzungsanforderung'>Nutzungsanforderung</a>.<br />3.\tDieses Glossar unterscheidet außerdem zwischen <br />Qualitative Nutzungsanforderung, und Quantitative Nutzungsanforderung.",
    "term-english": "Requirement",
    "term-german": "Anforderung"
  },
  {
    "categories": [
      "Anforderungen",
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "Activities required to achieve a <a href='#/glossary?term=Goal'>goal</a> <br />Notes:<br />1.\tMost tasks can be subdivided into subtasks –that is, activities. <br />2.\tMost subtasks lead to choices or inputs of the <a href='#/glossary?term=User'>user</a> when using the <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />3.\tSome subtasks can be subdivided into smaller subtasks.<br />Examples of tasks: <br />1.\tRenting a car is a task. <br />2.\tCancelling a reservation is a task. <br />3.\tRegistering on a car rental website is a subtask. It is not a user goal but an annoyance from the user's point of view. Users would never feel that they had achieved a goal after registering.<br />4.\t\"Logging in\" is a subtask. It is not a user goal but an annoyance from the user's point of view.<br />5.\tEntering the user name and pressing the Tab key is one of several subtasks required to complete the subtask \"logging in\". ",
    "description-german": "Aktivität die erforderlich ist, um ein <a href='#/glossary?term=Ziel'>Ziel</a> zu erreichen.<br />Anmerkungen:<br />1.\tViele Aufgaben können in Teilaufgaben unterteilt werden.<br />2.\tViele Teilaufgaben führen zu Auswahlmöglichkeiten oder Eingaben des <a href='#/glossary?term=Benutzer'>Benutzer</a>s während der Nutzung des interaktiven Systems. <br />3.\tEinige Teilaufgaben können in kleinere Teilaufgaben aufgeteilt werden.<br />Beispiele für Aufgaben: <br />1.\t„Ein Auto mieten“ ist eine Aufgabe. <br />2.\t„Eine Reservierung stornieren“ ist eine Aufgabe. <br />3.\t„Sich auf der Webseite einer Autoverleihfirma registrieren“ ist eine Teilaufgabe. Registrierung ist vom Gesichtspunkt des Benutzers kein Ziel sondern ein Ärgernis.<br />4.\t„Sich einloggen“ ist eine Teilaufgabe. Einloggen ist vom Gesichtspunkt des Benutzers kein Ziel sondern ein Ärgernis.<br />5.\tDie Eingabe des Benutzernamens und das Drücken der Tabulatortaste ist eine von vielen Teilaufgaben die erforderlich sind, um die Teilaufgabe ”Log-in” abzuschließen.",
    "term-english": "Task",
    "term-german": "Aufgabe"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "The property of an <a href='#/glossary?term=Interactive system'>interactive system</a> to support the <a href='#/glossary?term=User'>user</a> in the completion of the <a href='#/glossary?term=Task'>task</a>, i.e. to base the functionality and the <a href='#/glossary?term=Dialogue'>dialogue</a> on the task characteristics (rather than the technology chosen to perform the task).<br />Notes: <br />1.\tRecommendations for observing the dialogue principle:<br />a.\tThe dialogue should present the user with information related to the successful completion of the task.<br />b.\tThe dialogue should avoid presenting the user with information not needed for the successful completion of relevant tasks.<br />c.\tThe format of input and output should be appropriate to the task. If typical input values are required for a task, these values should be available to the user automatically as defaults.<br />d.\tThe steps required by the dialogue should be appropriate to the completion of the task, i.e. necessary steps should be included and unnecessary steps should be avoided.<br />2.\tSuitability for the task is a dialogue principle.",
    "description-german": "Die Eigenschaft eines <a href='#/glossary?term=Interaktives System'>interaktives System</a>s den <a href='#/glossary?term=Benutzer'>Benutzer</a> zu unterstützen, seine <a href='#/glossary?term=Aufgabe'>Aufgabe</a> zu erledigen, d. h., die Funktionalität und <a href='#/glossary?term=Dialog'>Dialog</a> an die charakteristischen Eigenschaften der Aufgabe anzupassen, anstatt an die zur Aufgabenerledigung eingesetzten Technologie.<br />Anmerkung:<br />1.\tEmpfehlungen zu Befolgung des Dialogprinzips:<br />a.\tDer Dialog sollte dem Benutzer solche Informationen anzeigen, die im Zusammenhang mit der erfolgreichen Erledigung der Aufgabe stehen.<br />b.\tDer Dialog sollte dem Benutzer keine Informationen anzeigen, die nicht für die erfolgreiche Erledigung relevanter Aufgaben benötigt werden.<br />c.\tDie Form der Eingabe und Ausgabe sollte der Aufgabe angepasst sein. Wenn für eine Aufgabe ganz bestimmte Eingabewerte typisch sind, sollten diese Werte dem Benutzer automatisch als voreingestellte Werte verfügbar sein.<br />d.\tDie vom interaktiven System verlangten Dialogschritte sollten zum Arbeitsablauf passen, d. h. notwendige Dialogschritte sollten enthalten sein und unnötige Dialogschritte sollten vermieden werden.<br />2.\tAufgaben­angemessenheit ist ein Dialogprinzip.",
    "term-english": "Suitability for the task",
    "term-german": "Aufgabenangemessenheit"
  },
  {
    "categories": [
      "Implementierung"
    ],
    "description-english": "A description of the sub<a href='#/glossary?term=Task'>task</a>s that have to be carried out in order to reach the <a href='#/glossary?term=User'>user</a>’s <a href='#/glossary?term=Goal'>goal</a>s.<br />Note:<br />1.\tA task model describes the logic of the task itself, while a scenario describes the completion of one or more tasks by a <a href='#/glossary?term=Persona'>persona</a>.",
    "description-german": "Eine Beschreibung der Teil<a href='#/glossary?term=Aufgabe'>aufgabe</a>n die erledigt werden müssen, um die <a href='#/glossary?term=Ziel'>Ziel</a>e des <a href='#/glossary?term=Benutzer'>Benutzer</a>s zu erreichen.<br />Anmerkung:<br />1.\tEin Aufgabenmodell beschreibt die Logik einer Aufgabe an sich, während ein <a href='#/glossary?term=Szenario'>Szenario</a> die Erledigung einer oder mehrerer Aufgaben durch eine <a href='#/glossary?term=Persona'>Persona</a> beschreibt.",
    "term-english": "Task model",
    "term-german": "Aufgabenmodell"
  },
  {
    "categories": [
      "Prinzipien"
    ],
    "description-english": "The attributes and characteristics of an <a href='#/glossary?term=Interactive system'>interactive system</a> that allow people with limited vision, hearing, dexterity, cognition or physical mobility to interact effectively and efficiently with the interactive system.<br />Notes: <br />1.\tStandards and <a href='#/glossary?term=Guideline'>guideline</a>s for accessibility are available, and standards may be legally enforced in some markets. <br />2.\tAccessibility aids, such as screen readers, may be added to an interactive system to allow <a href='#/glossary?term=User'>user</a>s with disabilities to use those systems.",
    "description-german": "Die Attribute und Charakteristiken eines interaktiven Systems die Menschen mit eingeschränkter Sicht, eingeschränktem Hören, eingeschränkter Geschicklichkeit, eingeschränkter Kognition oder eingeschränkter physischer Mobilität ermöglichen sollen effektiv und effizient mit dem interaktiven System zu interagieren.<br />Anmerkungen:<br />1.\tStandards und <a href='#/glossary?term=Richtlinie'>Richtlinie</a>n für Barrierefreiheit sind verfügbar und in manchen Unternehmen oder Ländern gesetzlich zu erfüllen<br />2.\tHilfsmittel zur Schaffung von Barrierefreiheit wie z.B. Screenreader können einem System hinzugefügt werden, um Menschen mit Behinderungen zu ermöglichen, das System zu nutzen",
    "term-english": "Accessibility",
    "term-german": "Barrierefreiheit"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> finding",
    "description-german": "Siehe <a href='#/glossary?term=Usability-Befund'>Usability-Befund</a>",
    "term-english": "Finding",
    "term-german": "Befund"
  },
  {
    "categories": [
      "Rollen",
      "Anforderungen"
    ],
    "description-english": "Person who interacts with an <a href='#/glossary?term=Interactive system'>interactive system</a>, or who uses the output of the system.<br />Notes:<br />1.\t\"User\" is subdivided into <br />a.\t<a href='#/glossary?term=Direct user'>Direct user</a>: Interacts with the interactive system.<br />b.\t<a href='#/glossary?term=Indirect user'>Indirect user</a>: Uses the output of the interactive system.<br />c.\t<a href='#/glossary?term=Primary user'>Primary user</a>: Interacts with the interactive system to achieve <a href='#/glossary?term=Goal'>goal</a>s supported by the interactive system.<br />d.\t<a href='#/glossary?term=Secondary user'>Secondary user</a>: Interacts with the interactive system to provide support, etc.<br />2.\t<a href='#/glossary?term=Stakeholder'>Stakeholder</a>s may or may not be users. Stakeholders are not considered to be users if they are affected by an interactive system but neither interact with the interactive system nor use the output of the interactive system.<br />Examples of stakeholders who are not users:<br />1.\tManagers of users.<br />2.\tPeople affected by noise produced by the person using the interactive system.<br />3.\tMarketers affected by the impact of the output on the brand of the interactive system.",
    "description-german": "Person, die mit einem interaktiven System arbeitet oder Daten die vom System erzeugt werden benutzt.<br />Anmerkungen:<br />1.\t„Benutzer“ werden unterteilt in<br />a.\t<a href='#/glossary?term=Direkter Benutzer'>Direkter Benutzer</a>: Interagiert mit dem interaktiven System.<br />b.\t<a href='#/glossary?term=Indirekter Benutzer'>Indirekter Benutzer</a>: Benutzt Daten die vom interaktiven System erzeugt werden.<br />c.\t<a href='#/glossary?term=Primärer Benutzer'>Primärer Benutzer</a>: Interagiert mit dem interaktiven System um <a href='#/glossary?term=Ziel'>Ziel</a>e die vom interaktiven System unterstützt werden zu erreichen.<br />d.\t<a href='#/glossary?term=Sekundärer Benutzer'>Sekundärer Benutzer</a>: Interagiert mit dem interaktiven System um Unterstützung etc. zu geben.<br />2.\t<a href='#/glossary?term=Interessenvertreter'>Interessenvertreter</a> können Benutzer sein oder auch nicht. Sie werden nicht als Benutzer betrachtet wenn sie zwar durch das interaktive System beeinflusst werden, jedoch weder mit dem interaktiven System selbst interagieren noch das mit Hilfe des interaktiven Systems erzielte Arbeitsergebnis nutzen.<br />Beispiele von Interessenvertretern die keine Benutzer sind:<br />1.\tManager von Benutzern.<br />2.\tPersonen die von Lärm der von der Person die das interaktive System benutzt erzeugt wird betroffen sind.<br />3.\tMarketingfachleute die von der Auswirkung der Ergebnisse auf die Markenbezeichnung betroffen sind.",
    "term-english": "User",
    "term-german": "Benutzer"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "An <a href='#/glossary?term=Evaluation'>evaluation</a> where <a href='#/glossary?term=User'>user</a>s are asked to report subjective data into a <a href='#/glossary?term=Questionnaire'>questionnaire</a> based on their experience in using an <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Notes: <br />1.\tUser surveys can be used to evaluate users' <a href='#/glossary?term=Satisfaction'>satisfaction</a> with an interactive system and to gather <a href='#/glossary?term=Context of use'>context of use</a> information.<br />2.\tWhen done correctly, surveys can produce a higher degree of certainty in evaluation results than any qualitative research method.",
    "description-german": "Eine <a href='#/glossary?term=Evaluierung'>Evaluierung</a> bei der <a href='#/glossary?term=Benutzer'>Benutzer</a> subjektive Daten in einem <a href='#/glossary?term=Fragebogen'>Fragebogen</a> angeben sollen, basierend auf ihren Erfahrungen bei der Benutzung eines interaktiven Systems. <br />Anmerkung:<br />1\tBenutzerbefragungen können verwendet werden, um die <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a> mit einem interaktiven System zu evaluieren und um Informationen über den <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> zu sammeln.<br />2. \tBei korrekter Ausführung können Benutzerbefragungen einen höheren Grad an Sicherheit bei Evaluierungsergebnissen er<a href='#/glossary?term=Ziel'>ziel</a>en als jede andere qualitative Untersuchungsmethode.",
    "term-english": "User survey",
    "term-german": "Benutzerbefragung"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung",
      "System"
    ],
    "description-english": "Written or other information for <a href='#/glossary?term=User'>user</a>s about an <a href='#/glossary?term=Interactive system'>interactive system</a>, how it works, and how to use it.<br />Note:<br />1.\tUser documentation is a form of <a href='#/glossary?term=User assistance'>user assistance</a>.",
    "description-german": "Für <a href='#/glossary?term=Benutzer'>Benutzer</a> geschriebene oder andere Anleitungen zu dem interaktiven System, wie es funktioniert, und wie man es bedient.<br />Anmerkung:<br />1.\tBenutzer­dokumentation ist eine Form der <a href='#/glossary?term=Benutzerunterstützung'>Benutzerunterstützung</a>.",
    "term-english": "User documentation",
    "term-german": "Benutzerdokumentation"
  },
  {
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "description-english": "A person's perceptions and responses resulting from the use or anticipated use of an <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Notes: <br />1.\t<a href='#/glossary?term=User'>User</a> experience includes <a href='#/glossary?term=Usability'>usability</a>. Usability criteria can be used to assess aspects of user experience.<br />2.\tUser experience includes all the users' emotions, beliefs, preferences, perceptions and accomplishments that occur before, during and after use of the interactive system. <br />3.\tUser experience is a consequence of brand image, presentation, functionality, system performance, interactive behaviour and assistive capabilities of the interactive system, and the <a href='#/glossary?term=Context of use'>context of use</a>. <br />Examples that illustrate the difference between usability and user experience: <br />When ordering flowers for delivery from a flower store's website:<br />1.\tUsability <a href='#/glossary?term=Problem'>problem</a>s encountered during checkout affect both the user experience and usability.<br />2.\tThe <a href='#/glossary?term=Quality'>quality</a> of the physical flowers delivered affect only the user experience. It does not affect usability.<br />3.\tThe experience of visiting the physical store affects the user experience of subsequent visits to the website. It does not affect usability.<br />Course note:<br />1.\tStudents must know the difference between usability and user experience.",
    "description-german": "Wahrnehmungen und Reaktionen einer Person, die aus der tatsächlichen oder erwarteten Benutzung eines interaktiven Systems resultieren. <br />Anmerkungen: <br />1.\t<a href='#/glossary?term=Benutzer'>Benutzer</a>erlebnis schliesst <a href='#/glossary?term=Usability'>Usability</a> ein. Usability Kriterien können eingesetzt werden um Aspekte des Benutzererlebnisses zu evaluieren.<br />2.\tBenutzererlebnis umfasst die Gefühle, Meinungen, Bevorzugungen, Auffassungen und Leistungen der Benutzer die bevor, während und nach der Benutzung des interaktiven Systems auftreten.<br />3.\tDas Benutzererlebnis hängt ab\tvon Markenimage, Darstellung, Funktionalität, Systemleistung, interaktivem Verhalten und unterstützenden Fähigkeiten des interaktiven Systems, sowie vom <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a>.<br />Beispiele die den Unterschied zwischen Usability und User Experience veranschaulichen:<br />Wenn Blumen auf einer Website eines Blumengeschäftes zur Auslieferung bestellt werden:<br />1.\tAufgetauchte <a href='#/glossary?term=Usability-Problem'>Usability-Problem</a>e während des Checkouts beeinflussen sowohl das Benutzererlebnis als auch die Usability.<br />2.\tDie <a href='#/glossary?term=Qualität'>Qualität</a> der physisch gelieferten Blumen beeinflusst ausschließlich die User Experience, nicht die Usability.<br />3.\tDie gemachte Erfahrung beim Besuch des physikalischen Geschäfts, beeinflusst die User Experience zukünftiger Besuche der Website. Sie hat keinen Einfluss auf die Usability.<br />Anmerkung zum Training:<br />1.\tZertifizierungsanwärter müssen den Unterschied zwischen Usability und Benutzererlebnis kennen.",
    "term-english": "User experience",
    "term-german": "Benutzererlebnis"
  },
  {
    "categories": [
      "Rollen",
      "Planung",
      "Gestaltung",
      "Evaluierung"
    ],
    "description-english": "A collection of <a href='#/glossary?term=User'>user</a>s with the same or similar <a href='#/glossary?term=Persona'>persona</a>l characteristics and <a href='#/glossary?term=Context of use'>context of use</a> related to the <a href='#/glossary?term=Interactive system'>interactive system</a>.",
    "description-german": "Eine Gruppe von <a href='#/glossary?term=Benutzer'>Benutzer</a>n mit denselben oder ähnlichen Personenmerkmalen und <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> bezogen auf das interaktive System.",
    "term-english": "User group",
    "term-german": "Benutzergruppe"
  },
  {
    "categories": [
      "Rollen",
      "Evaluierung"
    ],
    "description-english": "A generalized description of a <a href='#/glossary?term=User'>user</a> group.",
    "description-german": "Eine verallgemeinerte Beschreibung einer <a href='#/glossary?term=Benutzergruppe'>Benutzergruppe</a>.",
    "term-english": "User group profile",
    "term-german": "Benutzergruppenprofil"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung",
      "System"
    ],
    "description-english": "Information to help a <a href='#/glossary?term=User'>user</a> to interact with an <a href='#/glossary?term=Interactive system'>interactive system</a>. <br />Notes:<br />1.\tUser assistance can include describing the <a href='#/glossary?term=User interface'>user interface</a>, but also focuses on how to help the user to best apply the capabilities of the interactive system to their needs. <br />2.\tUser assistance incorporates all forms of help available to a user, for example <br />a.\t<a href='#/glossary?term=User documentation'>User documentation</a>, <br />b.\t<a href='#/glossary?term=Online help'>Online help</a>;<br />c.\t<a href='#/glossary?term=System-initiated guidance'>System-initiated guidance</a>.",
    "description-german": "Informationen um einem <a href='#/glossary?term=Benutzer'>Benutzer</a> bei der Interaktion mit einem interaktiven System zu helfen.<br />Anmerkungen:<br />1.\tBenutzerunterstützung kann eine Beschreibung der Benutzeroberfläche selbst beinhalten, aber auch Informationen, wie der Benutzer am besten die Möglichkeiten des interaktiven Systems für die Erfüllung seiner <a href='#/glossary?term=Anforderung'>Anforderung</a>en einsetzen kann.<br />2. \tBenutzerunterstützung schließt alle Formen von Hilfestellung, die für den Benutzer zur Verfügung stehen, ein, z.B.:<br />a.\t<a href='#/glossary?term=Benutzerdokumentation'>Benutzerdokumentation</a> <br />b.\t<a href='#/glossary?term=Onlinehilfe'>Onlinehilfe</a><br />c.\t<a href='#/glossary?term=Systeminitiierte Benutzerführung'>Systeminitiierte Benutzerführung</a>",
    "term-english": "User assistance",
    "term-german": "Benutzerunterstützung"
  },
  {
    "categories": [
      "Gestaltung",
      "Implementierung",
      "Planung"
    ],
    "description-english": "See <a href='#/glossary?term=Human-centred design'>Human-centred design</a>.",
    "description-german": "Siehe <a href='#/glossary?term=Menschzentrierte Gestaltung'>Menschzentrierte Gestaltung</a>.",
    "term-english": "User-centred design",
    "term-german": "Benutzerzentrierte Gestaltung"
  },
  {
    "categories": [
      "Planung",
      "Test",
      "Evaluierung"
    ],
    "description-english": "<a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> that involves representative <a href='#/glossary?term=User'>user</a>s performing specific <a href='#/glossary?term=Task'>task</a>s with the <a href='#/glossary?term=Interactive system'>interactive system</a> to enable identification of usability <a href='#/glossary?term=Problem'>problem</a>s, or measurements of <a href='#/glossary?term=Efficiency'>efficiency</a>, <a href='#/glossary?term=Effectiveness'>effectiveness</a>, user <a href='#/glossary?term=Satisfaction'>satisfaction</a>, or other measures of <a href='#/glossary?term=User experience'>user experience</a>.<br />Note:<br />1.\tSee <a href='#/glossary?term=Usability test'>Usability test</a>.",
    "description-german": "<a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a>, die repräsentative <a href='#/glossary?term=Benutzer'>Benutzer</a> involviert, die bestimmte <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n mit dem interaktiven System ausführen, um die Identifikation von <a href='#/glossary?term=Usability-Problem'>Usability-Problem</a>en oder die Messung von <a href='#/glossary?term=Effizienz'>Effizienz</a>, <a href='#/glossary?term=Effektivität'>Effektivität</a> und <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a> zu ermöglichen.<br />Anmerkung:<br />1.\tSiehe <a href='#/glossary?term=Usability-Test'>Usability-Test</a>.",
    "term-english": "Usability evaluation –  User based",
    "term-german": "Benutzerzentrierte Usability-Evaluierung"
  },
  {
    "categories": [
      "System",
      "Gestaltung",
      "Implementierung"
    ],
    "description-english": "All components of an <a href='#/glossary?term=Interactive system'>interactive system</a> (software or hardware) that provide information and controls for the <a href='#/glossary?term=User'>user</a> to accomplish specific <a href='#/glossary?term=Task'>task</a>s with the interactive system.",
    "description-german": "Alle Bestandteile eines interaktiven Systems (Software oder Hardware), die Informationen und Steuerelemente zur Verfügung stellen, die für den <a href='#/glossary?term=Benutzer'>Benutzer</a> notwendig sind, um bestimmte <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n mit dem interaktiven System zu erledigen.",
    "term-english": "User interface",
    "term-german": "Benutzungsschnittstelle"
  },
  {
    "categories": [
      "Rollen",
      "System"
    ],
    "description-english": "A person who watches <a href='#/glossary?term=User'>user</a>s who discuss or carry out <a href='#/glossary?term=Task'>task</a>s that are related to the <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Notes:<br />1.\tObserver is a <a href='#/glossary?term=Role'>role</a> in a <a href='#/glossary?term=Usability'>usability</a> activity, such as an <a href='#/glossary?term=Observation'>observation</a>, <a href='#/glossary?term=Usability test'>usability test</a> session or <a href='#/glossary?term=Focus group'>focus group</a>.<br />2.\tObservers do not interfere with the usability activity. Observers may be actively involved in the analysis of the results.",
    "description-german": "Eine Person, die <a href='#/glossary?term=Benutzer'>Benutzer</a> beobachtet, die eine <a href='#/glossary?term=Aufgabe'>Aufgabe</a> diskutieren oder eine Aufgabe mittels eines interaktiven Systems ausführen.<br />Anmerkungen:<br />1.\tBeobachter ist eine <a href='#/glossary?term=Rolle'>Rolle</a> während einer <a href='#/glossary?term=Usability'>Usability</a>-Aktivität, wie z.B. <a href='#/glossary?term=Beobachtung'>Beobachtung</a>, einer <a href='#/glossary?term=Usability-Testsitzung'>Usability-Testsitzung</a> oder einer <a href='#/glossary?term=Fokusgruppe'>Fokusgruppe</a>.<br />2.\tBeobachter dürfen nicht aktiv in die Usability-Aktivität eingreifen. Sie können aber aktiv in die Analyse der Ergebnisse involviert sein.",
    "term-english": "Observer",
    "term-german": "Beobachter"
  },
  {
    "categories": [
      "Prinzipien",
      "Anforderungen"
    ],
    "description-english": "A technique for gathering contextual information relating to <a href='#/glossary?term=User'>user</a> needs in which an <a href='#/glossary?term=Observer'>observer</a> watches users who carry out <a href='#/glossary?term=Task'>task</a>s that are related to the <a href='#/glossary?term=Interactive system'>interactive system</a>. <br />Notes:<br />1.\tThe observer behaves unobtrusively except that he/she may ask an occasional clarifying question.<br />2.\tIf no interactive system is available, observe the existing manual procedures.<br />3.\tObservation should take place in a context that is as natural as possible, for example at the user's workplace.",
    "description-german": "Eine Technik für das Sammeln von Kontextinformationen zu den <a href='#/glossary?term=Erfordernis'>Erfordernis</a>sen des <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a>s. Während einer Beobachtung sieht der <a href='#/glossary?term=Beobachter'>Beobachter</a> dem <a href='#/glossary?term=Benutzer'>Benutzer</a> bei der Ausführung von <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n am interaktiven System zu. <br />Anmerkungen:<br />1.\tDer Beobachter greift nicht ein, außer  es besteht gelegentlich die Notwendigkeit zu einer klärenden Frage.<br />2.\tWenn kein <a href='#/glossary?term=Interaktives System'>interaktives System</a> benutzt wird, sollten die vorhandenen manuellen Abäufe beobachtet werden.<br />3.\tDie Beobachtung sollte in einem möglichst natürlichen Kontext stattfinden, z. B. am Arbeitsplatz des Benutzers.",
    "term-english": "Observation",
    "term-german": "Beobachtung"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "The first activity in an <a href='#/glossary?term=Interview'>Interview</a> or a <a href='#/glossary?term=Usability'>Usability</a> test session where the participant is informed about the purpose of the Interview or <a href='#/glossary?term=Usability test'>Usability test</a> and what their <a href='#/glossary?term=Role'>role</a> and contribution are.",
    "description-german": "Die erste Aktivität in einem <a href='#/glossary?term=Interview'>Interview</a> oder <a href='#/glossary?term=Usability-Test'>Usability-Test</a>, in dem dem Teilnehmer erklärt wird, warum das Interview oder der <a href='#/glossary?term=Usability'>Usability</a>-Test durchgeführt wird und was seine <a href='#/glossary?term=Rolle'>Rolle</a> und sein Beitrag ist",
    "term-english": "Briefing",
    "term-german": "Briefing"
  },
  {
    "categories": [
      "Gestaltung",
      "Test",
      "Evaluierung"
    ],
    "description-english": "A general reusable solution to a commonly occurring <a href='#/glossary?term=Problem'>problem</a> within a given context in software design that describes a design problem, a solution, and where this solution has been found to work.<br />Course note:<br />1.\tSeveral websites offer free access to a large selection of design patterns, for example www.welie.com",
    "description-german": "Eine wiederverwendbare Lösung für ein Gestaltungsproblem innerhalb eines Kontexts. Ein Design Pattern beschreibt ein Gestaltungsproblem, eine Lösung und wo sich diese Lösung als funktionierend herausgestellt hat.<br />Anmerkung:<br />1.\tAuf Deutsch wird „design pattern“ manchmal als „Entwurfsmuster“ bezeichnet.<br />Anmerkung zum Training:<br />1.\tVerschiedene Webseiten bieten freien Zugang zu einer großen Auswahl an Design Patterns z.B. www.welie.com ",
    "term-english": "Design pattern",
    "term-german": "Design Pattern"
  },
  {
    "categories": [
      "Gestaltung",
      "System",
      "Prinzipien",
      "Implementierung"
    ],
    "description-english": "Interaction between a <a href='#/glossary?term=User'>user</a> and an <a href='#/glossary?term=Interactive system'>interactive system</a> that consists of user actions (input) and responses from the interactive system (output) in order to achieve a <a href='#/glossary?term=Goal'>goal</a>.",
    "description-german": "Interaktion zwischen einem <a href='#/glossary?term=Benutzer'>Benutzer</a> und einem interaktiven System in Form einer Folge von Handlungen des Benutzers (Eingaben) und Antworten des interaktiven Systems (Ausgaben), um ein <a href='#/glossary?term=Ziel'>Ziel</a> zu erreichen.",
    "term-english": "Dialogue",
    "term-german": "Dialog"
  },
  {
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "General <a href='#/glossary?term=Goal'>goal</a>s for the design of useful and usable <a href='#/glossary?term=Dialogue'>dialogue</a>s.<br />Notes:<br />1.\tDialogue principles are not bound to any specific technology or technique. <br />2.\tDialogue principles may be difficult to apply because of their generality.<br />3.\t<a href='#/glossary?term=ISO 9241'>ISO 9241</a>-110 lists the following seven dialogue principles:<br />a.\tSuitability for the <a href='#/glossary?term=Task'>task</a>;<br />b.\t<a href='#/glossary?term=Self-descriptiveness'>Self-descriptiveness</a>;<br />c.\tConformity with <a href='#/glossary?term=User'>user</a> expectations;<br />d.\t<a href='#/glossary?term=Suitability for learning'>Suitability for learning</a>;<br />e.\t<a href='#/glossary?term=Controllability'>Controllability</a>;<br />f.\t<a href='#/glossary?term=Error tolerance'>Error tolerance</a>;<br />g.\t<a href='#/glossary?term=Suitability for individualization'>Suitability for individualization</a>.<br />4.\tCompare dialogue principle to <br />a.\t<a href='#/glossary?term=Heuristic'>Heuristic</a> – A rule of thumb that helps to achieve dialogue principles. It is more specific and easier to apply than a dialogue principle.<br />b.\t<a href='#/glossary?term=User interface'>User interface</a> <a href='#/glossary?term=Guideline'>guideline</a> – Low-level specific rule for interface design.",
    "description-german": "Allgemeine <a href='#/glossary?term=Ziel'>Ziel</a>e für das <a href='#/glossary?term=Dialog'>Dialog</a>design.<br />Anmerkungen<br />1.\tDialogprinzipien sind unabhängig von einer spezifischen Technologie oder Technik<br />2.\tAufgrund ihrer Allgemeingültigkeit kann es schwierig sein, Dialogprinzipien im konkreten Kontext umzusetzen.<br />3.\tDie DIN EN <a href='#/glossary?term=ISO 9241'>ISO 9241</a>-110 führt folgende sieben Dialogprinzipien auf:<br />a.\t<a href='#/glossary?term=Aufgabenangemessenheit'>Aufgabenangemessenheit</a>,<br />b.\t<a href='#/glossary?term=Selbstbeschreibungsfähigkeit'>Selbstbeschreibungsfähigkeit</a>,<br />c.\t<a href='#/glossary?term=Erwartungskonformität'>Erwartungskonformität</a>,<br />d.\t<a href='#/glossary?term=Lernförderlichkeit'>Lernförderlichkeit</a>,<br />e.\t<a href='#/glossary?term=Steuerbarkeit'>Steuerbarkeit</a>,<br />f.\t<a href='#/glossary?term=Fehlertoleranz'>Fehlertoleranz</a>,<br />g.\t<a href='#/glossary?term=Individualisierbarkeit'>Individualisierbarkeit</a>.<br />4.\tVergleiche Dialogprinzip mit <br />a.\t<a href='#/glossary?term=Heuristik'>Heuristik</a>: Daumenregel, die der Umsetzung von Dialogprinzipien dient aber konkreter und einfacher anzuwenden ist.<br />b.\t<a href='#/glossary?term=Gestaltungsregel'>Gestaltungsregel</a>: Spezifischer Regel für das Design der <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a>.",
    "term-english": "Dialogue principles",
    "term-german": "Dialogprinzipien"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "Person who interacts with an <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Note: <br />1.\tA direct <a href='#/glossary?term=User'>user</a> is either a <a href='#/glossary?term=Primary user'>Primary user</a> or a <a href='#/glossary?term=Secondary user'>Secondary user</a>.<br />Examples of direct users: <br />1.\tA supporter in a call centre using a computer system is a direct user of the computer system, while customers who call the call centre are direct users of the support service, but <a href='#/glossary?term=Indirect user'>indirect user</a>s of the computer system.",
    "description-german": "Eine Person, die mit einem interaktiven System interagiert.<br />Anmerkung<br />1.\tEin direkter <a href='#/glossary?term=Benutzer'>Benutzer</a> ist ein primärer ode rein <a href='#/glossary?term=Sekundärer Benutzer'>sekundärer Benutzer</a>.<br />Beispiele für direkte Benutzer<br />1.\tEin Kundenbetreuer in einem Call-Center der ein Computersystem nutzt ist ein direkter Benutzer des Computersystems. Ein Kunde der das Call-Center anruft ist zwar ein direkter Nutzer des Services des Kundenbetreuers aber nur ein <a href='#/glossary?term=Indirekter Benutzer'>indirekter Benutzer</a> des Computersystems. ",
    "term-english": "Direct user",
    "term-german": "Direkter Benutzer"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "A measure given to a <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Problem'>problem</a> from a <a href='#/glossary?term=Usability test'>usability test</a> to indicate the impact and criticality on the <a href='#/glossary?term=User'>user</a> experience and the consequences.<br />Notes:<br />1.\tThe <a href='#/glossary?term=Usability tester'>usability tester</a> rates <a href='#/glossary?term=Usability problem'>usability problem</a>s from the usability <a href='#/glossary?term=Test participant'>test participant</a>s' point of view. Sometimes, the ratings are done in cooperation between the usability tester and a domain expert<br />2.\tTypical severity ratings are: Minor, severe, critical, and life-threatening.",
    "description-german": "Ein Maß für ein <a href='#/glossary?term=Usability-Problem'>Usability-Problem</a> aus einem <a href='#/glossary?term=Usability-Test'>Usability-Test</a>, das die Auswirkung des <a href='#/glossary?term=Usability'>Usability</a>-Problems auf das <a href='#/glossary?term=Benutzererlebnis'>Benutzererlebnis</a> bewertet.<br />Anmerkungen: <br />1.\tDer <a href='#/glossary?term=Usability-Tester'>Usability-Tester</a> bewertet Usability-Probleme aus Sicht der <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a>. Manchmal erfolgen die Bewertungen in Kooperation des Usability-Testers mit einem Experten des Fachgebiets. <br />2.\tTypische Dringlichkeits­stufen sind: niedrig, ernst, kritisch, lebensbedrohend.",
    "term-english": "Severity rating",
    "term-german": "Dringlichkeitsstufe"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "Extent to which correct and complete <a href='#/glossary?term=Goal'>goal</a>s are achieved.<br />Notes: <br />1.\tEffectiveness is one of the three measurable attributes for <a href='#/glossary?term=Usability'>usability</a>. The others are <a href='#/glossary?term=Efficiency'>efficiency</a> and <a href='#/glossary?term=Satisfaction'>satisfaction</a>.<br />2.\tEffectiveness is the attribute of usability that focuses on being able to accomplish <a href='#/glossary?term=Task'>task</a>s.",
    "description-german": "Ausmaß der Vollständigkeit und Genauigkeit der <a href='#/glossary?term=Ziel'>Ziel</a>erreichung.<br />Anmerkungen: <br />1.\tDie Effektivität ist eines der drei messbaren Attribute für <a href='#/glossary?term=Usability'>Usability</a>. Die anderen beiden Attribute sind <a href='#/glossary?term=Effizienz'>Effizienz</a> und <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a>.<br />2.\tDie Effektivität ist ein Attribut von Usability, das auf die prinzipielle Fähigkeit zur <a href='#/glossary?term=Aufgabe'>Aufgabe</a>nerledigung verweist.",
    "term-english": "Effectiveness",
    "term-german": "Effektivität"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "<a href='#/glossary?term=Resources'>Resources</a> expended to achieve specified <a href='#/glossary?term=Goal'>goal</a>s. <br />Notes:<br />1.\tResources include time, human effort, financial and material resources.<br />2.\tEfficiency is one of the three measurable attributes for <a href='#/glossary?term=Usability'>usability</a>. The others are <a href='#/glossary?term=Effectiveness'>effectiveness</a> and <a href='#/glossary?term=Satisfaction'>satisfaction</a>.<br />3.\tEfficiency is the attribute of usability that focuses on being able to accomplish a <a href='#/glossary?term=Task'>task</a> using acceptable amounts of resources.",
    "description-german": "Eingesetzte <a href='#/glossary?term=Ressourcen'>Ressourcen</a>, um bestimmte <a href='#/glossary?term=Ziel'>Ziel</a>e zu erreichen.<br />Anmerkungen:<br />1. Ressourcen beinhalten zeitliche, finanzielle und  materielle Aufwände sowie mentale Aufwände die aus menschlichem Wahrnehmen, Denken und Handeln resultieren  <br />2.\tEffizienz ist eines der drei messbaren Attribute von <a href='#/glossary?term=Usability'>Usability</a>. Die anderen beiden Attribute sind <a href='#/glossary?term=Effektivität'>Effektivität</a> und <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a>. <br />3.\tEffizienz ist ein Attribut von Usability welches auf die Erledigung einer <a href='#/glossary?term=Aufgabe'>Aufgabe</a> mit einem akzeptierbarem Aufwand verweist.   ",
    "term-english": "Efficiency",
    "term-german": "Effizienz"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "A prerequisite identified as necessary for a <a href='#/glossary?term=User'>user</a>, or a <a href='#/glossary?term=User group'>user group</a>, to achieve a <a href='#/glossary?term=Goal'>goal</a>, implied or stated within a specific <a href='#/glossary?term=Context of use'>context of use</a>.<br />Notes:<br />1.\tA user need is independent of any proposed solution for that need. In other words: A user need must not reference for example \"the system\" or \"the website\".<br />2.\tUser needs are identified based on various approaches including <a href='#/glossary?term=Interview'>interview</a>s with users, <a href='#/glossary?term=Observation'>observation</a>s, <a href='#/glossary?term=User survey'>user survey</a>s, <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a>s, expert analysis, etc.<br />3.\tUser needs often represent gaps (or discrepancies) between what should be and what is.<br />4.\tUser needs are transformed into user <a href='#/glossary?term=Requirement'>requirement</a>s considering the context of use, user priorities, tradeoffs with other system requirements and constraints<br />Examples of user needs:<br />1.\tA presenter (user) needs to know how much time is left (prerequisite) in order to complete the presentation in time (goal) during a presentation with a fixed time limit (context of use).<br />2.\tAn account manager (user) needs to know the number of invoices received and their amounts (prerequisite), in order to complete the daily accounting log (goal) as part of monitoring the cash flow (context of use).",
    "description-german": "Eine für einen <a href='#/glossary?term=Benutzer'>Benutzer</a> oder eine <a href='#/glossary?term=Benutzergruppe'>Benutzergruppe</a> als notwendig identifizierte Voraussetzung, um ein <a href='#/glossary?term=Ziel'>Ziel</a> innerhalb eines bestimmten <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a>es zu erreichen. <br />Anmerkungen:<br />1.\tEin Erfordernis ist unabhängig von jeglicher vorgeschlagenen Lösung für dieses Erfordernis. Mit anderen Worten: Ein Erfordernis darf nicht auf z.B. ”das System” oder ”die Website” hinweisen.<br />2.\tErfordernisse werden aufgrund verschiedener Ansätze identifiziert, unter anderem  <a href='#/glossary?term=Interview'>Interview</a>s mit Benutzern, <a href='#/glossary?term=Beobachtung'>Beobachtung</a>en, <a href='#/glossary?term=Benutzerbefragung'>Benutzerbefragung</a>en, <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a>en, Expertenanalyse usw.<br />3.\tErfordernisse repräsentieren oftmals Lücken (oder Diskrepanzen) zwischen dem was ist und dem was sein soll.<br />4.\tErfordernisse werden transformiert in <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Anforderung'>anforderung</a>'>Nutzungsanforderung</a>en, die den Nutzungskontext, Benutzerprioritäten sowie das Wechselspiel mit anderen Anforderungen und -Einschränkungen mit berücksichtigen. <br />4.\t„Erfordernis“ heisst auf Englisch „User need“.<br />Beispiele für Erfordernisse:<br />1.\tEin Vortragender (Benutzer) muss wissen, wie viel Zeit er noch hat (Voraussetzung), um den Vortrag während einer Präsentation mit einer festgelegten Zeitbeschränkung  (Nutzungskontext) abschliessen zu können (Ziel).<br />2.\tEin Finanzbuchhalter (Benutzer) muss die Anzahl der erhaltenen Rechnungen und ihre Beträge kennen (Voraussetzung) um die tägliche Rechnungsstellung (Ziel) als Teil der Cashflow-Kont<a href='#/glossary?term=Rolle'>rolle</a> (Nutzungskontext) fertigstellen zu können.",
    "term-english": "User need",
    "term-german": "Erfordernis"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "Correspondence to predictable contextual needs of the <a href='#/glossary?term=User'>user</a> and to commonly accepted conventions.<br />Notes:<br />1.\t<a href='#/glossary?term=Consistency'>Consistency</a> is an aspect of Conformity with user expectations.<br />2.\tConformity with user expectations is a <a href='#/glossary?term=Dialogue'>dialogue</a> principle.",
    "description-german": "Übereinstimmung mit den aus dem <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> heraus vorhersehbaren <a href='#/glossary?term=Benutzer'>Benutzer</a>belangen sowie allgemein anerkannten Konventionen.<br />Anmerkungen:<br />1.\t<a href='#/glossary?term=Konsistenz'>Konsistenz</a> ist ein Aspekt der Erwartungskonformität.<br />2.\tErwartungskonformität ist ein <a href='#/glossary?term=Dialog'>Dialog</a>prinzip.<br />",
    "term-english": "Conformity with user expectations",
    "term-german": "Erwartungskonformität"
  },
  {
    "categories": [
      "Test",
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> evaluation.",
    "description-german": "Siehe <a href='#/glossary?term=Usability-Evaluierung'>Usability-Evaluierung</a>",
    "term-english": "Evaluation",
    "term-german": "Evaluierung"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A document reporting the results of a <a href='#/glossary?term=Usability'>usability</a> test, an <a href='#/glossary?term=Inspection'>inspection</a> or a <a href='#/glossary?term=User'>user</a> survey.<br />Note:<br />1.\tThe <a href='#/glossary?term=Evaluation'>evaluation</a> report for a <a href='#/glossary?term=Usability test'>usability test</a> is usually referred to as a usability <a href='#/glossary?term=Test report'>test report</a>.",
    "description-german": "Ein Dokument, in dem die Ergebnisse eines <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s, einer <a href='#/glossary?term=Inspektion'>Inspektion</a> oder einer <a href='#/glossary?term=Benutzerbefragung'>Benutzerbefragung</a> dokumentiert werden.<br />Anmerkung:<br />1.\tDas Dokument für einen <a href='#/glossary?term=Usability'>Usability</a>-Test wird üblicherweise als <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testbericht'>Testbericht</a>'>Usability-Testbericht</a> bezeichnet.",
    "term-english": "Evaluation report",
    "term-german": "Evaluierungsbericht"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "See <a href='#/glossary?term=Moderator'>Moderator</a>",
    "description-german": "Siehe <a href='#/glossary?term=Moderator'>Moderator</a>",
    "term-english": "Facilitator",
    "term-german": "Facilitator"
  },
  {
    "categories": [
      "Anforderungen",
      "Evaluierung"
    ],
    "description-english": "The property of a <a href='#/glossary?term=Dialogue'>dialogue</a> to achieve the intended result with either no, or minimal, corrective action by the <a href='#/glossary?term=User'>user</a> despite evident errors in input. <br />Note:<br />1.\tError tolerance is a dialogue principle.<br />Examples of error tolerance:<br />1.\tWhen an error occurs, the <a href='#/glossary?term=Interactive system'>interactive system</a> should provide a precise and comprehensible explanation. The explanation must also be constructive – that is, it must suggest a solution to the <a href='#/glossary?term=Problem'>problem</a>.<br />2.\tIf severe consequences could result from a user action, the interactive system should provide explanation and request confirmation before carrying out the action.",
    "description-german": "Die Eigenschaft eines <a href='#/glossary?term=Dialog'>Dialog</a>s das beabsichtigte Arbeitsergebnis trotz erkennbar fehlerhafter Eingaben entweder mit keinem oder mit minimalem Korrekturaufwand seitens des <a href='#/glossary?term=Benutzer'>Benutzer</a>s zu erreichen.<br />Anmerkung:<br />1.\tFehlertoleranz ist ein Dialogprinzip.<br />Beispiele für Fehlertoleranz:<br />1.\tWenn ein Fehler auftritt, sollte das interaktive System eine genaue und verständliche Erklärung anbieten und konstruktiv eine Lösung vorschlagen, also was als nächstes zu tun ist.<br />2.\tWenn aus einer Benutzeraktion schwerwiegende Folgen entstehen können, dann sollte das interaktive System eine Erklärung anbieten und eine Bestätigung vor der Durchführung der Aktion durch den Benutzer einholen.",
    "term-english": "Error tolerance",
    "term-german": "Fehlertoleranz"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung",
      "Rollen"
    ],
    "description-english": "A focused discussion where a <a href='#/glossary?term=Moderator'>moderator</a> leads a group of participants through a set of questions on a particular topic.<br />Notes: <br />1.\tDo not use focus groups for <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a>.<br />2.\tFocus groups are about opinion. In comparison, <a href='#/glossary?term=Usability test'>usability test</a>s are about observing actual <a href='#/glossary?term=User'>user</a> behaviour.",
    "description-german": "Eine ge<a href='#/glossary?term=Ziel'>ziel</a>te Diskussion, bei der ein <a href='#/glossary?term=Moderator'>Moderator</a> eine Gruppe von Teilnehmern durch eine Menge von Fragen zu einem bestimmten Thema führt. <br />Anmerkungen: <br />1.\tDie Durchführung von Fokusgruppen ist kein Ersatz für eine <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a>.<br />2.\tFokusgruppen befassen sich mit Meinungen, <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s mit der <a href='#/glossary?term=Beobachtung'>Beobachtung</a> des tatsächlichen <a href='#/glossary?term=Benutzer'>Benutzer</a>verhaltens.",
    "term-english": "Focus group",
    "term-german": "Fokusgruppe"
  },
  {
    "categories": [
      "Evaluierung",
      "Test",
      "Prinzipien"
    ],
    "description-english": "A type of <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> designed and used to improve an <a href='#/glossary?term=Interactive system'>interactive system</a>, especially when it is still being designed.<br />Note: <br />1.\tCompare to <a href='#/glossary?term=Summative <a href='#/glossary?term=Usability evaluation'>usability evaluation</a>'>Summative usability evaluation</a>.",
    "description-german": "Eine Art der <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a> die hilft, das Design für ein <a href='#/glossary?term=Interaktives System'>interaktives System</a> zu verbessern, besonders während es noch gestaltet wird.<br />Anmerkung:<br />1.\tVergleiche mit <a href='#/glossary?term=Summative <a href='#/glossary?term=Usability'>Usability</a>-Evaluierung'>Summative Usability-Evaluierung</a>.",
    "term-english": "Formative usability evaluation",
    "term-german": "Formative Usability-Evaluierung"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A set of questions that is used collect data from <a href='#/glossary?term=User'>user</a>s, often in a <a href='#/glossary?term=User survey'>user survey</a>.<br />Notes: <br />1.\tTwo important uses of questionnaires in <a href='#/glossary?term=Usability'>usability</a> are:<br />a.\tTo understand the <a href='#/glossary?term=Context of use'>context of use</a>. Questions are about the users' experience with the current <a href='#/glossary?term=Interactive system'>interactive system</a> and their expectations for the new interactive system. Questions are answered in text form.<br />b.\tTo evaluate the <a href='#/glossary?term=User experience'>user experience</a> before, during and after the use of an interactive system.<br />2.\tQuestionnaires must be usable. They must adhere to <a href='#/glossary?term=Dialogue'>dialogue</a> principles, for example<br />a.\tEach question must contribute significantly to the purpose of the questionnaire;<br />b.\tQuestions must be easy to understand; <br />c.\tThe questionnaire must keep users informed of their progress;<br />d.\tThe questionnaire must be <a href='#/glossary?term=Usability test'>usability test</a>ed.<br />3.\tThis definition applies to both digital and paper questionnaires.<br />Examples of questions to understand context of use:<br />1.\t\"When did you last use the car rental website? What was your business?\"<br />2.\t\"What do you expect from a car rental website?\"<br />Examples of questions to evaluate <a href='#/glossary?term=Satisfaction'>satisfaction</a>:<br />1.\t\"On a scale from 1 to 5, where 1 means \"strongly disagree\", 3 means \"neutral\", and 5 means \"strongly agree\", please rate the following statements:<br />a.\tThe new car rental website looks cool.<br />b.\tThe new car rental website is easy to use.<br />c.\tThe new car rental website lets me rent cars quickly.",
    "description-german": "Ein Satz von Fragen, der von <a href='#/glossary?term=Benutzer'>Benutzer</a>n in einer <a href='#/glossary?term=Benutzerbefragung'>Benutzerbefragung</a> beantwortet wird, um  Daten zu sammeln.<br />Anmerkungen: <br />1.\tZwei wichtige Verwendungszwecke von Fragebögen im Bereich <a href='#/glossary?term=Usability'>Usability</a> sind:<br />a.\tUm den <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> zu verstehen. Die gestellten Fragen beziehen sich auf die Erfahurngen die ein Benutzer mit dem momentanen, interaktiven System gemacht hat und die Erwartungen, die er an ein neues <a href='#/glossary?term=Interaktives System'>interaktives System</a> stellt. <br />b.\tUm das <a href='#/glossary?term=Benutzererlebnis'>Benutzererlebnis</a> vor, während und nach der Benutzung eines interaktiven Systems zu evaluieren.<br />2.\tFragebögen müssen benutzbar sein. Sie müssen den <a href='#/glossary?term=Dialogprinzipien'>Dialogprinzipien</a> folgen, z.B.<br />a.\tJede Frage muss einen wesentlichen Beitrag zur Beantwortung der globalen Fragestellung liefern.<br />b.\tFragen müssen leicht zu verstehen sein.<br />c.\tDer Fragebogen muss die Benutzer hinsichtlich ihres Fortschritts in der Beantwortung der Fragen auf dem Laufenden halten.<br />d.\tDer Fragebogen muss anhand eines <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s optimiert worden sein.<br />3.\tDiese Definition bezieht sich sowohl auf Digitale- als auch auf Papierfragebögen.<br />Beispielfragen um den Nutzungskontext zu verstehen:<br />1. \t“Wann haben Sie das letzte Mal die Website für Autovermietung benutzt? Was wollten Sie auf der Seite tun?“<br />2.\t“Was erwarten Sie von einer Website für Autovermietung?”<br />Beispiele für Fragen zur <a href='#/glossary?term=Evaluierung'>Evaluierung</a> der <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a>:<br />1.\t“Auf einer Skala von 1 bis 5, bei der 1 für “stimme gar nicht zu“, 3 „neutral“ und 5 für „stimme voll  zu“ steht, bewerten Sie bitte die folgenden Aussagen:<br />a.\tDie neue Website für Autovermietung sieht cool aus.<br />b.\tDie neue Website für Autovermietung ist einfach zu benutzen.<br />c.\tDie neue Website für Autovermietung ermöglicht schnelles Mieten von Autos.",
    "term-english": "Questionnaire",
    "term-german": "Fragebogen"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "An <a href='#/glossary?term=Interview'>interview</a> question that requires an answer from a predetermined set of alternatives, for example yes and no.<br />Notes:<br />1.\tAvoid several closed questions in sequence. They stop <a href='#/glossary?term=User'>user</a>s talking because they sound like a police interrogation. <br />2.\tCompare to <a href='#/glossary?term=Open question'>Open question</a>. <br />Example of a closed question: <br />1.\t\"Have you ever rented a car?\"<br />Corresponding open question: \"Please tell me about the last time you rented a car.\"",
    "description-german": "Eine <a href='#/glossary?term=Interview'>Interview</a>frage die eine Antwort aus einem vordefinierten Satz von Alternativen fordert, oft einfach „ja“ oder „nein“.<br />Anmerkungen: <br />1.\tVermeide mehrere geschlossene Fragen hintereinander. Sie unterbrechen den Redefluss der <a href='#/glossary?term=Benutzer'>Benutzer</a> weil sie sich wie ein Polizeiverhör anhören. <br />2.\tVergleiche mit <a href='#/glossary?term=Offene Frage'>offene Frage</a>.<br />Beispiel für geschlossene Frage:<br />1.\t„Haben Sie jemals ein Auto gemietet?“ Entsprechende offene Frage: „Bitte erzählen Sie mir von dem letzten Mal wo Sie ein Auto gemietet haben.“",
    "term-english": "Closed question",
    "term-german": "Geschlossene Frage"
  },
  {
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "See <a href='#/glossary?term=User'>User</a> interface <a href='#/glossary?term=Guideline'>guideline</a>.",
    "description-german": "Konkrete, spezifische Instruktion oder Empfehlung, die wenig Interpretationsspielraum lässt, so dass verschiedene Designer sie ähnlich umsetzen.<br />Anmerkungen:<br />1. \tSammlungen von Gestaltungsregeln werden als <a href='#/glossary?term=Styleguide'>Styleguide</a>s bezeichnet.<br />2. \t<a href='#/glossary?term=Design Pattern'>Design Pattern</a>s müssen relevante Gestaltungsregeln erfüllen.<br />3. \tVergleiche Gestaltungsregel mit<br />a.\t<a href='#/glossary?term=Dialog'>Dialog</a>prinzip – ein generelles <a href='#/glossary?term=Ziel'>Ziel</a> für das Dialogdesign. Evtl. schwierig anzuwenden auf Grund der Allgemeingültigkeit.<br />b.\t<a href='#/glossary?term=Heuristik'>Heuristik</a> – Eine Daumenregel die bei der Erreichung von <a href='#/glossary?term=Dialogprinzipien'>Dialogprinzipien</a> hilft. Diese ist spezifischer und einfacher anzuwenden als ein Dialogprinzip.<br />Beispiele für Gestaltungsregeln:<br />1.\tFür alle Steuerelemente, wie z.B. Buttons, wähle den zuverlässigsten, sichersten Wert als Voreinstellung um den Datenverlust bzw. den risikablen Systemzugriff zu verhindern. Wenn Sicherheit und Schutz der Daten keine relevanten Faktoren sind, wähle den häufigsten oder bequemsten Wert.<br />2. \tDas Firmenlogo muss in der oberen, linken Ecke jeder Seite erscheinen. Die Position muss exakt die gleiche sein wie die auf der Homepage. Klicken auf das Logo muss die Anzeige der Homepage zur Folge haben.<br />3. \tDie Höhe eines Buttons muss 23 Pixel betragen",
    "term-english": "Guideline",
    "term-german": "Gestaltungsregel"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "A generally recognized rule of thumb that helps to achieve <a href='#/glossary?term=Usability'>usability</a>.<br />Notes:<br />1.\tHeuristics mainly serve to ensure usability (rather than usefulness).<br />2.\tCompare heuristic to<br />a.\t<a href='#/glossary?term=Dialogue'>Dialogue</a> principle – a general <a href='#/glossary?term=Goal'>goal</a> for the design of dialogues. May be difficult to apply because of its generality<br />b.\t<a href='#/glossary?term=User'>User</a> interface <a href='#/glossary?term=Guideline'>guideline</a> – Low-level specific rule for interface design.<br />Examples of generally recognized heuristics (by Jakob Nielsen and Rolf Molich):<br />1.\tFollow real world conventions. <br />For example, speak the users' language.<br />2.\tFollow platform conventions.<br />3.\tMinimize the user's memory load by making objects, actions, and options visible.<br />4.\tProvide appropriate feedback within reasonable time.<br />5.\tHelp users recognize, diagnose, and recover from errors.",
    "description-german": "Eine allgemein anerkannte Daumenregel die hilft <a href='#/glossary?term=Usability'>Usability</a> zu erreichen.<br />Anmerkungen:<br />Heuristiken dienen hauptsächlich dazu, Usability zu gewährleisten (und nicht Nützlichkeit). <br />Vergleiche Heuristik mit<br />a.  <a href='#/glossary?term=Dialog'>Dialog</a>prinzip – ein allgemeines <a href='#/glossary?term=Ziel'>Ziel</a> für das Design von Dialogen. Ist möglicherweise schwieriger anzuwenden auf Grund seiner Allgemeingültigkeit. <br />b.  <a href='#/glossary?term=Gestaltungsregel'>Gestaltungsregel</a> – einfache, aber  spezifische Regel für Gestaltung von Benutzungs­schnittstellen.<br />Beispiele allgemein anerkannter Heuristiken (von Jakob Nielsen und Rolf Molich):<br />1.\tBeachte Konventionen der realen Welt, z.B. sprich die Sprache der <a href='#/glossary?term=Benutzer'>Benutzer</a><br />2.\tBeachte Konventionen der verwendeten Plattform<br />3.\tMinimiere die Notwendigkeit zur Erinnerung beim Benutzers in dem Objekte, Handlungen und Optionen sichtbar gemacht werden.<br />4.\tBiete angemessenes Feedback innerhalb angemessener Zeit<br />5.\tHilf Benutzern beim Erkennen, Verstehen und Beseitigen von Fehlern.<br />",
    "term-english": "Heuristic",
    "term-german": "Heuristik"
  },
  {
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "A <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> method in which one or more evaluators, preferably experts, compare an <a href='#/glossary?term=Interactive system'>interactive system</a> to a list of <a href='#/glossary?term=Heuristic'>heuristic</a>s and identify where the interactive system does not follow those heuristics.<br />Notes: <br />1.\tThe list of heuristics must be manageable. Usually about 10 heuristics are used.<br />2.\tExperts can be usability experts or subject matter experts (\"single experts\"), or both (\"double experts\").",
    "description-german": "Eine Methode der <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a> bei der ein oder mehrere Begutachter – vorzugsweise Experten – ein <a href='#/glossary?term=Interaktives System'>interaktives System</a> mit einer Liste von <a href='#/glossary?term=Heuristik'>Heuristik</a>en vergleichen und feststellen an welchen Stellen das interaktive System diesen Heuristiken nicht folgt.<br />Anmerkungen:<br />1.\tDie Liste der Heuristiken muss handhabbar sein. Üblicherweise werden etwa 10 Heuristiken benutzt.<br />2.\tExperten können <a href='#/glossary?term=Usability'>Usability</a>-Experten oder Experten im Anwendungsbereich sein.",
    "term-english": "Heuristic evaluation",
    "term-german": "Heuristische Evaluierung"
  },
  {
    "categories": [
      "Test",
      "System"
    ],
    "description-english": "A software <a href='#/glossary?term=Prototype'>prototype</a> of the <a href='#/glossary?term=User'>user</a> interface to the <a href='#/glossary?term=Interactive system'>interactive system</a> that is being designed. A high-fidelity prototype resembles the finished interactive system and may or may not be interactive.<br />Note: <br />1.\tCompare to <a href='#/glossary?term=Low-fidelity prototype'>low-fidelity prototype</a>.<br />2.\tHigh fidelity prototypes can be constructed either using a prototyping application or using office software (such as PowerPoint).",
    "description-german": "Ein Software <a href='#/glossary?term=Prototyp'>Prototyp</a> der <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a> des zu designenden interaktiven Systems. Ein high-fidelity-Prototyp ähnelt dem fertigen interaktiven System und kann interaktiv oder nicht interaktiv sein.<br />Anmerkungen:<br />1.\tVergleiche mit <a href='#/glossary?term=Low-fidelity-Prototyp'>low-fidelity-Prototyp</a>.<br />2.\tHigh-fidelity-Prototypen können entweder mit einem Programm zum Prototyping oder mit einem Büroprogramm (wie z.B. PowerPoint) entworfen werden. ",
    "term-english": "High-fidelity prototype",
    "term-german": "High-fidelity-Prototyp"
  },
  {
    "categories": [
      "Anforderungen",
      "Prinzipien"
    ],
    "description-english": "A family of standards covering <a href='#/glossary?term=Human-centred design'>human-centred design</a>.<br />Note:<br />1.\tISO 9241 includes standards related to <br />a.\tSoftware ergonomics, <br />b.\tThe human-centred design process, <br />c.\tDisplays and display related hardware, <br />d.\tPhysical input devices, <br />e.\tWorkplace ergonomics, <br />f.\t<a href='#/glossary?term=Environment'>Environment</a> ergonomics, <br />g.\tControl centres, <br />h.\tTactile and haptic interactions.",
    "description-german": "Eine Reihe von Standards, die die <a href='#/glossary?term=Menschzentrierte Gestaltung'>menschzentrierte Gestaltung</a> interaktiver Systeme betrifft.  <br />Anmerkung:<br />1.\tISO 9241 beinhaltet Standards zu den Themen<br />a.\tSoftware-Ergonomie<br />b.\tProzess menschzentrierter Gestaltung<br />c.\tDisplays und Display bezogene Hardware<br />d.\tPhysikalisches Eingabegeräte<br />e.\tErgonomie des Arbeitsplatzes<br />f.\tErgonomie der <a href='#/glossary?term=Umgebung'>Umgebung</a><br />g.\tKontrollzentren<br />h.\tTaktile und haptische Interaktionen",
    "term-english": "ISO 9241",
    "term-german": "ISO 9241"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "Person who directly uses the output of the <a href='#/glossary?term=Interactive system'>interactive system</a>, but does not interact directly with the system.<br />Example of an indirect <a href='#/glossary?term=User'>user</a>: <br />1.\tA bank customer who receives a paper or electronic statement, or visits a branch is an in<a href='#/glossary?term=Direct user'>direct user</a> of the output produced by the bank computer system.",
    "description-german": "Personen, die direkt die Ergebnisse eines interaktiven Systems nutzen, aber nicht direkt mit dem System interagieren. <br />Beispiel für in<a href='#/glossary?term=Direkter <a href='#/glossary?term=Benutzer'>Benutzer</a>'>direkter Benutzer</a>:<br />1.\tEin Bankkunde, der ein Dokument oder einen elektronischen Bericht erhält, oder eine Filiale besucht, ist ein indirekter Benutzer eines Arbeitsergebnisses, das mit Hilfe eines Systems erzeugt wurde, das die Mitarbeiter der Bank benutzen.",
    "term-english": "Indirect user",
    "term-german": "Indirekter Benutzer"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "The property of a <a href='#/glossary?term=Dialogue'>dialogue</a> that allows <a href='#/glossary?term=User'>user</a>s to modify interaction and presentation of information to suit their individual capabilities and needs.<br />Note: <br />1.\tSuitability for individuali­zation is a dialogue principle.",
    "description-german": "Die Eigenschaft eines <a href='#/glossary?term=Dialog'>Dialog</a>s die <a href='#/glossary?term=Benutzer'>Benutzer</a> ermöglicht die Interaktion mit dem System und die Darstellung von Informationen an ihre individuellen Fähigkeiten und Bedürfnisse anpassen zu können.<br />Anmerkung:<br />1.\tIndividualisierbarkeit ist ein Dialogprinzip.",
    "term-english": "Suitability for individualization",
    "term-german": "Individualisierbarkeit"
  },
  {
    "categories": [
      "Rollen",
      "Gestaltung"
    ],
    "description-english": "A person who creates and organizes the structure of information to enable each <a href='#/glossary?term=User'>user</a> group to efficiently locate required information when using <a href='#/glossary?term=Interactive system'>interactive system</a>s. <br />Note: <br />1.\tInformation architect is a process <a href='#/glossary?term=Role'>role</a> in <a href='#/glossary?term=Human-centred design'>human-centred design</a>.",
    "description-german": "Eine Person die die Struktur von Information in interaktiven Systemen für das effiziente Auffinden durch jede <a href='#/glossary?term=Benutzergruppe'>Benutzergruppe</a> kreiert und organisiert.<br />Anmerkung:<br />1.\tInformationsarchitekt ist eine <a href='#/glossary?term=Rolle'>Rolle</a> im Prozess der menschzentrierten Gestaltung.",
    "term-english": "Information architect",
    "term-german": "Informationsarchitekt"
  },
  {
    "categories": [
      "Gestaltung",
      "Anforderungen"
    ],
    "description-english": "The naming and structuring of the information that must be accessible to the <a href='#/glossary?term=User'>user</a>, including <a href='#/glossary?term=Task'>task</a> objects, system objects (such as printers) and additional information that users need.",
    "description-german": "Die Benennung und Strukturierung der Informationen die für den <a href='#/glossary?term=Benutzer'>Benutzer</a> erreichbar sein müssen einschließlich der <a href='#/glossary?term=Nutzungsobjekt'>Nutzungsobjekt</a>e, Systemobjekte (wie z.B. „Drucker“) und weiterer für den Benutzer erforderlichen Informationen. ",
    "term-english": "Information architecture",
    "term-german": "Informationsarchitektur"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> – Inspection based",
    "description-german": "Siehe <a href='#/glossary?term=Inspektionsbasierte <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a>'>inspektionsbasierte <a href='#/glossary?term=Usability'>Usability</a>-Evaluierung</a>",
    "term-english": "Inspection",
    "term-german": "Inspektion"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "<a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> based on the judgment of one or more evaluators who examine or use an <a href='#/glossary?term=Interactive system'>interactive system</a> to identify potential usability <a href='#/glossary?term=Problem'>problem</a>s and deviations from established criteria.<br />Notes:<br />1.\t<a href='#/glossary?term=Inspection'>Inspection</a>-based <a href='#/glossary?term=Usability evaluation'>usability evaluation</a> is often performed by usability experts or subject matter experts who base their judgement on prior experience of <a href='#/glossary?term=Usability problem'>usability problem</a>s encountered by <a href='#/glossary?term=User'>user</a>s and their own knowledge of ergonomic <a href='#/glossary?term=User interface'>user interface</a> <a href='#/glossary?term=Guideline'>guideline</a>s and <a href='#/glossary?term=Styleguide'>styleguide</a>s.<br />2.\t<a href='#/glossary?term=Heuristic'>Heuristic</a> evaluation is a technique for inspection based usability evaluation.",
    "description-german": "<a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a> die auf der Beurteilung ein oder mehrerer Evaluatoren basiert, die ein <a href='#/glossary?term=Interaktives System'>interaktives System</a> prüfen oder benutzen, um potentielle <a href='#/glossary?term=Usability-Problem'>Usability-Problem</a>e und Abweichungen von anerkannten Kriterien zu identifizieren.<br />Anmerkungen:<br />1.\t<a href='#/glossary?term=Inspektion'>Inspektion</a>sbasierte <a href='#/glossary?term=Usability'>Usability</a>-Evaluierung wird oft von Usability-Experten oder Fachexperten durchgeführt, die ihre Urteile auf die frühere Erfahrung mit Usability-Problemen und ihr eigenes Wissen über <a href='#/glossary?term=Gestaltungsregel'>Gestaltungsregel</a>n und <a href='#/glossary?term=Styleguide'>Styleguide</a>s gründen.<br />2.\t<a href='#/glossary?term=Heuristische Evaluierung'>Heuristische Evaluierung</a> ist eine Vorgehensweise für Inspektionsbasierte Usability-Evaluierung.",
    "term-english": "Usability evaluation – Inspection based",
    "term-german": "Inspektionsbasierte Usability-Evaluierung"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who defines and designs the interaction between humans and system based on <a href='#/glossary?term=User'>user</a> <a href='#/glossary?term=Requirement'>requirement</a>s and the <a href='#/glossary?term=Context of use'>context of use</a>.<br />Note: <br />1.\tScenarios and <a href='#/glossary?term=Persona'>persona</a>s are also important bases for the work of the interaction designer<br />2.\tInteraction designer is a process <a href='#/glossary?term=Role'>role</a> in <a href='#/glossary?term=Human-centred design'>human-centred design</a>. ",
    "description-german": "Eine Person die die Interaktion zwischen Mensch und System auf Basis der Nutzungs­<a href='#/glossary?term=Anforderung'>anforderung</a>en und <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> definiert und konzipiert. <br />Anmerkung:<br />1.\tSzenarien und <a href='#/glossary?term=Persona'>Persona</a>s sind auch wichtige Grundlagen für die Arbeit des Interaktionsdesigners.<br />2.\tInteraktionsdesigner ist eine <a href='#/glossary?term=Rolle'>Rolle</a> im Prozess der menschzentrierten Gestaltung.",
    "term-english": "Interaction designer",
    "term-german": "Interaktionsdesigner"
  },
  {
    "categories": [
      "System",
      "Anforderungen"
    ],
    "description-english": "A combination of hardware, software and/or services that receives input from, and communicates output to, <a href='#/glossary?term=User'>user</a>s.<br />Note: <br />1.\tThis includes, where appropriate, packaging, branding, <a href='#/glossary?term=User documentation'>user documentation</a>, on-line help, support and training.",
    "description-german": "Kombination von Hardware-, Software- und Servicekomponenten, die Eingaben von einem <a href='#/glossary?term=Benutzer'>Benutzer</a> empfängt und Ausgaben zu einem Benutzer übermittelt.<br />Anmerkung:<br />1.\tDas schließt, wo relevant, Verpackung, Branding, <a href='#/glossary?term=Benutzerdokumentation'>Benutzerdokumentation</a>, <a href='#/glossary?term=Onlinehilfe'>Onlinehilfe</a>, Support und Training mit ein.  ",
    "term-english": "Interactive system",
    "term-german": "Interaktives System"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "Individual or organization having a right, share, claim or interest in an <a href='#/glossary?term=Interactive system'>interactive system</a> or in its possession of characteristics that meet their needs and expectations.<br />Notes:<br />1.\tAll <a href='#/glossary?term=User'>user</a>s are stakeholders.<br />2.\tSee also the various types of <a href='#/glossary?term=Requirement'>requirement</a>s.<br />3.\tThe following examples illustrate the breadth of this concept. <br />Examples of stakeholders: <br />1.\tUsers, supporters, trainers, documentation writers, developers, managers of developers, and marketing people.",
    "description-german": "Individuum oder Organisation, die ein Anrecht, einen Anteil, einen Anspruch oder ein Interesse auf ein <a href='#/glossary?term=Interaktives System'>interaktives System</a> oder an dessen Merkmalen hat, die ihren <a href='#/glossary?term=Erfordernis'>Erfordernis</a>sen und Erwartungen entsprechen. <br />Anmerkungen: <br />1.\tAlle <a href='#/glossary?term=Benutzer'>Benutzer</a> sind Interessenvertreter.<br />2.\tSiehe auch unterschiedliche Typen von <a href='#/glossary?term=Anforderung'>Anforderung</a>en<br />3.\tDie folgenden Beispiele für Interessenvertreter zeigen die breite Perspektive dieses Begriffs<br />4.\tDer englische Ausdruck für Interessenvertreter ist Stakeholder<br />Beispiele für Interessenvertreter: <br />1.\tBenutzer, Support, Trainer, Autoren von Dokumentationen, Entwickler, Manager von Entwicklern und Personen im Marketing.",
    "term-english": "Stakeholder",
    "term-german": "Interessenvertreter"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "What the <a href='#/glossary?term=Interactive system'>interactive system</a> should be capable of from the point of view of the <a href='#/glossary?term=Stakeholder'>stakeholder</a>s.",
    "description-german": "Was das interaktive System aus Sicht des <a href='#/glossary?term=Interessenvertreter'>Interessenvertreter</a>s leisten muss.<br />Anmerkung:<br />1.\tDer englische Ausdruck für Interessenvertreter<a href='#/glossary?term=Anforderung'>anforderung</a> ist Stakeholder requirement.",
    "term-english": "Stakeholder requirement",
    "term-german": "Interessenvertreteranforderung"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A data-gathering technique that studies a few carefully selected individuals in depth to arrive at a fuller understanding of the work practice across all <a href='#/glossary?term=User'>user</a>s. Through inquiry and interpretation, it reveals commonalities across an <a href='#/glossary?term=Interactive system'>interactive system</a>'s user base.<br />Notes: <br />1.\tIn an interview, the interviewer (the user <a href='#/glossary?term=Requirement'>requirement</a>s engineer) typically conducts a <a href='#/glossary?term=Briefing'>briefing</a> and then asks questions to a user about current procedures and the planned interactive system. The interviewer uses an <a href='#/glossary?term=Interview checklist'>interview checklist</a> to ensure that all relevant questions are asked.<br />2.\tThe <a href='#/glossary?term=Master-apprentice model'>master-apprentice model</a> should be applied when conducting interviews<br />3.\tInterview questions should be <br />a.\tOpen rather than closed, <br />b.\tNeutral rather than leading.<br />4.\tCompare to <a href='#/glossary?term=Contextual interview'>contextual interview</a>, <a href='#/glossary?term=Pre-session interview'>pre-session interview</a> and <a href='#/glossary?term=Post-session interview'>post-session interview</a>.",
    "description-german": "Eine Methode der Datensammlung, die sorgfältig ausgewählte Individuen untersucht, um ein tiefes Verständnis der Arbeitstätigkeit der <a href='#/glossary?term=Benutzer'>Benutzer</a> zu erreichen. Durch die Befragung und Interpretation werden Gemeinsamkeiten und Unterschiede innerhalb der Benutzer  eines interaktiven Systems aufgedeckt.  <br />Anmerkungen: <br />1.\tIn einem Interview führt der Interviewer (der <a href='#/glossary?term=User Requirements Engineer'>User Requirements Engineer</a>) üblicherweise ein <a href='#/glossary?term=Briefing'>Briefing</a> durch und stellt danach dem Benutzer Fragen über die üblichen Abläufe vor dem Hintergrund des geplanten interaktiven Systems. Der Interviewer nutzt eine <a href='#/glossary?term=Interviewcheckliste'>Interviewcheckliste</a>, um sicherzustellen, dass zu allen relevanten Aspekten befragt wurde.<br />2.\tDas <a href='#/glossary?term=Meister-Schüler-Modell'>Meister-Schüler-Modell</a> sollte beim Interview Anwendung finden.<br />3.\tInterviewfragen sollten <br />a.\teher offen als geschlossen<br />b.\teher neutral als suggestiv<br />formuliert sein.<br />4.\tVergleiche <a href='#/glossary?term=Kontextuelles Interview'>kontextuelles Interview</a>, <a href='#/glossary?term=Pre-Session Interview'>Pre-Session Interview</a> und <a href='#/glossary?term=Post-Session Interview'>Post-Session Interview</a>",
    "term-english": "Interview",
    "term-german": "Interview"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "A written list of suitable questions and cues used by an <a href='#/glossary?term=Interview'>interview</a>er during an interview to make sure that all relevant topics are addressed.",
    "description-german": "Eine schriftliche Liste passender Fragen und Hinweise, die während eines <a href='#/glossary?term=Interview'>Interview</a>s verwendet wird, um sicherzustellen, dass alle relevanten Themen berücksichtigt werden.",
    "term-english": "Interview checklist",
    "term-german": "Interviewcheckliste"
  },
  {
    "categories": [
      "Anforderungen",
      "Planung"
    ],
    "description-english": "Use of the <a href='#/glossary?term=Interactive system'>interactive system</a> is easy to understand, regardless of the <a href='#/glossary?term=User'>user</a>'s experience, knowledge, language skills, or current concentration level. <br />Note: <br />1.\t<a href='#/glossary?term=Affordance'>Affordance</a>s and <a href='#/glossary?term=Self-descriptiveness'>self-descriptiveness</a> are means to make an interactive system intuitive.",
    "description-german": "Die Benutzung des interaktiven Systems ist unmittelbar zu verstehen – unabhängig von der Erfahrung, vom Wissen, von den Sprachkenntnissen oder vom momentanen Konzentrationsgrad des <a href='#/glossary?term=Benutzer'>Benutzer</a>s.<br />Anmerkung:<br />1.\t<a href='#/glossary?term=Affordance'>Affordance</a> und <a href='#/glossary?term=Selbstbeschreibungsfähigkeit'>Selbstbeschreibungsfähigkeit</a> sind Mittel, ein <a href='#/glossary?term=Interaktives System'>interaktives System</a> intuitiv zu gestalten.",
    "term-english": "Intuitive",
    "term-german": "Intuitiv"
  },
  {
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "description-english": "Repetitive.<br />An iterative process repeats steps in the <a href='#/glossary?term=Human-centred design'>human-centred design</a> process until a <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> of the <a href='#/glossary?term=User'>user</a> interface shows that the user <a href='#/glossary?term=Requirement'>requirement</a>s have been adequately met.",
    "description-german": "Wiederholend.<br />Ein iteratives Vorgehen wiederholt Schritte des Prozesses der menschzentrierten Gestaltung solange, bis eine <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a> der <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a> zeigt, dass die <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Anforderung'>anforderung</a>'>Nutzungsanforderung</a>en ausreichend erfüllt sind.",
    "term-english": "Iterative",
    "term-german": "Iterativ"
  },
  {
    "categories": [
      "Prinzipien",
      "Evaluierung"
    ],
    "description-english": "The same information is presented in the same way throughout the <a href='#/glossary?term=Interactive system'>interactive system</a>, in accordance with the <a href='#/glossary?term=User'>user</a>’s expectation.<br />Notes:<br />1.\tConsistency is an aspect of <a href='#/glossary?term=Conformity with user expectations'>Conformity with user expectations</a>.<br />2.\tConsistency is relevant on several levels, for example <br />a.\twithin a screen;<br />b.\tacross screens in the same interactive system;<br />c.\tacross interactive systems from the same manufacturer;<br />d.\tacross similar interactive systems from different manufacturers.",
    "description-german": "Die gleiche Information wird in gleicher Weise innerhalb des gesamten interaktiven Systems entsprechend der <a href='#/glossary?term=Benutzer'>Benutzer</a>erwartung dargestellt.<br />Anmerkungen:<br />1.\tKonsistenz ist eine Komponente der <a href='#/glossary?term=Erwartungskonformität'>Erwartungskonformität</a>. <br />2.\tKonsistenz ist auf verschiedenen Ebenen relevant wie zum Beispiel <br />a.\tinnerhalb einer Bildschirmanzeige,<br />b.\tzwischen den Bildschirmanzeigen desselben interaktiven Systems, <br />c.\tzwischen interaktiven Systemen desselben Herstellers,<br />d.\tzwischen ähnlichen interaktiven Systemen unterschiedlicher Hersteller.",
    "term-english": "Consistency",
    "term-german": "Konsistenz"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "An <a href='#/glossary?term=Interview'>interview</a> that takes place at the location where the <a href='#/glossary?term=User'>user</a>'s interaction with the <a href='#/glossary?term=Interactive system'>interactive system</a> usually takes place, for example the user's workplace.<br />Note:<br />1.\t\"Contextual interview\" is often referred to as \"Contextual inquiry\".",
    "description-german": "Ein <a href='#/glossary?term=Interview'>Interview</a> das dort stattfindet wo die Interaktion des <a href='#/glossary?term=Benutzer'>Benutzer</a>s mit dem interaktiven System üblicherweise stattfindet, z.B. am Arbeitsplatz des Benutzers.<br />Anmerkungen: <br />1.\t„Kontextuelles Interview“ wird auf Englisch oft als „Contextual inquiry“ bezeichnet.",
    "term-english": "Contextual interview",
    "term-german": "Kontextuelles Interview"
  },
  {
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "A <a href='#/glossary?term=Dialogue'>dialogue</a> is suitable for learning when it supports and guides the <a href='#/glossary?term=User'>user</a> in learning to use the <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Notes: <br />1.\tRecommendations for observing the dialogue principle:<br />a.\tThe dialogue should provide sufficient feedback about the intermediary and final results of an activity so that the user learns from successfully accomplished activities.<br />b.\tIf appropriate to the <a href='#/glossary?term=Task'>task</a>s and learning <a href='#/glossary?term=Goal'>goal</a>s, the interactive system should allow the user to explore (“try out”) dialogue steps without negative consequences.<br />2.\tSuitability for learning is a dialogue principle.<br />Example of suitability for learning:<br />1.\tWhen users reserve a room using a hotel room reservation system, the users receive step-by-step feedback to refine their queries and details about the successful reservation of the room.",
    "description-german": "Die Eigenschaft eines <a href='#/glossary?term=Dialog'>Dialog</a>s die <a href='#/glossary?term=Benutzer'>Benutzer</a> beim Erlernen der Nutzung des interaktiven Systems zu unterstützen und anzuleiten.<br />Anmerkungen:<br />1.\tEmpfehlungen zur Befolgung des Dialogprinzips:<br />a.\tDer Dialog sollte ausreichende Rückmeldung über Zwischen- und Endergebnisse von Handlungen bereitstellen, damit die Benutzer von erfolgreich ausgeführten Handlungen lernen.<br />b.\tFalls es zu den <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n und den Lern<a href='#/glossary?term=Ziel'>ziel</a>en passt, sollte das interaktive System dem Benutzer erlauben, Dialogschritte ohne nachteilige Auswirkungen auszuprobieren.<br />2.\tLernförderlichkeit ist ein Dialogprinzip.<br />Beispiel für Lernförderlichkeit:<br />1.\tWenn Benutzer mit Hilfe eines Hotelzimmerreservierungssystems ein Zimmer reservieren, erhalten die Benutzer Schritt für Schritt Rückmeldungen, um ihre Anfrage zu verfeinern und immer mehr Details über den Fortschritt der erfolgreichen Zimmerreservierung.",
    "term-english": "Suitability for learning",
    "term-german": "Lernförderlichkeit"
  },
  {
    "categories": [
      "Test",
      "System"
    ],
    "description-english": "A low-cost, simple illustration of a design or concept used to gather <a href='#/glossary?term=User'>user</a> feedback at the very early stages of design<br />Notes:<br />1.\tA low-fidelity <a href='#/glossary?term=Prototype'>prototype</a> is often created using paper, pens, sticky notes and so on. Screen mockups are often made by using a <a href='#/glossary?term=Wireframe'>wireframe</a> prototyping tool.<br />2.\tA low-fidelity prototype may be operated by a human being instead of a computer. <br />3.\tA low-fidelity prototype should be capable of being updated in moments.<br />4.\tCompare to prototype and <a href='#/glossary?term=High-fidelity prototype'>high-fidelity prototype</a>.",
    "description-german": "Eine einfache und preiswerte Veranschaulichung eines Designs oder eines Begriffs. Wird benutzt, um <a href='#/glossary?term=Benutzer'>Benutzer</a>-Feedback in frühen Phasen der Entwicklung einzuholen<br />Anmerkungen: <br />1.\tEin low-fidelity-<a href='#/glossary?term=Prototyp'>Prototyp</a> wird häufig mit Hilfe von Papier, Stiften, Haftzetteln usw. erstellt. <br />2.\tEin low-fidelity-Prototyp wird üblicherweise von einem Menschen und nicht durch einen Computer betrieben.<br />3.\tEin low-fidelity-Prototyp sollte so hinterlegt sein, dass er unmittelbar modifiziert werden kann.<br />4.\tVergleiche mit <a href='#/glossary?term=High-fidelity-Prototyp'>high-fidelity-Prototyp</a>.",
    "term-english": "Low-fidelity prototype",
    "term-german": "Low-fidelity-Prototyp"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "A <a href='#/glossary?term=Requirement'>requirement</a> for an <a href='#/glossary?term=Interactive system'>interactive system</a> based on marketing policy aimed at maximizing business opportunities, purchase and use.<br />Notes:<br />1.\tMarket requirements are often referred to as customer requirements.<br />Example of market requirement:<br />1.\t\"The website must be at least as usable as that of the two top competitors\"",
    "description-german": "Eine <a href='#/glossary?term=Anforderung'>Anforderung</a> an ein <a href='#/glossary?term=Interaktives System'>interaktives System</a>, die aus der Absatzpolitik des Anbieters abgeleitet ist und darauf ab<a href='#/glossary?term=Ziel'>ziel</a>t, Geschäftschancen, Verkäufe und die Nutzung des interaktiven Systems zu maximieren.<br />Anmerkungen:<br />1.\tHäufig werden Marktanforderungen Kundenanforderungen genannt.<br />Beispiel für Marktanforderung: <br />1.\t„Die Webseite muss mindestens so benutzbar sein wie jene der zwei stärksten Wettbewerber.“",
    "term-english": "Market requirement",
    "term-german": "Marktanforderung"
  },
  {
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "A principle for a successful <a href='#/glossary?term=Interview'>interview</a>: The interviewer treats the <a href='#/glossary?term=User'>user</a> as the Master while the interviewer is the Apprentice. The interviewer asks because they sincerely want to learn – not to demonstrate their knowledge",
    "description-german": "Ein Verhaltensprinzip für ein erfolgreiches <a href='#/glossary?term=Interview'>Interview</a>:  Der Interviewer behandelt den <a href='#/glossary?term=Benutzer'>Benutzer</a> als den Meister während der Interviewer selbst der Schüler ist. Der Interviewer demonstriert nicht sein Wissen, sondern stellt seine Fragen mit dem <a href='#/glossary?term=Ziel'>Ziel</a> etwas zu lernen.",
    "term-english": "Master-apprentice model",
    "term-german": "Meister-Schüler-Modell"
  },
  {
    "categories": [
      "Planung",
      "Gestaltung"
    ],
    "description-english": "An approach to design that aims to make <a href='#/glossary?term=Interactive system'>interactive system</a>s more usable by focusing on the use of the interactive system and applying human factors, ergonomics and <a href='#/glossary?term=Usability'>usability</a> knowledge and techniques.<br />Notes:<br />1.\tThe concept \"human-centred design\" is used instead of \"<a href='#/glossary?term=User'>user</a>-centred design\" to emphasise the need to consider additional <a href='#/glossary?term=Stakeholder'>stakeholder</a>s who may not be users.<br />2.\tFeedback from users through usability <a href='#/glossary?term=Evaluation'>evaluation</a> is a critical source of information in human-centred design.",
    "description-german": "Herangehensweise bei der Gestaltung und Entwicklung von interaktiven Systemen, die darauf ab<a href='#/glossary?term=Ziel'>ziel</a>t, diese gebrauchtauglicher zu machen indem sie sich auf die Verwendung des interaktiven Systems konzentriert und Kenntnisse und Techniken aus den Bereichen der Arbeitswissenschaft, Ergonomie und der Gebrauchstauglichkeit anwendet.<br />Anmerkungen:<br />1.\tDer Begriff “menschzentrierte Gestaltung” wird statt “<a href='#/glossary?term=Benutzer'>benutzer</a>zentrierter Gestaltung” verwendet, um auch die <a href='#/glossary?term=Erfordernis'>Erfordernis</a>se weiterer <a href='#/glossary?term=Interessenvertreter'>Interessenvertreter</a> einzuschliessen, die nicht unbedingt Benutzer sind.<br />2.\tFeedback von Benutzern aus <a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Evaluierung'>Evaluierung</a>en ist eine wichtige Informationsquelle in der menschzentrierten Gestaltung.",
    "term-english": "Human-centred design",
    "term-german": "Menschzentrierte Gestaltung"
  },
  {
    "categories": [
      "Planung"
    ],
    "description-english": "The perception people have of themselves, others, the <a href='#/glossary?term=Environment'>environment</a>, and the things with which they interact. <br />Notes: <br />1.\tAlternative, popular definition: A person's thought process about how something works in the real world.<br />2.\tPeople form mental models through experience, training, and instruction. The mental model of an <a href='#/glossary?term=Interactive system'>interactive system</a> is formed largely by interpreting its perceived actions and its visible structure. Expectations resulting from the use of other or similar systems are also of importance.<br />3.\tIf a <a href='#/glossary?term=User'>user</a>'s mental model of an interactive system is incomplete or contradictory, then the user cannot easily use the interactive system.",
    "description-german": "Die Vorstellung, die Menschen von sich, anderen, der <a href='#/glossary?term=Umgebung'>Umgebung</a> und den Dingen haben, mit denen sie interagieren. <br />Anmerkungen: <br />1.\tAlternative, populäre Definition: Der Denkprozess einer Person darüber, wie etwas in der realen Welt funktioniert.<br />2.\tMenschen generieren mentale Modelle aufgrund von Erfahrung, Training und Instruktion. Das mentale Modell bezüglich eines interaktiven Systems wird größtenteils durch die Interpretation von wahrgenommenen Aktionen und sichtbaren Strukturen gebildet. Die Erwartung durch die Benutzung anderer oder ähnlicher Systeme spielt auch eine <a href='#/glossary?term=Rolle'>Rolle</a>.<br />3.\tWenn ein mentales Modell eines <a href='#/glossary?term=Benutzer'>Benutzer</a>s von einem interaktiven System unvollständig oder widersprüchlich ist, dann kann der Benutzer das interaktive System nicht hindernisfrei benutzen.",
    "term-english": "Mental model",
    "term-german": "Mentales Modell"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "The activity carried out by a <a href='#/glossary?term=Moderator'>moderator</a> in a <a href='#/glossary?term=Usability'>usability</a> test or <a href='#/glossary?term=Focus group'>focus group</a>.",
    "description-german": "Die durch einen <a href='#/glossary?term=Moderator'>Moderator</a> während eines <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s oder einer <a href='#/glossary?term=Fokusgruppe'>Fokusgruppe</a> ausgeübte Tätigkeit.",
    "term-english": "Moderation",
    "term-german": "Moderation"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A neutral person who conducts a <a href='#/glossary?term=Usability'>usability</a> test session or a <a href='#/glossary?term=Focus group'>focus group</a> session.<br />Notes:<br />1. \tModerator is a <a href='#/glossary?term=Role'>role</a> in a <a href='#/glossary?term=Usability test'>usability test</a> session or focus group session.<br />2.\tThe moderator's <a href='#/glossary?term=Task'>task</a>s during a <a href='#/glossary?term=Usability test session'>usability test session</a> are described under usability test session.<br />3.\t<a href='#/glossary?term=Facilitator'>Facilitator</a> is a frequently used synonym for moderator.",
    "description-german": "Eine neutrale Person die eine <a href='#/glossary?term=Usability-Testsitzung'>Usability-Testsitzung</a> oder eine <a href='#/glossary?term=Fokusgruppe'>Fokusgruppe</a> leitet.<br />Anmerkungen: <br />1.\tModerator ist eine <a href='#/glossary?term=Rolle'>Rolle</a> in einer <a href='#/glossary?term=Usability-Test'>Usability-Test</a>sitzung oder in einer Fokusgruppensitzung.<br />2.\tDie typischen <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n des Moderators während einer <a href='#/glossary?term=Usability'>Usability</a>-Testsitzung sind beim Begriff Usability-Testsitzung beschrieben.<br />3.\tAuf Englisch wird <a href='#/glossary?term=Facilitator'>Facilitator</a> oft als Synonym für Moderator verwendet.",
    "term-english": "Moderator",
    "term-german": "Moderator"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "See Post-session <a href='#/glossary?term=Interview'>interview</a>.",
    "description-german": "Siehe <a href='#/glossary?term=Post-Session <a href='#/glossary?term=Interview'>Interview</a>'>Post-Session Interview</a>.",
    "term-english": "Debriefing",
    "term-german": "Nachbesprechung"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "The logical organization of the units of displayed information that comprise the <a href='#/glossary?term=User'>user</a> interface.<br />Notes:<br />1.\tIn practice, the \"units of displayed information\" are often screens, pages or windows.<br />2.\tThe navigation structure comprises: <br />a.\tThe logical structure, for example hierarchy, the order and grouping of elements of the <a href='#/glossary?term=User interface'>user interface</a> and navigation items.<br />b.\tThe navigation elements that are used to navigate the structure, for example menus and breadcrumbs.<br />3.\tThe navigation structure is part of the <a href='#/glossary?term=Information architect'>information architect</a>ure. The information architect is responsible, and creates it together with the <a href='#/glossary?term=Interaction designer'>interaction designer</a>.",
    "description-german": "Die logische Organisation der angezeigten Informationseinheiten der <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a>.<br />Anmerkungen:<br />1.\tIn der Praxis sind die „angezeigten Informationseinheiten“ oft Bildschirminhalte, Seiten oder Fenster.<br />2.\tDie Navigationsstruktur umfasst: <br />a.\tDie logische Struktur, zum Beispiel Hierarchie, Anordnung sowie Gruppierung von Bestandteilen des User Interfaces bzw. Navigationsitems.<br />b.\tDie Navigationsmittel zum Navigieren in der Struktur, zum Beispiel Menü und Brotkrumen<br />3.\tDie Navigationsstruktur ist ein Teil der <a href='#/glossary?term=Informationsarchitektur'>Informationsarchitektur</a>. Verantwortlich ist der <a href='#/glossary?term=Informationsarchitekt'>Informationsarchitekt</a> – er kann das aber nicht ohne den <a href='#/glossary?term=Interaktionsdesigner'>Interaktionsdesigner</a> festlegen.",
    "term-english": "Navigation structure",
    "term-german": "Navigationsstruktur"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A question in an <a href='#/glossary?term=Interview'>interview</a> that has no built-in assumptions, and no frame that excludes anything or directs the reply in a certain direction. <br />Note:<br />1.\tCompare to <a href='#/glossary?term=Leading question'>leading question</a>.<br />Examples of neutral (and open) interview questions: <br />1.\tWhat happened?<br />2.\tWhat do you mean by that?<br />3.\tWhat possibilities do you have now?<br />4.\tWhat should the home page of the new car rental website look like?",
    "description-german": "Eine Frage in einem <a href='#/glossary?term=Interview'>Interview</a>, die keine impliziten Annahmen beinhaltet und auch keinen Ansatz bietet, einen Aspekt auszuschliessen oder die Antwort in eine bestimmte Richtung zu lenken. <br />Anmerkung:<br />1.\tVergleiche mit Suggestivfrage.<br />Beispiele für neutrale (und offene) Interviewfragen<br />1.\tWas ist passiert?<br />2.\tWas meinen Sie damit?<br />3.\tWelche Möglichkeiten haben Sie jetzt?<br />4.\tWie sollte die Homepage der neuen Autovermietungswebsite aussehen?",
    "term-english": "Neutral question",
    "term-german": "Neutrale Frage"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "<a href='#/glossary?term=Requirement'>Requirement</a> for use that provides the basis for design and <a href='#/glossary?term=Evaluation'>evaluation</a> of an <a href='#/glossary?term=Interactive system'>interactive system</a> to meet identified <a href='#/glossary?term=User'>user</a> needs.<br />Notes: <br />1.\tUser requirements are derived from <a href='#/glossary?term=User need'>user need</a>s. <br />2.\tA user requirement can be a <br /><a href='#/glossary?term=Qualitative user requirement'>qualitative user requirement</a> or a <a href='#/glossary?term=Quantitative user requirement'>quantitative user requirement</a>.",
    "description-german": "<a href='#/glossary?term=Anforderung'>Anforderung</a> an die Nutzung, die die Basis für die Gestaltung und <a href='#/glossary?term=Evaluierung'>Evaluierung</a> eines interaktiven Systems in Hinblick auf identifizierte <a href='#/glossary?term=Erfordernis'>Erfordernis</a>se bildet. <br />Anmerkungen:<br />1.\tNutzungsanforderungen werden von Erfordernissen abgeleitet.<br />2.\tEine Nutzungsanforderung kann eine qualitative Nutzungsanforderung oder eine <a href='#/glossary?term=Quantitative Nutzungsanforderung'>quantitative Nutzungsanforderung</a> sein.<br />3.\t„Nutzungsanforderung“ heisst auf Englisch „User requirement“.",
    "term-english": "User requirement",
    "term-german": "Nutzungsanforderung"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "<a href='#/glossary?term=User'>User</a>s, <a href='#/glossary?term=Task'>task</a>s, <a href='#/glossary?term=Resources'>resources</a>, and the physical and social <a href='#/glossary?term=Environment'>environment</a>s in which an <a href='#/glossary?term=Interactive system'>interactive system</a> is used <br />Notes:<br />1.\tThe results from <a href='#/glossary?term=Observation'>observation</a>s and contextual <a href='#/glossary?term=Interview'>interview</a>s are described in the \"context of use description\". This description is the basis for identifying <a href='#/glossary?term=User need'>user need</a>s and tracing them back to their source.<br />2.\tA context of use description describes<br />a.\t<a href='#/glossary?term=User group'>User group</a>s and <a href='#/glossary?term=User group profile'>user group profile</a>s, <br />b.\tTasks, <br />c.\tEnvironments,<br />d.\tEquipment,<br />e.\tScenarios illustrating what happens in the context of use<br />Course note:<br />1.\tHelpful acronym: PACT = People, Activities, Contexts, Technologies.<br />Examples of context of use descriptions: <br />1.\tTeenagers use mobile phones to send text messages to their friends while sitting on a bus. <br />2.\tSecretaries use Microsoft Word to write documents in a firm of solicitors.",
    "description-german": "<a href='#/glossary?term=Benutzer'>Benutzer</a>, <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n, <a href='#/glossary?term=Ressourcen'>Ressourcen</a> sowie die physische und soziale <a href='#/glossary?term=Umgebung'>Umgebung</a> in der das interaktive System genutzt wird.<br />Anmerkungen:<br />1.\tDie Ergebnisse aus den <a href='#/glossary?term=Beobachtung'>Beobachtung</a>en und kontextuellen <a href='#/glossary?term=Interview'>Interview</a>s werden in der ”Nutzungskontextbeschreibung” dokumentiert. Diese ist die Basis für das Identifizieren von <a href='#/glossary?term=Erfordernis'>Erfordernis</a>sen bzw. deren Zurückführbarkeit auf den Nutzungskontext.   <br />2. Eine Nutzungskontextbeschreibung beschreibt:<br />a.\t<a href='#/glossary?term=Benutzergruppe'>Benutzergruppe</a>n und <a href='#/glossary?term=Benutzergruppenprofil'>Benutzergruppenprofil</a>e,<br />b.\tAufgaben,<br />c.\tUmgebungen,<br />d.\tAusrüstung,<br />e.\tSzenarien, die illustrieren, was im Nutzungskontext geschieht<br />Anmerkung zum Training:<br />1.\tHilfreiche Abkürzung: PACT = <br />People (Benutzer), <br />Activities (Aufgaben), <br />Contexts (Umgebung), <br />Technologies (Ressourcen, Ausrüstung der Benutzer)<br />Beispiele:<br />1.\tJugendliche verwenden Handys, um ihren Freunden Textmitteilungen zu senden während sie in einem Bus sitzen. <br />2.\tSekretärinnen benutzen Microsoft Word, um Dokumente in einer Rechtskanzlei zu schreiben.",
    "term-english": "Context of use",
    "term-german": "Nutzungskontext"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "The key units of information, or data, with which <a href='#/glossary?term=User'>user</a>s interact in order to carry out their <a href='#/glossary?term=Task'>task</a>s. <br />Examples of task objects:<br />1.\tFor a customer management system: <br />- A letter to a customer;<br />\t- A list of the customer's unpaid bills;<br />\t- An order from the customer.<br />2.\tFor a train ticket vending machine:<br />\t- A ticket:<br />\t- A receipt for the purchase of a ticket;<br />\t- A travel plan.",
    "description-german": "Die wichtigsten Informationseinheiten oder Daten mit denen <a href='#/glossary?term=Benutzer'>Benutzer</a> interagieren, um ihre <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n durchzuführen.<br />Anmerkung:<br />1.\tDer englische Ausdruck für Nutzungsobjekt ist Task object.<br />Beispiele für Nutzungsobjekte:<br />1.\tFür ein Kundenmanagementsystem: <br />\t- Ein Brief an einen Kunden, <br />\t- Eine Liste unbezahlter Rechnungen des Kunden, <br />\t- Eine Auftrag von dem Kunden.<br />2.\tFür einen Automaten der Bahnkarten verkauft:<br />\t- Eine Fahrkarte,<br />\t- Eine Quittung für den Kauf einer Fahrkarte,<br />\t- Einen Reiseplan.",
    "term-english": "Task object",
    "term-german": "Nutzungsobjekt"
  },
  {
    "categories": [
      "Gestaltung",
      "Evaluierung"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> problem",
    "description-german": "Siehe <a href='#/glossary?term=Usability-Problem'>Usability-Problem</a>",
    "term-english": "Problem",
    "term-german": "Nutzungsproblem"
  },
  {
    "categories": [
      "Test",
      "Planung"
    ],
    "description-english": "See scenario",
    "description-german": "Siehe <a href='#/glossary?term=Szenario'>Szenario</a>",
    "term-english": "Use scenario",
    "term-german": "Nutzungsszenario"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A question in an <a href='#/glossary?term=Interview'>interview</a> that does not give any indication of the expected format or content of the answer.<br />Notes: <br />1.\tOpen questions are desirable in interviews because they invite <a href='#/glossary?term=User'>user</a>s to start talking and provide extensive answers to questions. <br />2.\tCompare to <a href='#/glossary?term=Closed question'>Closed question</a>. <br />Examples: <br />1.\tFor examples of open (and neutral) interview questions see <a href='#/glossary?term=Neutral question'>Neutral question</a>:",
    "description-german": "Eine Frage in einem <a href='#/glossary?term=Interview'>Interview</a>, die keine Einschränkung der Antwortmöglichkeiten nach sich zieht<br />Anmerkungen: <br />1.\tOffene Fragen sind in Interviews zu bevorzugen, weil sie <a href='#/glossary?term=Benutzer'>Benutzer</a> zur freien Rede animieren und ausführliche  Antworten auf die Frage zulassen. <br />2.\tVergleiche mit geschlossener Frage.<br />Beispiele:<br />1.\tFür Beispiele zu offenen (und neutralen) Interviewfragen siehe <a href='#/glossary?term=Neutrale Frage'>Neutrale Frage</a>n.",
    "term-english": "Open question",
    "term-german": "Offene Frage"
  },
  {
    "categories": [
      "System",
      "Gestaltung"
    ],
    "description-english": "Assistance delivered through computer software that can be topic-oriented, procedural or reference information. <br />Notes:<br />1.\tMost online help is designed to give assistance in the use of an <a href='#/glossary?term=Interactive system'>interactive system</a>, but can also be used to present information on a broad range of subjects. <br />2.\tOnline help is a form of <a href='#/glossary?term=User'>user</a> assistance.",
    "description-german": "Unterstützung die durch ein Computerprogramm bereitgestellt wird. Onlinehilfe kann themenorientiert, verfahrensorientiert oder ein Hinweis sein.<br />Anmerkungen:<br />1.\tOnlinehilfe kann auch Informationen zu weitergehenden Themenbereichen bieten.<br />2.\tOnlinehilfe ist eine Form der <a href='#/glossary?term=Benutzerunterstützung'>Benutzerunterstützung</a>.",
    "term-english": "Online help",
    "term-german": "Onlinehilfe"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung",
      "Planung"
    ],
    "description-english": "An organizational rule that <a href='#/glossary?term=User'>user</a>s have to follow when conducting their <a href='#/glossary?term=Task'>task</a>s.<br />Note: <br />1.\tOrganizational <a href='#/glossary?term=Requirement'>requirement</a>s are requirements on the users that lead to requirements on the <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Examples:<br />1.\tA salesperson must have a written approval from the director for offers that exceed 100.000 Euros.<br />2.\tAn exact description of how a user must handle an order.",
    "description-german": "Eine organisatorische Regel die <a href='#/glossary?term=Benutzer'>Benutzer</a> befolgen müssen während sie ihre <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n lösen.<br />Anmerkung:<br />1.\tOrganisatorische <a href='#/glossary?term=Anforderung'>Anforderung</a>en sind Anforderungen an die Benutzer die zu Anforderungen an das interaktive System führen.<br />Beispiele: <br />1.\tEin Verkäufer muss Angebote über 100.000 Euro vom Geschäftsführer unterschreiben lassen.<br />2.\tEine exakte Beschreibung der Art und Weise wie ein Benutzer eine Bestellung ausführen muss.",
    "term-english": "Organizational requirement",
    "term-german": "Organisatorische Anforderung"
  },
  {
    "categories": [
      "Rollen",
      "Planung"
    ],
    "description-english": "A description of a <a href='#/glossary?term=User'>user</a> and what he or she intends to do when using an <a href='#/glossary?term=Interactive system'>interactive system</a>. <br />Note:<br />1.\tPersonas are not real; rather they are imaginary but realistic examples of the real users they represent based on empirically determined data, for example from <a href='#/glossary?term=Observation'>observation</a>s or <a href='#/glossary?term=Interview'>interview</a>s.<br />2.\tPersonas typically have a name, age, some background, <a href='#/glossary?term=Goal'>goal</a>s and aspirations. A persona description should include information about the persona's knowledge about and interest in the subject matter of the interactive system. Persona descriptions often but not always have a photo.",
    "description-german": "Eine Beschreibung eines <a href='#/glossary?term=Benutzer'>Benutzer</a>s und was dieser bei der Benutzung eines interaktiven Systems beabsichtigt. <br />Anmerkung:<br />1.\tPersonas sind nicht Beschreibungen existierender Personen, sondern repräsentieren erfundene Beispiele eines realen Benutzers auf der Basis empirisch ermittelter Daten, zum Beispiel von <a href='#/glossary?term=Beobachtung'>Beobachtung</a>en oder <a href='#/glossary?term=Interview'>Interview</a>s.<br />2.\tPersonas verfügen typischerweise über einen Namen, Alter, einige Hintergrund­informationen, <a href='#/glossary?term=Ziel'>Ziel</a>e und Wünsche. Eine Persona-Beschreibung sollte Informationen über wesentliches Wissen im Themenfeld des interaktiven Systems und die entsprechenden Interessen der Persona im Themenfeld beinhalten. Persona-Beschreibungen enthalten oft, aber nicht immer ein Foto.",
    "term-english": "Persona",
    "term-german": "Persona"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Finding'>finding</a>",
    "description-german": "Siehe <a href='#/glossary?term=Usability-<a href='#/glossary?term=Befund'>Befund</a>'>Usability-Befund</a>",
    "term-english": "Positive usability finding",
    "term-german": "Positiver Usability-Befund"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "An activity in a <a href='#/glossary?term=Usability'>usability</a> test session where the usability <a href='#/glossary?term=Test participant'>test participant</a> answers questions about his/her experience and general impression of the usability of the <a href='#/glossary?term=Interactive system'>interactive system</a>. <br />Notes:<br />1.\tThe post-session <a href='#/glossary?term=Interview'>interview</a> takes place after the <a href='#/glossary?term=Usability test'>usability test</a> participant has carried out as many usability test <a href='#/glossary?term=Task'>task</a>s as time allows. <br />2.\tAlso referred to as a de<a href='#/glossary?term=Briefing'>briefing</a>.",
    "description-german": "Eine Aktivität in einem <a href='#/glossary?term=Usability-Test'>Usability-Test</a>, bei der ein <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> Fragen bezüglich seines allgemeinen Eindrucks hinsichtlich der <a href='#/glossary?term=Usability'>Usability</a> des interaktiven Systems beantwortet. <br />Anmerkungen:<br />1.\tDas Post-Session <a href='#/glossary?term=Interview'>Interview</a> findet statt, nachdem der Usability-Testteilnehmer soviele der vorgesehenen <a href='#/glossary?term=Usability-<a href='#/glossary?term=Test<a href='#/glossary?term=Aufgabe'>aufgabe</a>'>Testaufgabe</a>'>Usability-Testaufgabe</a>n wie möglich in der vorgegebenen Zeit erledigt hat. <br />2.\tWird auch als De<a href='#/glossary?term=Briefing'>briefing</a> oder <a href='#/glossary?term=Nachbesprechung'>Nachbesprechung</a> bezeichnet.",
    "term-english": "Post-session interview",
    "term-german": "Post-Session Interview"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "An activity in a <a href='#/glossary?term=Usability'>usability</a> test session where the usability <a href='#/glossary?term=Test participant'>test participant</a> answers questions about his/her background and previous experience with the <a href='#/glossary?term=Interactive system'>interactive system</a> or related interactive systems. <br />Note:<br />1.\tThe pre-session <a href='#/glossary?term=Interview'>interview</a> takes place after the <a href='#/glossary?term=Briefing'>briefing</a> but before the <a href='#/glossary?term=Usability test'>usability test</a> participant starts carrying out usability test <a href='#/glossary?term=Task'>task</a>s.",
    "description-german": "Eine Tätigkeit bei einem <a href='#/glossary?term=Usability-Test'>Usability-Test</a>, bei der <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> Fragen bezüglich ihres Hintergrundes und vorheriger Erfahrung mit dem interaktiven System oder ähnlichen interaktiven Systemen beantworten. <br />Anmerkung:<br />1.\tDas Pre-Session <a href='#/glossary?term=Interview'>Interview</a> findet nach dem <a href='#/glossary?term=Briefing'>Briefing</a> statt, bevor der <a href='#/glossary?term=Usability'>Usability</a>-Testteilnehmer beginnt, die <a href='#/glossary?term=Usability-<a href='#/glossary?term=Test<a href='#/glossary?term=Aufgabe'>aufgabe</a>'>Testaufgabe</a>'>Usability-Testaufgabe</a>n abzuarbeiten.",
    "term-english": "Pre-session interview",
    "term-german": "Pre-Session Interview"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who interacts with an <a href='#/glossary?term=Interactive system'>interactive system</a> to achieve <a href='#/glossary?term=Goal'>goal</a>s supported by the system.",
    "description-german": "Eine Person, die mit einem interaktiven System interagiert, um <a href='#/glossary?term=Ziel'>Ziel</a>e zu erreichen, die durch das System unterstützt werden.",
    "term-english": "Primary user",
    "term-german": "Primärer Benutzer"
  },
  {
    "categories": [
      "Rollen",
      "Test"
    ],
    "description-english": "A <a href='#/glossary?term=Usability'>usability</a> specialist who makes notes of usability <a href='#/glossary?term=Finding'>finding</a>s during a <a href='#/glossary?term=Usability test'>usability test</a> session, <a href='#/glossary?term=Focus group'>focus group</a> or <a href='#/glossary?term=Interview'>interview</a>. <br />Notes:<br />1.\tNote-taker is a <a href='#/glossary?term=Role'>role</a> in a <a href='#/glossary?term=Usability test session'>usability test session</a>, focus group or interview.<br />2.\tThe use of a note-taker allows the <a href='#/glossary?term=Moderator'>moderator</a> to fully concentrate on the usability <a href='#/glossary?term=Test participant'>test participant</a>.",
    "description-german": "Ein <a href='#/glossary?term=Usability'>Usability</a>spezialist, der Notizen über <a href='#/glossary?term=Usability-<a href='#/glossary?term=Befund'>Befund</a>'>Usability-Befund</a>e während einer <a href='#/glossary?term=Usability-Testsitzung'>Usability-Testsitzung</a>, <a href='#/glossary?term=Fokusgruppe'>Fokusgruppe</a> oder <a href='#/glossary?term=Interview'>Interview</a> notiert. <br />Anmerkungen:<br />1.\tProtokollant ist eine <a href='#/glossary?term=Rolle'>Rolle</a> in einer <a href='#/glossary?term=Usability-Test'>Usability-Test</a>sitzung, Fokusgruppe oder Interview<br />2.\tDer Einsatz eines Protokollanten erlaubt dem <a href='#/glossary?term=Moderator'>Moderator</a>, sich voll auf den <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> zu konzentrieren.",
    "term-english": "Note-taker",
    "term-german": "Protokollant"
  },
  {
    "categories": [
      "Test",
      "System"
    ],
    "description-english": "A representation of all or part of an <a href='#/glossary?term=Interactive system'>interactive system</a> that, although limited in some way, can be used for analysis, design and <a href='#/glossary?term=Evaluation'>evaluation</a>.<br />Note: <br />1.\tThis glossary further distinguishes between <a href='#/glossary?term=High-fidelity prototype'>high-fidelity prototype</a> and <a href='#/glossary?term=Low-fidelity prototype'>low-fidelity prototype</a>.",
    "description-german": "Eine Repräsentation von Teilen oder des gesamten interaktiven Systems, die in einem bestimmten Maß für Analyse, Design und <a href='#/glossary?term=Evaluierung'>Evaluierung</a> benutzt werden kann.<br />Anmerkung:<br />1.\tZertifizierungsanwärter müssen auch mit den Begriffen <a href='#/glossary?term=High-fidelity-Prototyp'>high-fidelity-Prototyp</a> und <a href='#/glossary?term=Low-fidelity-Prototyp'>low-fidelity-Prototyp</a> vertraut sein.",
    "term-english": "Prototype",
    "term-german": "Prototyp"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "A statement of what <a href='#/glossary?term=User'>user</a>s must be able to locate, recognize, understand, select or input as part of conducting a <a href='#/glossary?term=Task'>task</a> with the <a href='#/glossary?term=Interactive system'>interactive system</a>. <br />Notes: <br />1.\tQualitative user <a href='#/glossary?term=Requirement'>requirement</a>s are the basis for efficient use of the interactive system.<br />\tIn contrast, quantitative <a href='#/glossary?term=User requirement'>user requirement</a>s can enforce measures on the <a href='#/glossary?term=Efficiency'>efficiency</a> of the interactive system – that is, whether users can solve particular tasks with the interactive system, e.g. in an acceptable time or with a specified maximum number of use errors.<br />2.\tQualitative user requirements are not features. They provide the basis for features.<br />3.\tCompare to <a href='#/glossary?term=Quantitative user requirement'>quantitative user requirement</a> <br />Examples:<br />1.\tReasonable qualitative user requirements: <br />a.\t\"The user must be able to compare the differences between cars that are available for a specific price range at the car rental website.\"<br />b.\t\"The user must be able to select a car with automatic transmission at the car rental website.\"<br />c.\t\"The user must be able to see the opening hours of a specific car rental location.\"<br />2.\tIncorrect qualitative user requirements:<br />a.\t\"The <a href='#/glossary?term=User interface'>user interface</a> must be usable and support all user tasks\" (too general)<br />b.\t\"The user interface must have a big, red \"Rent this car\" button\" (too detailed)",
    "description-german": "Eine Beschreibung, was <a href='#/glossary?term=Benutzer'>Benutzer</a> während der Durchführung einer <a href='#/glossary?term=Aufgabe'>Aufgabe</a> mit dem interaktiven System finden, erkennen, verstehen, auswählen oder eingeben müssen.<br />Anmerkungen:<br />1.\tQualitative <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Anforderung'>anforderung</a>'>Nutzungsanforderung</a>en sind die Basis für den effizienten Gebrauch von interaktiven Systemen.<br />\tIm Gegensatz dazu können <a href='#/glossary?term=Quantitative Nutzungsanforderung'>Quantitative Nutzungsanforderung</a>en Messungen der <a href='#/glossary?term=Effizienz'>Effizienz</a> des interaktiven Systems ermöglichen  – d.h. ob ein Benutzer mit Hilfe des interaktiven Systems eine Aufgabe z.B. in einer angemessenen Zeit oder mit einem definierten Maximum an Bedienungsfehlern lösen kann.<br />2.\tQualitative Nutzungsanforderungen sind keine Funktionen, sondern stellen die Basis für Funktionen dar.<br />3.\tVergleiche mit Quantitativer Nutzungsanforderung <br />Beispiele<br />1.\tSinnvolle qualitative Nutzungsanforderungen:<br />a.\t„Der Benutzer muss die unterschiedlichen Fahrzeuge, die für einen bestimmten Preisbereich auf der Autovermietungs­webseite verfügbar sind, vergleichen können.“ <br />b.\t„Der Benutzer muss ein Fahrzeug mit automatischer Übertragung auf der Autovermietungswebseite auswählen können.“<br />c.\t„Der Benutzer muss die Öffnungszeiten einer bestimmten Autovermietungsstelle sehen können.“<br />2.\tFalsch formulierte qualitative Nutzungsanforderungen:<br />a.\t„Die <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a> muss gebrauchstauglich sein und alle Benutzeraufgaben unterstützen.“ (zu allgemein)<br />b.\t„Die Benutzungsschnittstelle muss einen großen roten Button „Auto mieten“ haben“ (zu detailliert)",
    "term-english": "Qualitative user requirement",
    "term-german": "Qualitative Nutzungsanforderung"
  },
  {
    "categories": [
      "Planung",
      "Anforderungen",
      "Evaluierung"
    ],
    "description-english": "The degree to which the <a href='#/glossary?term=Interactive system'>interactive system</a> fulfils <a href='#/glossary?term=Requirement'>requirement</a>s.<br />Note: <br />1.\tExamples of quality characteristics other than <a href='#/glossary?term=Usability'>usability</a> are correctness, reliability and security.",
    "description-german": "Grad der Erfüllung von <a href='#/glossary?term=Anforderung'>Anforderung</a>en durch ein <a href='#/glossary?term=Interaktives System'>interaktives System</a>.<br />Anmerkung: <br />1.\tBeispiele für Qualitätsmerkmale neben <a href='#/glossary?term=Usability'>Usability</a> sind Korrektheit, Verlässlichkeit und Sicherheit.",
    "term-english": "Quality",
    "term-german": "Qualität"
  },
  {
    "categories": [
      "Anforderungen",
      "Gestaltung"
    ],
    "description-english": "Required level of <a href='#/glossary?term=Usability'>usability</a> to meet identified <a href='#/glossary?term=User'>user</a> needs expressed in terms of measures of <a href='#/glossary?term=Effectiveness'>effectiveness</a>, <a href='#/glossary?term=Efficiency'>efficiency</a> and <a href='#/glossary?term=Satisfaction'>satisfaction</a> in a specified <a href='#/glossary?term=Context of use'>context of use</a>.<br />Notes: <br />1.\tQuantitative user <a href='#/glossary?term=Requirement'>requirement</a>s are acceptance criteria for the effectiveness, efficiency and satisfaction of the <a href='#/glossary?term=Interactive system'>interactive system</a>, for example whether users can solve particular <a href='#/glossary?term=Task'>task</a>s with the system in an acceptable time or with a specified maximum number of use errors.<br />2.\tCompare to qualitative <a href='#/glossary?term=User requirement'>user requirement</a>. In particular, compare the examples.<br />Example: <br />1.\t\"80% of users who have used the car rental website at least twice must be able to rent within 5 minutes an economy size car at Frankfurt Airport (Germany) for two days starting tomorrow at 09.00.\"<br />2.\tCompare the above example to the examples in <a href='#/glossary?term=Qualitative user requirement'>qualitative user requirement</a>.",
    "description-german": "Benötigtes Maß an <a href='#/glossary?term=Usability'>Usability</a> um identifizierten <a href='#/glossary?term=Erfordernis'>Erfordernis</a>sen zu genügen im Sinne der <a href='#/glossary?term=Effektivität'>Effektivität</a>, <a href='#/glossary?term=Effizienz'>Effizienz</a> und <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a> in einem festgelegten <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a>.<br />Anmerkungen:<br />1.\tQuantitative <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Anforderung'>anforderung</a>'>Nutzungsanforderung</a>en sind Akzeptanzkriterien für die Effektivität, Effizienz und Zufriedenstellung eines interaktiven Systems, z.B. ob <a href='#/glossary?term=Benutzer'>Benutzer</a> eine bestimmte <a href='#/glossary?term=Aufgabe'>Aufgabe</a> in einer angemessenen Zeit oder mit einem festgeschriebenen Maximum an Benutzungsfehlern mit dem System erledigen können.<br />2.\tVergleiche mit Qualitativer Nutzungsanforderung. Vergleiche insbesondere die Beispiele.<br />Beispiel: <br />1.\t„80% der Benutzer, die die Autovermietungs­webseite zumindest zweimal benutzt haben, müssen in der Lage sein, innerhalb von 5 Minuten einen Kleinwagen ab Flughafen Frankfurt (Deutschland) für zwei Tage beginnend ab morgen 09:00 Uhr zu mieten“.<br />2.\tVergleiche das obige Beispiel mit Beispielen  „qualitativer Nutzungsanforderung“.",
    "term-english": "Quantitative user requirement",
    "term-german": "Quantitative Nutzungsanforderung"
  },
  {
    "categories": [
      "Planung",
      "Test"
    ],
    "description-english": "A process for selecting candidates that have the required qualifications to participate in a human-centred activity such as a <a href='#/glossary?term=Focus group'>focus group</a>, contextual <a href='#/glossary?term=Interview'>interview</a>, or <a href='#/glossary?term=Usability'>usability</a> test.<br />Note:<br />1.\tA <a href='#/glossary?term=Recruitment screener'>recruitment screener</a> is often used to determine whether candidates have the required qualifications to participate in the human-centred activity.<br />2.\tRelevant qualifications include: Background, knowledge of the subject matter, attitudes and interests.",
    "description-german": "Akquise von <a href='#/glossary?term=Benutzer'>Benutzer</a>n, die die erforderlichen Qualifikationen haben, an einer menschzentrierten Aktivität wie z.B. einem <a href='#/glossary?term=Usability-Test'>Usability-Test</a>, einem kontextuellen <a href='#/glossary?term=Interview'>Interview</a> oder einer <a href='#/glossary?term=Fokusgruppe'>Fokusgruppe</a> teilzunehmen.<br />Anmerkung: <br />1.\tOft wird ein <a href='#/glossary?term=Rekrutierungs<a href='#/glossary?term=Fragebogen'>fragebogen</a>'>Rekrutierungsfragebogen</a> eingesetzt, um festzustellen ob Kandidaten über die erforderlichen Qualifikationen zur Teilnahme an der menschzentrierten Aktivität verfügen.<br />2.\tRelevante Qualifikationen beinhalten: Hintergrund, Wissen über das Sachgebiet, Einstellungen und Interessen.",
    "term-english": "Recruiting",
    "term-german": "Rekrutierung"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A series of questions for prospective participants to identify whether they represent the intended <a href='#/glossary?term=User'>user</a>s and therefore qualify to participate in a human-centred activity, for example a <a href='#/glossary?term=Usability'>usability</a> test or a <a href='#/glossary?term=Focus group'>focus group</a>.<br />Notes:<br />1.\tA recruitment screener is used during <a href='#/glossary?term=Recruiting'>recruiting</a> to determine whether candidates have the required qualifications to participate in the activity.<br />2.\tRelevant qualifications include: Background, knowledge of the subject matter, attitudes and interests.",
    "description-german": "Eine Reihe von Fragen für poten<a href='#/glossary?term=Ziel'>ziel</a>le Teilnehmer hinsichtlich ihrer Qualifikationen zur Teilnahme an einer menschzentrierten Aktivität wie z.B. einem <a href='#/glossary?term=Usability-Test'>Usability-Test</a> oder einer <a href='#/glossary?term=Fokusgruppe'>Fokusgruppe</a>.<br />Anmerkungen: <br />1.\tEin <a href='#/glossary?term=Rekrutierung'>Rekrutierung</a>s<a href='#/glossary?term=Fragebogen'>fragebogen</a> wird während der Rekrutierung von Teilnehmern benutzt, um festzustellen ob Kandidaten über die erforderlichen Qualifikationen zur Teilnahme an der menschzentrierten Aktivität verfügen.<br />2.\tRelevante Qualifikationen beinhalten: Hintergrund, Wissen über das Sachgebiet, Einstellungen und Interessen.<br />3.\tDer englische Ausdruck für Rekrutierungs­fragebogen ist Screener oder Recruitment Screener.",
    "term-english": "Recruitment screener",
    "term-german": "Rekrutierungsfragebogen"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A <a href='#/glossary?term=Usability'>usability</a> test where the usability <a href='#/glossary?term=Test participant'>test participant</a> and the <a href='#/glossary?term=Moderator'>moderator</a> are in different physical locations. <br />Notes: <br />1.\tThe moderator observes the <a href='#/glossary?term=Usability test'>usability test</a> participant using an internet connection. <br />2.\tThe moderator communicates with the <a href='#/glossary?term=Usability test participant'>usability test participant</a> over the telephone or via an internet connection.<br />3.\tCompare to usability test and unattended usability test.",
    "description-german": "Ein <a href='#/glossary?term=Usability-Test'>Usability-Test</a> bei dem sich der <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> und der <a href='#/glossary?term=Moderator'>Moderator</a> an unterschiedlichen Orten befinden <br />(„Remote“ bedeutet hier „entfernt liegend“). <br />Anmerkungen:<br />1.\tDer Moderator beobachtet den <a href='#/glossary?term=Usability'>Usability</a>-Testteilnehmer über eine Internetverbindung. <br />2.\tDer Moderator kommuniziert mit dem Usability-Testteilnehmer über Telefon oder Internet.<br />3.\tVergleiche mit Usability-Test und <a href='#/glossary?term=Unbeaufsichtigter Usability-Test'>unbeaufsichtigter Usability-Test</a>.",
    "term-english": "Remote usability test",
    "term-german": "Remote Usability-Test"
  },
  {
    "categories": [
      "System"
    ],
    "description-english": "All means required to use an <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Note:<br />1.\tTypical examples of resources are time, financial cost, physical and mental effort, hardware, software and materials.",
    "description-german": "Alle Mittel die zur Nutzung eines interaktiven Systems notwendig sind. <br />Anmerkung: <br />1.\ttypische Beispiele von Ressourcen sind Zeit, finan<a href='#/glossary?term=Ziel'>ziel</a>le Kosten, physischer und mentaler Aufwand, Hardware, Software und Materialien",
    "term-english": "Resources",
    "term-german": "Ressourcen"
  },
  {
    "categories": [
      "Prinzipien",
      "Gestaltung"
    ],
    "description-english": "See <a href='#/glossary?term=User'>User</a> interface <a href='#/glossary?term=Guideline'>guideline</a>.",
    "description-german": "Siehe <a href='#/glossary?term=Gestaltungsregel'>Gestaltungsregel</a>",
    "term-english": "Guideline",
    "term-german": "Richtlinie"
  },
  {
    "categories": [
      "Anforderungen",
      "Rollen"
    ],
    "description-english": "A duty or function that a person carries out within an organization.<br />Notes: <br />1.\tA role describes a set of connected behaviors, rights, obligations, and norms in a job situation. <br />2.\tRoles are occupied by individuals, who are called actors.<br />3.\tDepending on the complexity of a project, several people might share one role or multiple roles might be assigned to one person.<br />4.\tWork roles are \"hats\" that people wear when they take on the corresponding job responsibilities and perform the associated activities.<br />Example: <br />1.\tIn a <a href='#/glossary?term=Usability'>usability</a> test session, one person can simultaneously occupy the roles <a href='#/glossary?term=Moderator'>moderator</a> and <a href='#/glossary?term=Note-taker'>note-taker</a>. In another <a href='#/glossary?term=Usability test'>usability test</a> session, in contrast, one person may act as moderator and two other people may both act as note-takers.",
    "description-german": "Eine Funktion die eine Person innerhalb der Struktur einer Organisation inne hat.<br />Anmerkungen:<br />1.\tEine Rolle beschreibt eine Menge von zusammengehörigen Verhaltensweisen, Rechten, Pflichten und Normen in einem beruflichen Kontext.<br />2.\tRollen werden von Individuen besetzt.<br />3.\tAbhängig von der Komplexität eines Projektes können mehrere Menschen eine Rolle teilen oder mehrere Rollen einer Person zugewiesen werden.<br />4.\tArbeitsrollen sind „Hüte“, die Menschen aufhaben, wenn sie die entsprechenden Verantwortlichkeiten übernehmen und die damit verbundenen Tätigkeiten ausüben.<br />Beispiel:<br />1.\tIn einer <a href='#/glossary?term=Usability-Testsitzung'>Usability-Testsitzung</a> kann eine Person gleichzeitig die Rolle des <a href='#/glossary?term=Moderator'>Moderator</a>s und die des <a href='#/glossary?term=Protokollant'>Protokollant</a>en übernehmen. <br />\tIn einer anderen <a href='#/glossary?term=Usability-Test'>Usability-Test</a>sitzung hingegen, könnte eine Person als Moderator fungieren und zwei andere Personen könnten beide als Protokollant auftreten.",
    "term-english": "Role",
    "term-german": "Rolle"
  },
  {
    "categories": [
      "Rollen",
      "Planung"
    ],
    "description-english": "A person who interacts with an <a href='#/glossary?term=Interactive system'>interactive system</a> to support the use of the system or maintain the system.<br />Examples of secondary <a href='#/glossary?term=User'>user</a>s: <br />1.\tSecurity manager, administrator, trainer and maintenance.",
    "description-german": "Eine Person, die mit einem interaktiven System interagiert, um die Nutzung des Systems zu unterstützen oder das System zu warten.<br />Beispiele für sekundäre <a href='#/glossary?term=Benutzer'>Benutzer</a>:<br />1.\tSicherheitsmanager, Administrator, Trainer und Wartung.",
    "term-english": "Secondary user",
    "term-german": "Sekundärer Benutzer"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "The property of a <a href='#/glossary?term=Dialogue'>dialogue</a> to, at any time, make it obvious to the <a href='#/glossary?term=User'>user</a>s which dialogue they are in, where they are within the dialogue, which actions can be taken, and how they can be performed.<br />Note: <br />1.\t<a href='#/glossary?term=Affordance'>Affordance</a>s and self-descriptiveness are means to make an <a href='#/glossary?term=Interactive system'>interactive system</a> <a href='#/glossary?term=Intuitive'>intuitive</a>. <br />2.\tSelf-descriptiveness is a dialogue principle. ",
    "description-german": "Die Eigenschaft eines <a href='#/glossary?term=Dialog'>Dialog</a>s zu jeder Zeit dem <a href='#/glossary?term=Benutzer'>Benutzer</a> offensichtlich zu machen, in welchem Dialog, an welcher Stelle im Dialog er sich befindet, welche Handlungen unternommen werden können und wie diese ausgeführt werden können.<br />Anmerkung:<br />1.\t<a href='#/glossary?term=Affordance'>Affordance</a> und Selbstbeschreibungsfähigkeit sind Mittel, um ein <a href='#/glossary?term=Interaktives System'>interaktives System</a> <a href='#/glossary?term=Intuitiv'>intuitiv</a>e zu gestalten.<br />2.\tSelbstbeschreibungsfähigkeit ist ein Dialogprinzip. ",
    "term-english": "Self-descriptiveness",
    "term-german": "Selbstbeschreibungsfähigkeit"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "The ability of a <a href='#/glossary?term=User'>user</a> to initiate and control the direction and pace of the interaction until the point at which the <a href='#/glossary?term=Goal'>goal</a> has been met.<br />Note:<br />1.\tControllability is a <a href='#/glossary?term=Dialogue'>dialogue</a> principle.",
    "description-german": "Der <a href='#/glossary?term=Benutzer'>Benutzer</a> ist in der Lage einen <a href='#/glossary?term=Dialog'>Dialog</a>ablauf zu starten sowie seine Richtung und Geschwindigkeit zu beeinflussen, bis das <a href='#/glossary?term=Ziel'>Ziel</a> erreicht ist.<br />Anmerkung:<br />1.\tSteuerbarkeit ist ein Dialogprinzip.",
    "term-english": "Controllability",
    "term-german": "Steuerbarkeit"
  },
  {
    "categories": [
      "Planung"
    ],
    "description-english": "A sequence of visual frames illustrating the interplay between a <a href='#/glossary?term=User'>user</a> and an envisioned <a href='#/glossary?term=Interactive system'>interactive system</a>. <br />Note:<br />1.\tA storyboard is often a comic book style representation of a scenario.<br />2.\tStoryboards are unsuitable as <a href='#/glossary?term=Prototype'>prototype</a>s because they tell stories and do not afford interaction.",
    "description-german": "Eine Folge visueller Bildschirminhalte, die das Zusammenspiel zwischen einem <a href='#/glossary?term=Benutzer'>Benutzer</a> und einem vorgestellten interaktiven System darstellt. <br />Anmerkung:<br />1.\tEin Storyboard ist oft eine Comic-­artige Darstellung eines <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Szenario'>szenario</a>'>Nutzungsszenario</a>s.<br />2.\tStoryboards sind nicht als <a href='#/glossary?term=Prototyp'>Prototyp</a>en geeignet, da sie eine Geschichte erzählen und keine Interaktion ermöglichen ",
    "term-english": "Storyboard",
    "term-german": "Storyboard"
  },
  {
    "categories": [
      "Gestaltung",
      "Prinzipien"
    ],
    "description-english": "A collection of <a href='#/glossary?term=User'>user</a> interface <a href='#/glossary?term=Guideline'>guideline</a>s used to ensure <a href='#/glossary?term=Consistency'>consistency</a> in the appearance and behaviour of the <a href='#/glossary?term=User interface'>user interface</a> of the <a href='#/glossary?term=Interactive system'>interactive system</a>s produced by an organization <br />Note:<br />1.\tStyleguides are sometimes called UX Guides.<br />Examples of styleguides:<br />1.\tWindows <a href='#/glossary?term=User experience'>User Experience</a> Interaction <a href='#/glossary?term=Guideline'>Guideline</a>s for Windows Desktop apps (“UX Guide”)<br />2.\tIOS Human Interface Guidelines",
    "description-german": "Eine Sammlung von <a href='#/glossary?term=Gestaltungsregel'>Gestaltungsregel</a>n die verwendet wird, um die grundsätzliche Erscheinung der <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a> auf jeglicher Software einer Organisation festzulegen.<br />Anmerkung:<br />1.\tStyleguides werden manchmal auch als UX Guides bezeichnet.<br />Beispiele für Styleguides:<br />1.\tWindows User Experience Interaction Guidelines for Windows Desktop apps („UX Guide“)<br />2.\tIOS Human Interface Guidelines",
    "term-english": "Styleguide",
    "term-german": "Styleguide"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A question in an <a href='#/glossary?term=Interview'>interview</a> that signals a preference for certain possibilities, or attempts to direct the reply in a certain direction. <br />Note:<br />1.\tCompare to <a href='#/glossary?term=Neutral question'>neutral question</a>.<br />Example of a leading question:<br />1.\t\"Would you like to have pretty colours on the home page of the new car rental website?\"<br />\tCorresponding neutral question: \"What should the home page of the new car rental website look like?\" Note that the neutral question doesn't even mention colour.",
    "description-german": "Eine Frage in einem <a href='#/glossary?term=Interview'>Interview</a>, die eine Präferenz für bestimmte Antwortmöglichkeiten vorgibt oder versucht, die Antwort in eine bestimmte Richtung zu lenken. <br />Anmerkung:<br />1.\tVergleiche mit neutraler Frage.<br />Beispiel für Suggestivfrage:<br />1.\t„Möchten Sie schöne Farben auf der Homepage der neuen Autovermietungswebsite?“<br />Entsprechende <a href='#/glossary?term=Neutrale Frage'>neutrale Frage</a>: „Wie sollte die Homepage der neuen Autovermietungswebsite aussehen?“ Beachten Sie, dass die neutrale Frage den Begriff „Farbe“ nicht einmal enthält.",
    "term-english": "Leading question",
    "term-german": "Suggestionsfrage"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "A type of <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> designed and used to gather conclusions about the merit or worth of an <a href='#/glossary?term=Interactive system'>interactive system</a>, especially when a substantial part of it has completed design.<br />Notes:<br />1.\tA summative <a href='#/glossary?term=Usability evaluation'>usability evaluation</a> may be used to evaluate a design against <a href='#/glossary?term=User'>user</a> <a href='#/glossary?term=Requirement'>requirement</a>s in order to determine whether the design is acceptable from the users' point of view.<br />2.\tCompare to <a href='#/glossary?term=Formative usability evaluation'>Formative usability evaluation</a>.",
    "description-german": "Eine <a href='#/glossary?term=Usability'>Usability</a><a href='#/glossary?term=Evaluierung'>evaluierung</a>, die darauf ausgerichtet ist, Schlussfolgerungen zur <a href='#/glossary?term=Qualität'>Qualität</a> eines interaktiven Systems aus Sicht der Usability zu ziehen, insbesondere wenn ein wesentlicher Teil der Entwicklung fertig ist.  <br />Anmerkung: <br />1.\tEine summative Evaluierung kann dazu genutzt werden, ein Design gegen <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Anforderung'>anforderung</a>'>Nutzungsanforderung</a>en zu evaluieren, um festzustellen, ob das Design aus der Perspektive der <a href='#/glossary?term=Benutzer'>Benutzer</a> akzeptabel ist.<br />2.\tVergleiche mit Formativer <a href='#/glossary?term=Usability-Evaluierung'>Usability-Evaluierung</a>.",
    "term-english": "Summative usability evaluation",
    "term-german": "Summative Usability-Evaluierung"
  },
  {
    "categories": [
      "Prinzipien",
      "Implementierung"
    ],
    "description-english": "Explicit information about an event or a condition from an <a href='#/glossary?term=Interactive system'>interactive system</a> to a <a href='#/glossary?term=User'>user</a>.<br />Note: <br />1.\tSystem-initiated guidance includes <br />a.\tMessages (informative, warning, error)<br />b.\tStatus information, for example \"7 new messages\"<br />c.\tInstructions, for example \"Separate e-mail addresses by space, comma, semicolon or line break\"<br />2.\tMessages must be constructive, precise, comprehensible and visible. <br />3.\tSystem-initiated guidance is a form of <a href='#/glossary?term=User assistance'>user assistance</a>.",
    "description-german": "Explizite Information über ein Ereignis oder einen Zustand vom interaktiven System an den <a href='#/glossary?term=Benutzer'>Benutzer</a>. <br />Anmerkungen: <br />Systeminitiierte Benutzerführung umfasst:<br />Meldungen (informativ, warnend, auf Fehler hinweisend)<br />Statusinformation, z.B. ”7 neue Nachrichten”<br />Instruktionen, z.B. ”E-Mail-Adressen können mit einem Leerzeichen, einem Komma, einem Semikolon oder einem Zeilenumbruch getrennt werden.”<br />2.\tMeldungen, müssen konstruktiv, präzise, verständlich und sichtbar sein.<br />3.\tSysteminitiierte Benutzerführung ist eine Form der <a href='#/glossary?term=Benutzerunterstützung'>Benutzerunterstützung</a>.",
    "term-english": "System-initiated guidance",
    "term-german": "Systeminitiierte Benutzerführung"
  },
  {
    "categories": [
      "Test",
      "Planung"
    ],
    "description-english": "See scenario",
    "description-german": "Eine narrative Textbeschreibung des Vorgehens, das ein bestimmter <a href='#/glossary?term=Benutzer'>Benutzer</a> anwendet, um eine oder mehrere <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n zu erledigen. <br />Anmerkungen: <br />1.\tDer Benutzer im Szenario kann durch eine <a href='#/glossary?term=Persona'>Persona</a> repräsentiert werden.<br />2.\tEs gibt zwei Typen von Szenarien: <br />a.\tSzenarien des Ist-Zustands, die beschreiben, wie Aufgaben bisher erledigt werden. Szenarien des Ist-Zustands beschreiben den gegenwärtigen <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> und dienen dazu, <a href='#/glossary?term=Erfordernis'>Erfordernis</a>se zu erkennen und <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Anforderung'>anforderung</a>'>Nutzungsanforderung</a>en abzuleiten. Siehe Beispiel 1.<br />b.\tNutzungsszenarien beschreiben, wie Aufgaben mit dem zukünftigen interaktiven System erledigt werden. Nutzungsszenarien dienen als Basis für das Entwickeln erster <a href='#/glossary?term=Low-fidelity-<a href='#/glossary?term=Prototyp'>Prototyp</a>'>Low-Fidelity-Prototyp</a>en. Siehe Beispiel 2.<br />3. \tSzenarien werden vom <a href='#/glossary?term=User Requirements Engineer'>User Requirements Engineer</a> auf Grundlage der Ergebnisse von <a href='#/glossary?term=Beobachtung'>Beobachtung</a>en und Kontext<a href='#/glossary?term=Interview'>interview</a>s erstellt<br />4. \tPersonas und Szenarien werden zusammen entwickelt, da das Analysieren von Benutzern auch eine Analyse ihres Verhaltens involviert und die Analyse ihres Handelns beinhaltet, wer diese Handlungen durchführt.<br />5. \tSzenarien werden von Benutzern überprüft, um Missverständnisse zu entdecken, die während der Contextual Inquiry aufgetreten sein könnten.<br />6.\tEin Szenario soll nicht auf spezifische Umsetzungen von  Objekten der <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a> referenzieren (z.B. auf einen Button).<br />7.\tSzenarien werden benutzt um <a href='#/glossary?term=Aufgabenmodell'>Aufgabenmodell</a>e und frühe Prototypen zu erstellen, die die Aufgabe im Szenario unterstützen.<br />Beispiele für Szenarien:<br />„John Miller ist Geschäftsreisender der im Laufe einer Woche mehrere Flüge tätigt. Er fährt bevorzugt mit seinem Auto zum Flughafen. Gelegentlich verpasst er ein Flugzeug und bereut dann nicht mit einem Taxi oder mit der Bahn zum Flughafen gefahren zu sein. Er unterschätzt einfach die Fahrzeugschlangen vor an der Einfahrt des Parkhauses und die Laufzeit bis zum Flugsteig.“ Dieses Beispiel bezieht sich auf Anmerkung 2a, den Ist-Zustand.<br />„Bevor John Miller zum Flughafen fährt, sichtet er mit seiner neuen App immer die Parksituation am Flughafen. Wenn ausreichend Parkplätze vorhanden sind, reserviert er mit seiner neuen App einen Parkplatz und fährt dann entspannt mit seinem Wagen zum Flughafen. Er weiss, dass mit der Veröffentlichung der neuen App am Flughafen ein separater Zugang für Parkhausgäste mit reserviertem Parkplatz geschaffen wurde.“ Dieses Beispiel bezieht sich auf Anmerkung 2b, den zukünftigen Soll-Zustand.<br />3.\tDer folgende Text, der das Beispiel 2 ergänzt, ist zu spezifisch und verstösst gegen Anmerkung 6: <br />„John Miller schaut sich den Bildschirm „Überblick über verfügbare Parkplätze“ an und wählt einen Parkplätz mit der Schaltfläche „Auswählen“ aus. Anschliessend klickt er auf die Schaltfläche „Reservieren“ und reserviert diesen Parkplatz.“",
    "term-english": "As-is scenario",
    "term-german": "Szenario"
  },
  {
    "categories": [
      "Test",
      "Planung"
    ],
    "description-english": "See scenario",
    "description-german": "Siehe <a href='#/glossary?term=Szenario'>Szenario</a>",
    "term-english": "As-is scenario",
    "term-german": "Szenario des Ist-Zustands"
  },
  {
    "categories": [
      "Planung",
      "Test"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> test <a href='#/glossary?term=Task'>task</a>.",
    "description-german": "Siehe <a href='#/glossary?term=Usability-Test<a href='#/glossary?term=Aufgabe'>aufgabe</a>'>Usability-Testaufgabe</a>.",
    "term-english": "Test task",
    "term-german": "Testaufgabe"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> test report.",
    "description-german": "Siehe <a href='#/glossary?term=Usability-Testbericht'>Usability-Testbericht</a>.",
    "term-english": "Test report",
    "term-german": "Testbericht"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> test script.",
    "description-german": "Siehe <a href='#/glossary?term=Usability-Testskript'>Usability-Testskript</a>.",
    "term-english": "Test script",
    "term-german": "Testskript"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> test participant",
    "description-german": "Siehe <a href='#/glossary?term=Usability-Testteilnehmer'>Usability-Testteilnehmer</a>",
    "term-english": "Test participant",
    "term-german": "Testteilnehmer"
  },
  {
    "categories": [
      "Planung",
      "System"
    ],
    "description-english": "The physical, social and technical conditions in which a <a href='#/glossary?term=User'>user</a> interacts with an <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />Note: <br />1.\tThe social conditions include the organizational conditions.",
    "description-german": "Die Gesamtheit der gegebenen Umstände oder Bedingungen, in denen ein <a href='#/glossary?term=Benutzer'>Benutzer</a> arbeitet. Diese umfassen die physische, soziale und technische Umgebung.<br />Anmerkung: <br />1.\tDie soziale Umgebung schließt die organisatorische Umgebung mit ein.",
    "term-english": "Environment",
    "term-german": "Umgebung"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "A <a href='#/glossary?term=Usability'>usability</a> test where usability <a href='#/glossary?term=Test participant'>test participant</a>s solve <a href='#/glossary?term=Usability test'>usability test</a> <a href='#/glossary?term=Task'>task</a>s without being observed. <br />Note: <br />1.\t<a href='#/glossary?term=Usability test participant'>Usability test participant</a>s' actions are usually video recorded for later analysis.<br />2.\tUnattended usability tests are often conducted on the test participant's computer in his/her home. Video recording is accomplished through recording software installed on the computer by a vendor of unattended usability testing services.<br />3.\tCompare to Usability test and Remote usability test.",
    "description-german": "Ein <a href='#/glossary?term=Usability-Test'>Usability-Test</a> bei dem <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> <a href='#/glossary?term=Usability-<a href='#/glossary?term=Test<a href='#/glossary?term=Aufgabe'>aufgabe</a>'>Testaufgabe</a>'>Usability-Testaufgabe</a>n lösen ohne dabei beobachtet zu werden. <br />Anmerkung: <br />1.\tHandlungen werden auf Video zur späteren Analyse aufgezeichnet.<br />2.\tUnbeaufsichtigte <a href='#/glossary?term=Usability'>Usability</a>-Tests werden oft beim Testteilnehmer zuhause, auf dessen Computer durchgeführt. Videoaufnahmen werden mithilfe einer Aufzeichnungssoftware gespeichert die von einem Anbieter für unbeaufsichtigte Usability-Tests auf dem Computer installiert wird.<br />3.\tVergleiche mit Usability-Test und <a href='#/glossary?term=Remote Usability-Test'>Remote Usability-Test</a>",
    "term-english": "Unattended usability test",
    "term-german": "Unbeaufsichtigter Usability-Test"
  },
  {
    "categories": [
      "Test",
      "Anforderungen",
      "Prinzipien"
    ],
    "description-english": "Extent to which an <a href='#/glossary?term=Interactive system'>interactive system</a> can be used by specified <a href='#/glossary?term=User'>user</a>s to achieve specified <a href='#/glossary?term=Goal'>goal</a>s with <a href='#/glossary?term=Effectiveness'>effectiveness</a>, <a href='#/glossary?term=Efficiency'>efficiency</a> and <a href='#/glossary?term=Satisfaction'>satisfaction</a> in a specified <a href='#/glossary?term=Context of use'>context of use</a>.<br />Note:<br />1.\tThe phrases \"specified users\", \"specified goals\" and \"specified context of use\" are of particular importance in the definition.",
    "description-german": "Ausmaß, in dem ein <a href='#/glossary?term=Interaktives System'>interaktives System</a> durch bestimmte <a href='#/glossary?term=Benutzer'>Benutzer</a> in einem bestimmten <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> genutzt werden kann, um festgelegte <a href='#/glossary?term=Ziel'>Ziel</a>e effektiv, effizient und zufriedenstellend zu erreichen.<br />Anmerkung:<br />1.\tDie Ausdrücke „bestimmte Benutzer“, „festgelegte Ziele“ und „bestimmter Nutzungskontext“ sind in dieser Definition besonders wichtig.",
    "term-english": "Usability",
    "term-german": "Usability"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who manages a <a href='#/glossary?term=Human-centred design'>human-centred design</a> process.<br />Notes:<br />1.\tThe <a href='#/glossary?term=Usability'>usability</a> engineer (UE) is well versed in the human-centred design process, available human-centred engineering methods and tools, and <a href='#/glossary?term=Guideline'>guideline</a>s for usable <a href='#/glossary?term=User'>user</a> interfaces. This knowledge enables the UE to manage<br />a.\tHuman-centred design activities;<br />b.\tThe integration of human-centred design into the organization's design process for <a href='#/glossary?term=Interactive system'>interactive system</a>s; <br />c.\tThe definition of measurable human-centred <a href='#/glossary?term=Goal'>goal</a>s for a project;<br />d.\tThe training of participating project team members.<br />2.\tThe UE determines suitable approaches, tools and <a href='#/glossary?term=Styleguide'>styleguide</a>s for the human-centred design in general and for specific projects. The UE assists management in deciding whether work packages should be carried out by qualified employees in the organization or by competent subcontractors.<br />3.\tUsability engineer is a process <a href='#/glossary?term=Role'>role</a> in human-centred design.",
    "description-german": "Eine Person die in einer Querschnittsfunktion verantwortlich einen menschzentrierten Gestaltungsprozess betreut. <br />Anmerkungen:<br />1.\tDer <a href='#/glossary?term=Usability'>Usability</a> Engineer (UE) ist kompetent und erfahren in den Prozessschritten, verfügbaren Methoden der menschzentrierten Gestaltung und <a href='#/glossary?term=Gestaltungsregel'>Gestaltungsregel</a>n für <a href='#/glossary?term=Benutzererlebnis'>Benutzererlebnis</a>, sodass er die Entwicklungsprojekte unter dem Aspekt menschzentrierter Gestaltung planen und die <a href='#/glossary?term=Qualität'>Qualität</a> der Ausführung von menschzentrierten Gestaltungsbezogenen Aktivitäten sicherstellen kann. Dies beinhaltet <br />a.\t<a href='#/glossary?term=Menschzentrierte Gestaltung'>Menschzentrierte Gestaltung</a>saktivitäten,<br />b.\tDie Integration der menschzentrierten Gestaltung in den Produktentwicklungs­prozess des Unternehmens, <br />c.\tDie Definition von Erfolgskriterien für solche Projekte,<br />d.\tDas Training von beteiligten Projektteams. <br />2.\tDer UE legt angemessene Vorgehensweisen, Werkzeuge und <a href='#/glossary?term=Styleguide'>Styleguide</a>s für das menschzentrierte Design im Allgemeinen als auch für spezifische Projekte fest. Der UE unterstützt das Management bei der Entscheidung, welche Arbeitspakete von qualifizierten Mitarbeitern im Unternehmen und welche durch kompetente Subunternehmer ausgeführt werden sollten.<br />3.\tUsability Engineer ist eine <a href='#/glossary?term=Rolle'>Rolle</a> im Prozess der menschzentrierten Gestaltung.<br />",
    "term-english": "Usability engineer",
    "term-german": "Usability Engineer"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A professional who has one or more of the following process <a href='#/glossary?term=Role'>role</a>s: <br />1.\t<a href='#/glossary?term=Usability'>Usability</a> engineer, <br />2.\t<a href='#/glossary?term=User'>User</a> <a href='#/glossary?term=Requirement'>requirement</a>s engineer, <br />3.\t<a href='#/glossary?term=Usability test'>Usability test</a>er,<br />4.\t<a href='#/glossary?term=Information architect'>Information architect</a>,<br />5.\t<a href='#/glossary?term=Interaction designer'>Interaction designer</a>,<br />6.\t<a href='#/glossary?term=User interface'>User interface</a> designer.",
    "description-german": "Eine Person die eine oder mehrere der folgenden <a href='#/glossary?term=Rolle'>Rolle</a>n hat: <br />1.\t<a href='#/glossary?term=Usability Engineer'>Usability Engineer</a>, <br />2.\t<a href='#/glossary?term=User Requirements Engineer'>User Requirements Engineer</a>, <br />3.\t<a href='#/glossary?term=Usability-Tester'>Usability-Tester</a>,<br />4.\tInformationsarchitect,<br />5.\t<a href='#/glossary?term=Interaktionsdesigner'>Interaktionsdesigner</a>,<br />6.\t<a href='#/glossary?term=User Interface Designer'>User Interface Designer</a>.",
    "term-english": "Usability professional",
    "term-german": "Usability Professional"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Finding'>finding</a>",
    "description-german": "Ergebnis aus einer <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a>. <br />Anmerkung:<br />1.\tMögliche <a href='#/glossary?term=Usability'>Usability</a>-<a href='#/glossary?term=Befund'>Befund</a>e sind<br />a.\tEin <a href='#/glossary?term=Usability-Problem'>Usability-Problem</a> <br />b.\tEtwas, das die <a href='#/glossary?term=Benutzer'>Benutzer</a> mochten, also ein <a href='#/glossary?term=Positiver Usability-Befund'>positiver Usability-Befund</a>.",
    "term-english": "Usability test result",
    "term-german": "Usability-Befund"
  },
  {
    "categories": [
      "Test",
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "A process through which information about the <a href='#/glossary?term=Usability'>usability</a> of an <a href='#/glossary?term=Interactive system'>interactive system</a> is gathered in order to improve the interactive system (known as formative usability <a href='#/glossary?term=Evaluation'>evaluation</a>) or to assess the merit or worth of an interactive system (known as <a href='#/glossary?term=Summative usability evaluation'>summative usability evaluation</a>). <br />Notes:<br />1.\tUsability evaluation is a common term for<br />a.\tUsability evaluation - <a href='#/glossary?term=Inspection'>Inspection</a> based<br />b.\tUsability evaluation – <a href='#/glossary?term=User'>User</a> based<br />2.\tThe synonym \"Evaluation\" is also often used.",
    "description-german": "Ein Prozess der Informationen über die <a href='#/glossary?term=Usability'>Usability</a> eines interaktiven Systems sammelt um das interaktive System zu verbessern (<a href='#/glossary?term=Formative Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>formative Usability-Evaluierung</a>) oder um das interaktive System zu bewerten (<a href='#/glossary?term=Summative Usability-Evaluierung'>summative Usability-Evaluierung</a>). <br />Anmerkungen:<br />1.\tUsability-Evaluierung ist ein gemeinsamer Ausdruck für <br />a.\t<a href='#/glossary?term=Inspektionsbasierte Usability-Evaluierung'>Inspektionsbasierte Usability-Evaluierung</a> <br />b.\t<a href='#/glossary?term=Benutzerzentrierte Usability-Evaluierung'>Benutzerzentrierte Usability-Evaluierung</a>.<br />2.\tDas Synonym „Evaluation“ wird auch oft verwendet.",
    "term-english": "Usability evaluation",
    "term-german": "Usability-Evaluierung"
  },
  {
    "categories": [
      "System",
      "Planung"
    ],
    "description-english": "Two or more rooms that are specially equipped for <a href='#/glossary?term=Usability'>usability</a> testing or <a href='#/glossary?term=Focus group'>focus group</a>s. <br />Note:<br />1.\tA usability lab often consists of <br />a.\ta test room where the usability <a href='#/glossary?term=Test participant'>test participant</a> sits, <br />b.\tan <a href='#/glossary?term=Observation'>observation</a> room where <a href='#/glossary?term=Stakeholder'>stakeholder</a>s can watch <a href='#/glossary?term=Usability test'>usability test</a> participants as they solve usability test <a href='#/glossary?term=Task'>task</a>s. <br />\tOften, the two rooms are separated by a one way mirror which enables <a href='#/glossary?term=Observer'>observer</a>s to watch the <a href='#/glossary?term=Usability test participant'>usability test participant</a> but not vice versa.",
    "description-german": "Zwei oder mehrere Räume, die spe<a href='#/glossary?term=Ziel'>ziel</a>l für die Durchführung von Usabiltytests oder <a href='#/glossary?term=Fokusgruppe'>Fokusgruppe</a>n ausgestattet sind. <br />Anmerkung:<br />1.\tEin <a href='#/glossary?term=Usability'>Usability</a>-Labor besteht oft aus <br />a.\teinem Testraum, wo der <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> sitzt,<br />b.\teinem <a href='#/glossary?term=Beobachtung'>Beobachtung</a>sraum, wo <a href='#/glossary?term=Interessenvertreter'>Interessenvertreter</a> die <a href='#/glossary?term=Usability-Test'>Usability-Test</a>teilnehmer beobachten können, während die Usability-Testteilnehmer <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n lösen. <br />\tOft sind diese zwei Räume durch eine Spiegelwand getrennt, was den <a href='#/glossary?term=Beobachter'>Beobachter</a>n erlaubt, den Usability-Testteilnehmern zuzuschauen, nicht aber umgekehrt.",
    "term-english": "Usability lab",
    "term-german": "Usability-Labor"
  },
  {
    "categories": [
      "Evaluierung"
    ],
    "description-english": "A difficulty in using the <a href='#/glossary?term=User'>user</a> interface design that affects the ability of the user to achieve their <a href='#/glossary?term=Goal'>goal</a>s effectively, or efficiently, or with <a href='#/glossary?term=Satisfaction'>satisfaction</a>. <br />Note:<br />1.\t<a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Problem'>problem</a>s can lead to confusion, error, delay, or outright failure to complete some <a href='#/glossary?term=Task'>task</a> on the part of the user.",
    "description-german": "Ein Problem in der Benutzung der <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a>, das sich auf die <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a> des <a href='#/glossary?term=Benutzer'>Benutzer</a>s sowie die <a href='#/glossary?term=Effektivität'>Effektivität</a> und <a href='#/glossary?term=Effizienz'>Effizienz</a> des interaktiven Systems auswirkt. <br />Anmerkung:<br />1.\t<a href='#/glossary?term=Usability'>Usability</a>-Probleme können zu Irritationen, Fehlern oder Verzögerungen führen oder sogar die Fertigstellung einer <a href='#/glossary?term=Aufgabe'>Aufgabe</a> des Benutzers verhindern.",
    "term-english": "Usability problem",
    "term-german": "Usability-Problem"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a> that involves representative <a href='#/glossary?term=User'>user</a>s performing specific <a href='#/glossary?term=Task'>task</a>s with the <a href='#/glossary?term=Interactive system'>interactive system</a> to enable identification of usability <a href='#/glossary?term=Problem'>problem</a>s or the measurement of <a href='#/glossary?term=Effectiveness'>effectiveness</a>, <a href='#/glossary?term=Efficiency'>efficiency</a>, and user <a href='#/glossary?term=Satisfaction'>satisfaction</a>.<br />Notes:<br />1.\tA usability test is managed by a <a href='#/glossary?term=Usability tester'>usability tester</a>.<br />2.\tA usability test usually has three phases:<br />a.\tPlanning, including writing the <a href='#/glossary?term=Usability test plan'>usability test plan</a>, writing the usability <a href='#/glossary?term=Test script'>test script</a>, and <a href='#/glossary?term=Recruiting'>recruiting</a> suitable usability <a href='#/glossary?term=Test participant'>test participant</a>s,<br />b.\tConducting <a href='#/glossary?term=Usability test session'>usability test session</a>s as described in note 3,<br />c.\tCommunicating usability <a href='#/glossary?term=Finding'>finding</a>s, including writing the usability <a href='#/glossary?term=Test report'>test report</a>.<br />3.\tA usability test consists of a number of usability test sessions. In each session, a <a href='#/glossary?term=Usability test participant'>usability test participant</a> attempts to carry out representative usability <a href='#/glossary?term=Test task'>test task</a>s using the interactive system or a <a href='#/glossary?term=Prototype'>prototype</a> of the interactive system. Usually, usability test sessions are moderated by a <a href='#/glossary?term=Moderator'>moderator</a> and observed by a number of <a href='#/glossary?term=Observer'>observer</a>s, who are often <a href='#/glossary?term=Stakeholder'>stakeholder</a>s. A <a href='#/glossary?term=Note-taker'>note-taker</a> records important usability findings.<br />4.\tThe concept \"usability test\" usually refers to a test where the usability test participant and the moderator are in the same physical location. Other forms of usability tests are <a href='#/glossary?term=Remote usability test'>Remote usability test</a> and <a href='#/glossary?term=Unattended usability test'>Unattended usability test</a>.<br />5.\tTesting may result in qualitative or quantitative data. <br />6.\tTesting may occur at any time during <a href='#/glossary?term=Human-centred design'>human-centred design</a>, from early analysis through interactive system delivery and beyond. Testing may be based on paper sketches or display mock-ups, as well as on interactive systems under design and completed interactive systems.<br />7.\t<a href='#/glossary?term=Role'>Role</a>s in a usability test are:<br />a.\tModerator;<br />b.\tNote-taker;<br />c.\tObserver;<br />d.\tUsability test participant.",
    "description-german": "Eine <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a> bei der repräsentative <a href='#/glossary?term=Benutzer'>Benutzer</a> bestimmte <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n mit dem interaktiven System ausführen, um <a href='#/glossary?term=Usability-Problem'>Usability-Problem</a>e oder die Messwerte für <a href='#/glossary?term=Effektivität'>Effektivität</a>, <a href='#/glossary?term=Effizienz'>Effizienz</a> und <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a> zu erfassen. <br />Anmerkungen:<br />1.\tEin <a href='#/glossary?term=Usability'>Usability</a>-Test wird von einem <a href='#/glossary?term=Usability-Tester'>Usability-Tester</a> geleitet.<br />2.\tEin Usability-Test besteht üblicherweise aus 3 Phasen:<br />a.\tPlanung, dazu gehören: Schreiben des Usabiliy-Testplans, schreiben des <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testskript'>Testskript</a>'>Usability-Testskript</a>s, und <a href='#/glossary?term=Rekrutierung'>Rekrutierung</a> von passenden <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a>n.<br />b.\tDurchführung der <a href='#/glossary?term=Usability-Testsitzung'>Usability-Testsitzung</a>en wie in Anmerkung 3 beschrieben.<br />c.\t<a href='#/glossary?term=Usability-Testergebnis'>Usability-Testergebnis</a>se kommunizieren, einschließlich Schreiben eines <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testbericht'>Testbericht</a>'>Usability-Testbericht</a>s <br />3.\tEin Usability-Test umfasst eine Reihe von Usability-Testsitzungen. In jeder Sitzung versucht ein Usability-Testteilnehmer unter Benutzung des interaktiven Systems oder eines <a href='#/glossary?term=Prototyp'>Prototyp</a>en eines interaktiven Systems repräsentative <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testaufgabe'>Testaufgabe</a>'>Usability-Testaufgabe</a>n zu lösen. Üblicherweise werden Usability-Testsitzungen von einem <a href='#/glossary?term=Moderator'>Moderator</a> moderiert und von einer Anzahl von <a href='#/glossary?term=Beobachter'>Beobachter</a>n, die oft <a href='#/glossary?term=Interessenvertreter'>Interessenvertreter</a> sind, beobachtet. Ein <a href='#/glossary?term=Protokollant'>Protokollant</a> zeichnet wichtige <a href='#/glossary?term=Usability-<a href='#/glossary?term=Befund'>Befund</a>'>Usability-Befund</a>e auf.<br />4.\tDer Begriff ”Usability-Test” bezieht sich üblicherweise auf einen Test, bei dem sich der Usability-Testteilnehmer und der Moderator am gleichen physischen Ort befinden. Andere Arten von Usability-Tests sind: <a href='#/glossary?term=Remote Usability-Test'>Remote Usability-Test</a> und <a href='#/glossary?term=Unbeaufsichtigter Usability-Test'>Unbeaufsichtigter Usability-Test</a>.<br />5.\tDas Testen kann qualitative oder quantitative Daten ergeben. <br />6.\tDas Testen kann zu jedem Zeitpunkt während der menschzentrierten Gestaltung geschehen – von der frühen Analysephase bis hin zur Lieferung des interaktiven Systems und darüberhinaus. Die Tests können sowohl an Papierentwürfen oder anderen <a href='#/glossary?term=Low-fidelity-Prototyp'>low-fidelity-Prototyp</a>en als auch an in Entwicklung befindlichen oder bereits fertiggestellten interaktiven Systemen durchgeführt werden.<br />7.\t<a href='#/glossary?term=Rolle'>Rolle</a>n bei einem Usability-Test sind:<br />a.\tModerator<br />b.\tProtokollant<br />c.\tBeobachter<br />d.\tUsability-Testteilnehmer ",
    "term-english": "Usability test",
    "term-german": "Usability-Test"
  },
  {
    "categories": [
      "Test"
    ],
    "description-english": "A description of a <a href='#/glossary?term=Task'>task</a> that a <a href='#/glossary?term=Moderator'>moderator</a> asks a <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Test participant'>test participant</a> to carry out during a <a href='#/glossary?term=Usability test'>usability test</a>. ",
    "description-german": "Eine Beschreibung einer typischen <a href='#/glossary?term=Aufgabe'>Aufgabe</a>, die ein <a href='#/glossary?term=Moderator'>Moderator</a> einem <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> während eines <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s stellt. ",
    "term-english": "Usability test task",
    "term-german": "Usability-Testaufgabe"
  },
  {
    "categories": [
      "Evaluierung",
      "Test"
    ],
    "description-english": "A document that describes the results of a <a href='#/glossary?term=Usability'>usability</a> test. <br />Notes:<br />1.\tA usability <a href='#/glossary?term=Test report'>test report</a> typically contains <br />a.\tAn executive summary;<br />b.\t5-50 usability <a href='#/glossary?term=Finding'>finding</a>s (including <a href='#/glossary?term=Positive usability finding'>positive usability finding</a>s); <br />c.\tThe usability <a href='#/glossary?term=Test script'>test script</a> used for the <a href='#/glossary?term=Usability test'>usability test</a>;<br />d.\tOften, the usability test report also contains screenshots or pictures that supplement the description of important usability findings.<br />2.\tAlso referred to as test report.",
    "description-german": "Ein Dokument, das die Ergebnisse eines <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s beschreibt. <br />Anmerkungen:<br />1.\tEin <a href='#/glossary?term=Usability'>Usability</a>-<a href='#/glossary?term=Testbericht'>Testbericht</a> beinhaltet üblicherweise <br />a.\tEine Kurzdarstellung, <br />b.\t5-50 <a href='#/glossary?term=Usability-<a href='#/glossary?term=Befund'>Befund</a>'>Usability-Befund</a>e (auch positive),<br />c.\tDas <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testskript'>Testskript</a>'>Usability-Testskript</a> für den Usability-Test. <br />d.\tOft umfasst der Usability-Testbericht auch Screenshots oder Bilder die die Beschreibungen von wichtigen Usability-Befunden ergänzen.<br />2.\tWird auch nur als Testbericht bezeichnet.",
    "term-english": "Usability test report",
    "term-german": "Usability-Testbericht"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who evaluates <a href='#/glossary?term=User'>user</a> interfaces in various stages of realization. <br />Notes:<br />1.\tIn cooperation with other <a href='#/glossary?term=Stakeholder'>stakeholder</a>s, the <a href='#/glossary?term=Usability'>usability</a> tester <br />a.\tPlans usability <a href='#/glossary?term=Evaluation'>evaluation</a>s, <br />b.\tConducts <a href='#/glossary?term=Usability evaluation'>usability evaluation</a>s, <br />c.\tCommunicates usability <a href='#/glossary?term=Finding'>finding</a>s to stakeholders.<br />2.\tDuring <a href='#/glossary?term=Usability test'>usability test</a> sessions the usability tester has the <a href='#/glossary?term=Role'>role</a> of <a href='#/glossary?term=Moderator'>moderator</a> or <a href='#/glossary?term=Note-taker'>note-taker</a>.<br />3.\tUsability tester is a process role in <a href='#/glossary?term=Human-centred design'>human-centred design</a>.",
    "description-german": "Eine Person die <a href='#/glossary?term=Benutzungsschnittstelle'>Benutzungsschnittstelle</a>n in verschiedenen Stadien der Realisierung evaluiert. <br />Anmerkungen:<br />1.\tIn Kooperation mit anderen Interessensvertretern, muss der <a href='#/glossary?term=Usability-Test'>Usability-Test</a>er<br />a.\tdie <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a>en planen<br />b.\tdie <a href='#/glossary?term=Usability'>Usability</a>-Evaluierungen leiten<br />c.\tdie <a href='#/glossary?term=Usability-Testergebnis'>Usability-Testergebnis</a>se an die <a href='#/glossary?term=Interessenvertreter'>Interessenvertreter</a> kommunizieren.<br />2.\tWährend einer <a href='#/glossary?term=Usability-Testsitzung'>Usability-Testsitzung</a> übernimmt der Usability-Tester die <a href='#/glossary?term=Rolle'>Rolle</a> des <a href='#/glossary?term=Moderator'>Moderator</a>s oder des <a href='#/glossary?term=Protokollant'>Protokollant</a>en.<br />3.\tUsability-Tester ist eine Rolle im Prozess der menschzentrierten Gestaltung.",
    "term-english": "Usability tester",
    "term-german": "Usability-Tester"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "See <a href='#/glossary?term=Usability'>Usability</a> <a href='#/glossary?term=Finding'>finding</a>",
    "description-german": "Siehe <a href='#/glossary?term=Usability-<a href='#/glossary?term=Befund'>Befund</a>'>Usability-Befund</a>.",
    "term-english": "Usability test result",
    "term-german": "Usability-Testergebnis"
  },
  {
    "categories": [
      "Planung",
      "Evaluierung"
    ],
    "description-english": "A brief description of the purpose and extent of a <a href='#/glossary?term=Usability'>usability</a> test. <br />Notes:<br />1.\tThe <a href='#/glossary?term=Usability test'>usability test</a> plan is intended for management to decide whether the usability test should be run or not. It is deliberately brief and focuses on the <a href='#/glossary?term=Resources'>resources</a> required for the usability test.<br />2.\tThe usability test plan includes <br />a.\tNumber of planned usability <a href='#/glossary?term=Test participant'>test participant</a>s;<br />b.\tApproximate length of each <a href='#/glossary?term=Usability test session'>usability test session</a>;<br />c.\tName of <a href='#/glossary?term=Moderator'>moderator</a>;<br />d.\tTime plan;<br />e.\tA cost estimate for the usability test including person hours.<br />3.\tFurther details about the usability test such as usability test <a href='#/glossary?term=Task'>task</a>s, test method and required software and hardware are provided in the usability <a href='#/glossary?term=Test script'>test script</a>.",
    "description-german": "Eine kurze Beschreibung des Zwecks und Umfangs eines <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s. <br />Anmerkungen:<br />1.\tDer <a href='#/glossary?term=Usability'>Usability</a>-Testplan ist für das Management vorgesehen, um entscheiden zu können, ob der Usability-Test durchgeführt werden sollte oder nicht. Der Plan ist absichtlich kurz gehalten und fokussiert auf die für den Usability-Test benötigten <a href='#/glossary?term=Ressourcen'>Ressourcen</a>.<br />2.\tDer Usability-Testplan beinhaltet <br />a.\tDie Anzahl geplanter <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a>, <br />b.\tDie ungefähre Länge jeder <a href='#/glossary?term=Usability-Testsitzung'>Usability-Testsitzung</a>, <br />c.\tDen Namen des <a href='#/glossary?term=Moderator'>Moderator</a>s, <br />d.\tEinen Zeitplan, <br />e.\tEine Kostenschätzung für den Usability-Test einschließlich Personenstunden.<br />3.\tWeitere Details über den Usability-Test wie z.B. <a href='#/glossary?term=Usability-<a href='#/glossary?term=Test<a href='#/glossary?term=Aufgabe'>aufgabe</a>'>Testaufgabe</a>'>Usability-Testaufgabe</a>n, Testmethode und erforderliche Soft- und Hardware werden im <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testskript'>Testskript</a>'>Usability-Testskript</a> bereitgestellt.",
    "term-english": "Usability test plan",
    "term-german": "Usability-Testplan"
  },
  {
    "categories": [
      "Gestaltung",
      "Test"
    ],
    "description-english": "A part of a <a href='#/glossary?term=Usability'>usability</a> test where one usability <a href='#/glossary?term=Test participant'>test participant</a> carries out representative <a href='#/glossary?term=Usability test'>usability test</a> <a href='#/glossary?term=Task'>task</a>s using the <a href='#/glossary?term=Interactive system'>interactive system</a> or a <a href='#/glossary?term=Prototype'>prototype</a> of the interactive system.<br />Notes:<br />1.\tIn a usability test session, the <a href='#/glossary?term=Moderator'>moderator</a> typically <br />a.\tGreets the <a href='#/glossary?term=Usability test participant'>usability test participant</a>; <br />b.\tConducts the usability <a href='#/glossary?term=Briefing'>briefing</a> and pre-session <a href='#/glossary?term=Interview'>interview</a>, <br />c.\tHands out usability <a href='#/glossary?term=Test task'>test task</a>s to the usability test participant<br />d.\tObserves the usability test participant during <a href='#/glossary?term=Usability test task'>usability test task</a> solution, <br />e.\tConducts the <a href='#/glossary?term=Post-session interview'>post-session interview</a>.<br />2.\tCompare to Usability test.",
    "description-german": "Der Teil eines <a href='#/glossary?term=Usability-Test'>Usability-Test</a>s, bei dem ein bestimmter <a href='#/glossary?term=Usability-<a href='#/glossary?term=Testteilnehmer'>Testteilnehmer</a>'>Usability-Testteilnehmer</a> repräsentative <a href='#/glossary?term=Usability-<a href='#/glossary?term=Test<a href='#/glossary?term=Aufgabe'>aufgabe</a>'>Testaufgabe</a>'>Usability-Testaufgabe</a>n unter Benutzung des interaktiven Systems oder des <a href='#/glossary?term=Prototyp'>Prototyp</a>en eines interaktiven Systems löst.<br />Anmerkungen:<br />1.\tTypische Aufgaben des <a href='#/glossary?term=Moderator'>Moderator</a>s während einer <a href='#/glossary?term=Usability'>Usability</a>-Testsitzung sind:<br />a.\tBegrüßung des Usability-Testteilnehmers;<br />b.\tDurchführung des <a href='#/glossary?term=Briefing'>Briefing</a>s und des <a href='#/glossary?term=Pre-Session <a href='#/glossary?term=Interview'>Interview</a>'>Pre-Session Interview</a>s;<br />c.\tÜbergabe von Usability-Testaufgaben an den Usability-Testteilnehmer.<br />d.\t<a href='#/glossary?term=Beobachtung'>Beobachtung</a> des jeweiligen Usability-Testteilnehmers während der Erledigung der Aufgaben;<br />e.\tDurchführung des <a href='#/glossary?term=Post-Session Interview'>Post-Session Interview</a>s.<br />2.\tVergleiche mit Usability-Test.",
    "term-english": "Usability test session",
    "term-german": "Usability-Testsitzung"
  },
  {
    "categories": [
      "Test",
      "Evaluierung"
    ],
    "description-english": "A checklist used by a <a href='#/glossary?term=Moderator'>moderator</a> in a <a href='#/glossary?term=Usability'>usability</a> test to keep track of <a href='#/glossary?term=Briefing'>briefing</a> and pre-session <a href='#/glossary?term=Interview'>interview</a> questions, <a href='#/glossary?term=Usability test'>usability test</a> <a href='#/glossary?term=Task'>task</a>s, and <a href='#/glossary?term=Post-session interview'>post-session interview</a> questions.",
    "description-german": "Eine von einem <a href='#/glossary?term=Moderator'>Moderator</a> in einem <a href='#/glossary?term=Usability-Test'>Usability-Test</a> verwendete Checkliste, um den Überblick über die Fragen des <a href='#/glossary?term=Briefing'>Briefing</a>s und des <a href='#/glossary?term=Pre-Session <a href='#/glossary?term=Interview'>Interview</a>'>Pre-Session Interview</a>s, die <a href='#/glossary?term=Usability-<a href='#/glossary?term=Test<a href='#/glossary?term=Aufgabe'>aufgabe</a>'>Testaufgabe</a>'>Usability-Testaufgabe</a>n und die Fragen des <a href='#/glossary?term=Post-Session Interview'>Post-Session Interview</a>s zu behalten.",
    "term-english": "Usability test script",
    "term-german": "Usability-Testskript"
  },
  {
    "categories": [
      "Rollen",
      "Test"
    ],
    "description-english": "A representative <a href='#/glossary?term=User'>user</a> who solves typical <a href='#/glossary?term=Task'>task</a>s in a <a href='#/glossary?term=Usability'>usability</a> test.",
    "description-german": "Repräsentativer <a href='#/glossary?term=Benutzer'>Benutzer</a>, der typische <a href='#/glossary?term=Aufgabe'>Aufgabe</a>n in einem <a href='#/glossary?term=Usability-Test'>Usability-Test</a> löst.",
    "term-english": "Usability test participant",
    "term-german": "Usability-Testteilnehmer"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who creates interactive <a href='#/glossary?term=Prototype'>prototype</a>s and implements the <a href='#/glossary?term=Dialogue'>dialogue</a> and <a href='#/glossary?term=User'>user</a> experience based on the design created by the <a href='#/glossary?term=Interaction designer'>interaction designer</a> and the scenarios created by the user <a href='#/glossary?term=Requirement'>requirement</a>s engineer. The <a href='#/glossary?term=User interface'>user interface</a> designer also creates interactive prototypes.<br />Note: <br />1.\tUser interface designer is a process <a href='#/glossary?term=Role'>role</a> in <a href='#/glossary?term=Human-centred design'>human-centred design</a>.",
    "description-german": "Eine Person die den <a href='#/glossary?term=Dialog'>Dialog</a> und das <a href='#/glossary?term=Benutzererlebnis'>Benutzererlebnis</a> basierend auf dem Design des  Interaktions­designers und den <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Szenario'>szenario</a>'>Nutzungsszenario</a>s des <a href='#/glossary?term=User Requirements Engineer'>User Requirements Engineer</a>s implementiert. Der User Interface Designer erzeugt ausserdem interaktive <a href='#/glossary?term=Prototyp'>Prototyp</a>en.<br />Anmerkung:<br />1.\tUser Interface Designer ist eine <a href='#/glossary?term=Rolle'>Rolle</a> im Prozess der menschzentrierten Gestaltung.",
    "term-english": "User interface designer",
    "term-german": "User Interface Designer"
  },
  {
    "categories": [
      "Rollen"
    ],
    "description-english": "A person who identifies and describes the actual or intended <a href='#/glossary?term=Context of use'>context of use</a> of <a href='#/glossary?term=User'>user</a>s, and derives the user <a href='#/glossary?term=Requirement'>requirement</a>s and related <a href='#/glossary?term=Organizational requirement'>organizational requirement</a>s, which need to be realized for a specific project. <br />Notes:<br />1.\tThe <a href='#/glossary?term=User requirement'>user requirement</a>s engineer identifies the context of use based on methods such as <a href='#/glossary?term=Interview'>interview</a>s with users, <a href='#/glossary?term=Observation'>observation</a>s, <a href='#/glossary?term=User survey'>user survey</a>s, <a href='#/glossary?term=Usability'>usability</a> <a href='#/glossary?term=Evaluation'>evaluation</a>s, expert analysis, etc.<br />2.\tThe user requirements engineer generates <a href='#/glossary?term=Persona'>persona</a>s and scenarios that ensure the <a href='#/glossary?term=Effectiveness'>effectiveness</a>, <a href='#/glossary?term=Efficiency'>efficiency</a> and <a href='#/glossary?term=Satisfaction'>satisfaction</a> when performing <a href='#/glossary?term=Task'>task</a>s with the <a href='#/glossary?term=Interactive system'>interactive system</a>.<br />3.\t User requirements engineer is a process <a href='#/glossary?term=Role'>role</a> in <a href='#/glossary?term=Human-centred design'>human-centred design</a>.",
    "description-german": "Eine Person die den tatsächlichen oder geplanten <a href='#/glossary?term=Nutzungskontext'>Nutzungskontext</a> von <a href='#/glossary?term=Benutzer'>Benutzer</a>n identifiziert und beschreibt. Daraus leitet der User Requirements Engineer die <a href='#/glossary?term=Nutzungs<a href='#/glossary?term=Anforderung'>anforderung</a>'>Nutzungsanforderung</a>en und damit verbundene <a href='#/glossary?term=Organisatorische Anforderung'>organisatorische Anforderung</a>en ab, die für ein bestimmtes Projekt umgesetzt werden müssen. <br />Anmerkungen:<br />1.\tDer User Requirements Engineer identifiziert den Nutzungskontext durch Methoden wie Benutzer<a href='#/glossary?term=Interview'>interview</a>s, <a href='#/glossary?term=Beobachtung'>Beobachtung</a>en, <a href='#/glossary?term=Benutzerbefragung'>Benutzerbefragung</a>en, <a href='#/glossary?term=Usability-<a href='#/glossary?term=Evaluierung'>Evaluierung</a>'>Usability-Evaluierung</a>en, Expertenanalysen usw.<br />2.\tDer User Requirements Engineer erzeugt Nutzungs­szenarien, die die <a href='#/glossary?term=Effektivität'>Effektivität</a>, <a href='#/glossary?term=Effizienz'>Effizienz</a> und <a href='#/glossary?term=Zufriedenstellung'>Zufriedenstellung</a> bei der <a href='#/glossary?term=Aufgabe'>Aufgabe</a>nerledigung mit dem interaktiven System sicherstellen sollen.<br />3.\tUser Requirements Engineer ist eine <a href='#/glossary?term=Rolle'>Rolle</a> im Prozess der menschzentrierten Gestaltung.",
    "term-english": "User requirements engineer",
    "term-german": "User Requirements Engineer"
  },
  {
    "categories": [
      "Planung"
    ],
    "description-english": "A form of <a href='#/glossary?term=Low-fidelity <a href='#/glossary?term=Prototype'>prototype</a>'>low-fidelity prototype</a> consisting of schematic diagrams typically comprised of lines, rectangular boxes and text that represent the intended interaction design and navigational flow.<br />Note:<br />1.\tWireframes typically do not address visual design and precise layout.<br />2.\tA wireframe is a mockup of one screen. A suitable collection of wireframes forms a low-fidelity prototype.",
    "description-german": "Eine Form des <a href='#/glossary?term=Low-fidelity-<a href='#/glossary?term=Prototyp'>Prototyp</a>'>Low-fidelity-Prototyp</a>s bestehend aus schematischen Diagrammen, typischerweise dargestellt mit Linien, rechteckigen Kästen und Text der das Interaktionsdesign und den Navigationsfluss repräsentiert.<br />Anmerkungen:<br />1.\tWireframes adressieren üblicherweise nicht das visuelle Design und das genaue Layout.<br />2.\tEin Wireframe ist ein Mockup (Modell, Attrappe) eines Bildschirms. Eine adäquate Sammlung von Wireframes formt einen Low-fidelity-Prototyp.<br />3.\tAuf Deutsch auch „Drahtgeflecht“ genannt.",
    "term-english": "Wireframe",
    "term-german": "Wireframe"
  },
  {
    "categories": [
      "Anforderungen",
      "Prinzipien"
    ],
    "description-english": "Intended outcome.",
    "description-german": "Angestrebtes Arbeitsergebnis.",
    "term-english": "Goal",
    "term-german": "Ziel"
  },
  {
    "categories": [
      "Evaluierung",
      "Prinzipien"
    ],
    "description-english": "Freedom from discomfort, and positive attitudes towards the use of the product<br />Notes: <br />1.\tThe proposed new ISO definition may be a bit easier to understand: Attitudes related to the use of an <a href='#/glossary?term=Interactive system'>interactive system</a>, and the emotional and physical outcomes arising from use.<br />2.\tSatisfaction is one of the three measurable attributes for <a href='#/glossary?term=Usability'>usability</a>. The others are <a href='#/glossary?term=Effectiveness'>effectiveness</a> and <a href='#/glossary?term=Efficiency'>efficiency</a>.<br />3.\tSatisfaction is measured using a <a href='#/glossary?term=Questionnaire'>questionnaire</a>.",
    "description-german": "Freiheit von Beeinträchtigung und positive Grundeinstellung zur Nutzung des Produkts<br />Anmerkungen:<br />1.\tDer neue Vorschlag der ISO Definition könnte etwas einfacher zu verstehen sein: Einstellungen bezogen auf die Verwendung des interakiven Systems und die emotionalen und physischen Folgen der tatsächlichen Verwendung.<br />2.\tZufriedenstellung ist eines der drei Meßbaren Attribute von <a href='#/glossary?term=Usability'>Usability</a>. Die anderen beiden sind <a href='#/glossary?term=Effektivität'>Effektivität</a> und <a href='#/glossary?term=Effizienz'>Effizienz</a>.<br />3. \tZufriedenstellung kann mit Fragebögen gemessen werden.",
    "term-english": "Satisfaction",
    "term-german": "Zufriedenstellung"
  }
]